{
    "Decision": {
        "decision": "Reject",
        "title": "ICLR committee final decision",
        "comment": "This paper presents an interesting application of variational methods for time series, in particular VRNN-like approaches, for stochastic volatility. Applications such as these are clearly in the scope of the conference, which was a point that one of the reviewer brought up. That said, questions of context, especially with regards to relation to different approaches, especially smoothing are relevant. Also, the number of methods GRACH and stochastic volatility is immense and this makes assessing the impact of this very hard to do and is more is needed to address this point. This paper is certainly interesting, but given these concerns, the paper is not yet rady for acceptance at the conference."
    },
    "Reviews": [
        {
            "title": "A relevant contribution to time series modelling with flexible nonlinear models",
            "rating": "6: Marginally above acceptance threshold",
            "review": "The authors propose a recurrent variational neural network approach to modelling volatility in financial time series. This model consists of an application of Chung et al.’s (2015) VRNN model to volatility forecasting, wherein a Variational Autoencoder (VAE) structure is repeated at each time step of the series. \n\nThe paper is well written and easy to follow (although this reviewer suggests applying a spelling checking, since the paper contains a number of harmless typos). \n\nThe paper’s main technical contribution is to stack two levels of recurrence, one for the latent process and one for the observables. This appears to be a novel, if minor contribution. The larger contribution is methodological, in areas of time series modelling that are both of great practical importance and have hitherto been dominated by rigid functional forms. The demonstration of the applicability and usefulness of general-purpose non-linear models for volatility forecasting would be extremely impactful.\n\nI have a few comments and reservations with the paper:\n1) Although not  mentioned explicitly, the authors’ framework are couched in terms of carrying out one-timestep-ahead forecasts of volatility. However, many applications of volatility models, for instance for derivative pricing, require longer-horizon forecasts. It would be interesting to discuss how this model could be extended to forecast at longer horizons.\n \n2) In Section 4.4, there’s a mention that a GARCH(1,1) is conditionally deterministic. This is true only when forecasting 1 time-step in the future. At longer horizons, the GARCH(1,1) volatility forecast is not deterministic. \n\n3) I was initially unhappy with the limitations of the experimental validation, limited to comparison with a baseline GARCH model. However, the authors provided more comparisons in the revision, which adds to the quality of the results, although the models compared against cannot be considered state of the art. It would be well advised to look into R packages such as `stochvol’ and ‘fGarch’ to get implementations of a variety of models that can serve as useful baselines, and provide convincing evidence that the modelled volatility is indeed substantially better than approaches currently entertained by the finance literature.\n\n4) In Section 5.2, more details should be given on the network, e.g. number of hidden units, as well as the embedding dimension D_E (section 5.4)\n\n5) In Section 5.3, more details should be given on the data generating process for the synthetic data experiments. \n\n6) Some results in the appendix are very puzzling: around jumps in the price series, which are places where the volatility should spike, the model reacts instead by huge drops in the volatility (Figure 4(b) and (c), respectively around time steps 1300 and 1600). This should be explained and discussed.\n\nAll in all, I think that the paper provides a nice contribution to the art of volatility modelling. In spite of some flaws, it provides a starting point for the broader impact of neural time series processing in the financial community.\n",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "Lack of smoothing for learning and lack of novelty",
            "rating": "5: Marginally below acceptance threshold",
            "review": "\nThe authors propose a recurrent neural network approach for constructing a\nstochastic volatility model for financial time series. They introduce an\ninference network based on a recurrent neural network that computes the\napproximation to the posterior distribution for the latent variables given the\npast data. This variational approximation is used to maximize the marginal\nlikelihood in order to learn the parameters of the model. The proposed method\nis validated in experiments with synthetic and real-world time series, showing\nto outperform parametric GARCH models and a Gaussian process volatility model.\n\nQuality:\n\nThe method proposed seems technically correct, with the exception that in\nequation (19) the inference model is doing filtering and not smoothing, in the\nsense that the posterior for z_t' only depends on those other z_t and x_t\nvalues with t<t', but in the true posterior p(Z|X) each z_t depends on all the\nX. This means the proposed learning method is inefficient. The reference below\nshows how to perform smoothing too and the results in that paper show indeed that\nsmoothing produces better results for learning the model.\n\nSequential Neural Models with Stochastic Layers Fraccaro, Marco and S\\o nderby,\nS\\o ren Kaae and Paquet, Ulrich and Winther, Ole In NIPS 2016.\n\nIt is not clear if the method proposed in the above reference would perform better \njust because of using smoothing when learning the model parameters.\n\nClarity:\n\nThe paper is clearly written and easy to read.\n\nFor the results on real-world data, in Table 1, how is the NLL computed? Is the\naverage NLL across the 162 time series?\n\nOriginality:\n\nThe method proposed is not very original. Previous work has already used the\nvariational approach with the reparametrization trick to learn recurrent neural\nnetworks with stochastic units (see the reference above). It seems that the main\ncontribution of the authors is to apply this type of techniques to the problem\nof modeling financial time series.\n\nSignificance:\n\nThe results shown are significant, the method proposed by the authors\noutperforms previous approaches. However, there is a huge amount of techniques\navailable for modeling financial time-series. The number of GARCH variants is\nprobably close to hundreds, each one claiming to be better than the others.\nThis makes difficult to quantify how important the results are.\n",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "An interesting application of RNN generative model to financial data",
            "rating": "5: Marginally below acceptance threshold",
            "review": "Thank you for an interesting read.\n\nI found the application of VRNN type generative model to financial data very promising. But since I don't have enough background knowledge to judge whether the performance gap is significant or not, I wouldn't recommend acceptance at this stage. \n\nTo me, the biggest issue for this paper is that I'm not sure if the paper contains significant novelty. The RNN-VAE combination has been around for more than a year and this paper does not propose significant changes to it. Maybe this paper fits better to an application targeting conference, rather than ICLR. But I'm not exactly sure about ICLR's acceptance criteria, and maybe the committee actually prefer great performances and interesting applications?",
            "confidence": "3: The reviewer is fairly confident that the evaluation is correct"
        }
    ]
}