{
    "Decision": {
        "decision": "Reject",
        "title": "ICLR committee final decision",
        "comment": "The reviewers pointed out several issues with the paper, and all recommended rejection."
    },
    "Reviews": [
        {
            "title": "Interesting work but poorly presented",
            "rating": "4: Ok but not good enough - rejection",
            "review": "The paper presents a repurposing of rectified factor networks proposed\nearlier by the same authors to biclustering. The method seems\npotentially quite interesting but the paper has serious problems in\nthe presentation.\n\n\nQuality:\n\nThe method relies mainly on techniques presented in a NIPS 2015 paper\nby (mostly) the same authors. The experimental procedure should be\nclarified further. The results (especially Table 2) seem to depend\ncritically upon the sparsity of the reported clusters, but the authors\ndo not explain in sufficient detail how the sparsity hyperparameter is\ndetermined.\n\n\nClarity:\n\nThe style of writing is terrible and completely unacceptable as a\nscientific publication. The text looks more like an industry white\npaper or advertisement, not an objective scientific paper. A complete\nrewrite would be needed before the paper can be considered for\npublication. Specifically, all references to companies using your\nmethods must be deleted.\n\nAdditionally, Table 1 is essentially unreadable. I would recommend\nusing a figure or cleaning up the table by removing all engineering\nnotation and reporting numbers per 1000 so that e.g. \"0.475 +/- 9e-4\"\nwould become \"475 +/- 0.9\". In general figures would be preferred as a\nprimary means for presenting the results in text while tables can be\nincluded as supplementary information.\n\n\nOriginality:\n\nThe novelty of the work appears limited: the method is mostly based on\na NIPS 2015 paper by the same authors. The experimental evaluation\nappears at least partially novel, but for example the IBD detection is\nvery similar to Hochreiter (2013) but without any comparison.\n\n\nSignificance:\n\nThe authors' strongest claim is based on strong empirical performance\nin their own benchmark problems. It is however unclear how useful this\nwould be to others as there is no code available and the details of\nthe implementation are less than complete. Furthermore, the method\ndepends on many specific tuning parameters whose tuning method is not\nfully defined, leaving it unclear how to guarantee the generalisation\nof the good performance.\n",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "Interesting paper, but the exact model being used is difficult to understand. ",
            "rating": "5: Marginally below acceptance threshold",
            "review": "Clarity: The novel contribution of the paper --- Section 2.2 --- was very difficult to understand. The notation seemed inconsistent (particularly the use of l, p, and m), and I am still not confident that I understand the model being used.\n\nOriginality: The novelty comes from applying the RFN model (including the ReLU non-linearity and dropout training) to the problem of biclustering. It sounds like a good idea. \n\nSignificance: The proposed algorithm appears to be a useful tool for unsupervised data modelling, and the authors make a convincing argument that it is significant. (I.E. The previous state-of-the-art, FABIA, is widely used and this method both outperforms and addresses some of the practical difficulties with that method.)\n\nQuality: The experiments are high-quality. \n\nComments:\n1) The introduction claims that this method is much faster than FABIA because the use of rectified units allow it to be run on GPUs. It is not clear to me how this works. How many biclusters can be supported with this method? It looks like the number of biclusters used for this method in the experiments is only 3-5?\n2) The introduction claims that using dropout during training increases sparsity in the bicluster assignments. This seems like a reasonable hypothesis, but this claim should be supported with a better argument or experiments.\n3) How is the model deep? The model isn't deep just because it uses a relu and dropout.",
            "confidence": "2: The reviewer is willing to defend the evaluation, but it is quite likely that the reviewer did not understand central parts of the paper"
        },
        {
            "title": "Review on the paper",
            "rating": "5: Marginally below acceptance threshold",
            "review": "This paper applies RFN for biclustering to overcome the drawbacks in FABIA. The proposed method performs best among 14 biclustering methods, However, my first concern is that from the methodological point of view, the novelty of the proposed method seems small. The authors replied to the same question which another reviewer gave, but the replies were not so convincing. \n\nThis paper was actually difficult for me to follow. For instance, in Figure 1, a bicluster matrix is constructed as an outer product of $h$ and $w$. $h$ is a hidden unit, but what is $w$? I could not find any definition. Furthermore, I could not know how $h$ is estimated in this method. Therefore, I do NOT understand how this method performs biclustering. \n\nTotally, I am not sure that this paper is suitable for publication. \n\nProns:\nEmpirical performance is good.\n\nCons:\nNovelty of the proposed method\nSome description in the paper is unclear.\n\n",
            "confidence": "2: The reviewer is willing to defend the evaluation, but it is quite likely that the reviewer did not understand central parts of the paper"
        }
    ]
}