{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Accept (Spotlight)",
        "comment": "The reviewers are unanimous that this is a strong submission that deserves to be accepted."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "This paper presents an optimal transport based solution to differentiate through the process of contact generation in differentiable physics engines. This enables solving contact-rich multi-step manipulation tasks for deformable bodies.\n",
            "main_review": "### Strengths\n\n* **S1** This paper addresses an important gap in differentiable physics engines. Existing differentiable physics engines (Degrave et al., Qiao et al., and others) provide gradients through the physical simulation steps (i.e., evolution of state variables like velocity/acceleration/displacement) with respect to chosen initial physical parameters (forces/torques etc.). However, they provide accurate gradients for a task only if the contacts required to accomplish the task already are known a priori. To the best of my knowledge, there isn’t an approach that also differentiates through the ‘contact generation’ step, which involves reasoning over the space of all possible contacts.\n* **S2** This paper takes an optimal transport based approach, which is theoretically (physically) motivated and has advantages of simplicity.\n* **S3** The proposed approach significantly outperforms a gradient descent baseline (differentiable simulation without differentiating through contact generation) and select reinforcement learning baselines.\n* **S4** The paper is well-written and easy to follow\n\n\n### Weaknesses\n\n* **W1** This paper seems to make a few implicit assumptions that potentially have ramifications on whether this will generalize to noisy or simply incorrect object templates. I believe this requires some discussions, likely in a limitations (sub-)section. For instance, if the target trajectory is obtained from an object with similar external appearance (e.g., a cuboid) but with very different internal configuration (low or non-uniform density opposed to a uniform density structure), one would expect optimal transport mappings to vary significantly. This may in-turn impact subsequent optimization steps\n* **W2** In terms of baselines, the current manuscript compares with a gradient-based optimization method (PlasticineLab) and three RL approaches (SAC, PPO, TD3). However, as the primary aim of this paper is to design a gradient-based solution to multi-step contact-rich manipulation tasks, I believe there are other gradient-based variants that can be evaluated in this setup. One immediate approach that comes to mind is gradient descent with multiple restarts (i.e., differentiable simulation based optimization with multiple initial guesses opposed to a single guess). Another approach might also be to leverage Bayesian optimization for this task.\n* **W3** From the paper, it is unclear as to how the runtime of the approaches vary — reporting runtime overhead for each baseline would help better contextualize this paper\n\n\n### Minor remarks\n\nThese are nitpicks; I believe these are easily addressed in a minor revision. The authors need not respond to these in the rebuttal phase.\n\n* At multiple places in the manuscript, “differential” has been the word used to describe what I believe should be “differentiable” (e.g., differential simulator -> differentiable simulator)\n* Penultimate paragraph of page 3: “Such phenomena are commonly observed across soft body manipulation tasks using the differentiable physics solver.” Perhaps reference a concrete published work to corroborate this claim?\n* The best-performing approaches may be highlighted (boldface-d) in table 2\n\n",
            "summary_of_the_review": "Overall, I believe this paper tackles an important and interesting problem in the differentiable physics community. While I believe the proposed approach has merit, I would like to see some of the aforementioned issues (particularly discussion of failure modes and choice of baselines) before I can recommend acceptance.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This paper proposes a method to solve the multistage manipulation tasks for soft materials. Differentiable physics has been used in controlling and manipulating soft materials since DiffTaichi. However, optimization methods based on local gradient information can be easily trapped in local minima. This paper divides a long task into small stages, within which the contact area will remain unchanged. The contact points are selected by choosing the regions with the largest transport priorities. The end effectors are then placed with poses from the candidate set. After running trajectory optimization using physics gradients, the final pose is finalized as the pose with minimum loss.",
            "main_review": "This method design an automatic strategy to stage long manipulation tasks and discover the contact points for each task. The use of optimal transport priority as a heuristic for contact areas is reasonable and intuitive. The same heuristic is also used in DiffAqua, the authors might want to cite and discuss their similarities.  As far as I can tell from the demo video, this method can successfully perform long manipulation tasks that I have never seen in other differentiable physics papers, which is impressive. However, the optimal transport heuristic might be only suitable for these MPM-based objects, it remains interesting how to apply this method to rigid or elastic soft materials.\n\nSome concerns that I have,\n1. What are the definitions of $\\alpha, \\beta$ in Sec. 3.1?\n2. This is actually a greedy algorithm, finding the best contact areas at the current stage and deforming the object to the target shape as close as possible. Without global planning, is it possible that the schedule is suboptimal or can not even converge？\n3. How long it will take to find an optimal motion path? \n\n",
            "summary_of_the_review": "This paper proposes an intuitive and effective way to utilize differentiable physics in long-horizon motion planning for soft materials. Compared to previous papers like DiffTaichi and PlasticineLab, this method can better handle multistage tasks. The demo videos show its capacity to plan very long tasks (up to 140s).",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "The paper proposed an algorithm to discover appropriate contact points for deformable object manipulation. A key component of the proposed algorithm is to use an optimal-transport approach that computes a transport priority score for each particle in the deformable body. This score is then used to guide a grid search procedure to determine the best initial contact point for the manipulation. For multiple manipulators, a pre-defined set of poses are enumerated to find the best pose to use. The proposed algorithm is evaluated on tasks that requires a single manipulation motion or a sequence of motions to shape a deformable object into desired shapes. The result shows improved performance compared to prior methods and enables completion of novel tasks that prior methods failed.",
            "main_review": "The paper is in general well written and the proposed method produces quite interesting results. However, I do have some questions that I hope the authors could help address:\n\n1) In the single manipulator placement algorithm: is the d() function the distance between the particle to the closest point on the manipulator, or the center of the manipulator? Also, is orientation considered during the placement optimization?\n\n2) How does the algorithm determine when to switch to the next stage during a multi-stage task? Is it time-based, state-based, or reward-based?\n\n3) For the task where the deformable object is translated/transported to a different location, does all particles receive the the same priority score? If so, how does the algorithm figure out that the best contact points? For example, if the deformable object is very flexible and the best contact point is to hold it from bottom. More generally, it’s not clear whether the current approach can take physical information into account.\n\n4) The heuristics approach of contact selection seems reasonable in general. It would be helpful if some ground-truth results could be shown to further support the optimality of the result, e.g. by comparing to an exhaustive grid search approach.\n\n5) The paper currently did not talk about how the controller optimization with differentiable physics is done. Although it’s mostly prior work, it would be nice to include some descriptions, maybe in appendix, to make the paper more self-contained.\n",
            "summary_of_the_review": "I think the paper presents interesting work that achieves non-trivial results in deformable object manipulation. Some of the details are missing from the text as discussed above, which would help better gauge the impact of the work and help reproduce the work by other researchers. Overall, I think the work makes a good contribution to the conference.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        }
    ]
}