{
    "Decision": "",
    "Reviews": [
        {
            "summary_of_the_paper": "The authors propose using complex functions to analyze and understand the phenomenon of adversarial examples. They use holomorphic functions and analyze the corresponding maximum margin classifier. Through synchronization they turn an $\\ell^2$ regularization into a regularization of the derivative, which they argue promotes robustness. They then include experimental results as evidence for their claims.",
            "main_review": "It is unclear what is gained by using complex variables. Problems in $\\mathbb{R}^d$ are extended to $\\mathbb{C}^d$. But then it is not clear what is gained if all of the samples are in the real submanifold. The paper then proceeds by considering problems naturally in $\\mathbb{C}^d$ (for which no applications are given).\n\nThe explanation given for why adversarial examples transfer is that \"all holomorphic hypotheses are forced to converge to the orthogonal projection of the optimal Bayes classifier\". This is at odds with their proposal for a way to mitigate adversarial examples, since the projection of the optimal model \"is independent of the details of implementation or training\".\n\nThe experiments are on relatively small data sets, and not many results are given. As a result, they are unconvincing.\n\nThe use of synchronization to regularize the derivative is an interesting idea.",
            "summary_of_the_review": "It is unclear what is gained by using the framework proposed in the paper. The experimental results are unconvincing.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "1: strong reject",
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "The paper proposes a model based on holomorphic functions to explain the existence and transfer of adversarial examples.",
            "main_review": "Honestly speaking, I did not understand the paper. Despite the seemingly interesting idea, I find the paper quite hard to read. Observations from evidence, novel ideas and rigorous mathematical reasoning are all mixed together. It's very hard to spell out what is what. Answering the following questions in future versions may help.\n\nThe only reason the authors use complex variables and holomorphic functions is that an earlier work showed that S and C are perpendicular in a linear classifier. On the other hand, adversarial robustness is not interesting for linear classifiers. So why would complex variables help? I couldn't find a compelling reason for that.\n\nEquation 6 and 8 are mysterious. Why does Newton iteration yields the shortest curve?\n\nWhy does $\\mathcal{H}_n^\\Omega$ have a finite VC dimension? Isn't it a class of complex-valued functions?\n\nThe appearance of gradient in equation 9 seems to be based on an intuitive idea rather than a rigorous proof? There are so many such cases in the paper that I have trouble treating it as a theory paper despite the seemingly deep nature.\n\nThe title is a bit misleading as the paper doesn't actually use any feature of several complex variables which is absent in one complex variable.\n\nWhat happens when the domain is the entire space? There won't be a Bergman space in that case. Are domains other than poly-disk interesting? Is the Bergman kernel for the ball known?",
            "summary_of_the_review": "In its current form I don't think it's readable for ICLR audience, so I cannot recommend it. However, I think the idea is quite novel, so I encourage the authors polish and further develop it, and I look forward to the future versions of this paper. I'd also love to see other reviewers' opinion.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "In this paper, the authors attempt to account for the existence of adversarial examples by proposing a model they call the diverging derivative model.",
            "main_review": "I have made an earnest attempt to read thoroughly the main text of the submission.\n\nThe authors mention several shortcomings of their methods in the paper such as reliance on a polynomial function class. However I have several more fundamental issues with the approach which I found unaddressed in the paper:\n\nThe motivation for holomorphic functions here is unclear. For example, what benefit is there to the topology specifically of $\\mathbb C$ modelling adversarial examples that is absent from $\\mathbb{R}^2$?\n\nHow do holomorphic hypothesis functions work? What is the decision criterion when your hypothesis is $\\mathbb C$-valued? Have holomorphic hypotheses classes been studied in the literature? Is the approach here consistent with any other treatments?\n\nSeveral times the sets $\\mathcal S$ and $\\mathcal C$ are described as submanifolds. Do they indeed possess topologies having a manifold structure (locally Euclidean, preferably smooth)? Or is this an assumption that has been made. It is unclear.\n\nFor a paper that claims to eliminate adversarial examples, I was expecting a theorem or statement at some point. What is the central insight you are able to deliver through your theory of diverging derivatives?\n\nFinally, editorially, the authors should attempt to include all necessary notation and definitions as part of the paper. At least one symbol $A^2(\\Omega)$ is defined only in the appendix. \n",
            "summary_of_the_review": "The paper proposes what might be an interesting way to study the existence of adversarial examples. However I believe in its present form the exposition here is inappropriate for a venue such as ICLR. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "The purpose of the paper is to understand the existence of adversarial examples for the modern artificial neural network. Specifically, first, the paper introduces a novel approach in describing the submanifold of samples and the decision boundaries using a complex-valued hypothesis and gives a necessary condition for the hypothesis being robust to adversarial examples. Second, this paper gives an explanation for the transfer of adversarial examples between analytic hypotheses. Finally, this paper tries to propose methods for mitigating the affect of adversarial examples by generalizing the linear maximum margin classification to a certain hypothesis class.",
            "main_review": "Strengths:\n1. Novelty: The angle of the paper is novel. The paper tries to explain the existence of adversarial examples by analyzing the hypotheses using complex analysis tools. According to this paper, the existence of adversarial examples seems to be caused by certain analytic properties of the hypothesis class. And very importantly, the hypothesis class can unify some of the proposals raised in previous works. \n2. Significance: This paper might propose a possible direction for a general mathematical theory for adversarial robustness. There have been many good application work in the field of adversarial robustness. However, from the theoretical side, researchers are still in search of a unified theory to explain the existence and behavior of adversarial examples.\n\nWeakness:\n1. Rigorousness: This paper is a purely theoretical work in my opinion (though it has numerical simulations). Unfortunately, I did not find the claims in the paper is rigorous enough for a theoretical work. Specifically, the paper made several strong claims without rigorous mathematical analysis. For example, in section 2, the paper tries to explain the transfer phenomenon of adversarial examples from the lens of holomorphic optimal Bayes classifier. But there is no theorem/proof or detailed analysis, making the claim not convincing at all. Another example, in section 3, the paper lists the primal and dual problem for learning the maximum margin classifier, but there is again no rigorous mathematical derivation. Although the paper states that its claims are evident from the definition, as a reader, I did not find it evident at all. \nTo sum up, the problem of the current presentation of this paper is that I cannot tell which parts are rigorous theorems and which parts are just intuitions. Therefore, I am very concerned about the rigorousness of this paper, and I do not think it qualifies as a theoretical work.\nI recommend the authors to 1) state clearly which parts are rigorous math and which are just intuitions/illustrations 2) summarize all the rigorous parts into mathematical theorems, 3) then give rigorous proofs. ",
            "summary_of_the_review": "Although the angle of the paper is novel and the problem considered is very significant, I do not think the paper is rigorous enough.\nTherefore, my current recommendation is rejection.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        }
    ]
}