{
    "Decision": "",
    "Reviews": [
        {
            "summary_of_the_paper": "This paper proposes integration of diffeomorphic registration in the problem of deep learning based facial landmark localization for the purpose of cross-dataset and cross-annotation learning. This approach is considered as an alternative to SOTA direct regression approaches and heatmap approaches. The key component of this approach is the large deformation diffeomorphic metric mapping (LDDMM) based registration which predicts momenta as a unique parameterization of the deformation between an initial boundary and target boundary. Once LDDMM is predicted, the deformation layer transforms the landmarks of a reference (mean face) configuration on the test face. The novelty is the integration of existing LDDMM registration with an existing deep learning method. By conducting experiments on four public datasets, namely 300W, WFLW, HELEN, COFW-68, authors demonstrate the success of their method compared to SOTA in within-dataset cross-annotation learning, in cross-dataset learning (i.e., use of different training/testing datasets), and in cross-dataset cross-annotation learning.\n",
            "main_review": "Strengths:\n1. Cross-dataset and cross-annotation is a valid problem in the facial landmark alignment literature.\n2. The literature review sufficiently covers the related recent work.\n3. Effectiveness of the proposed approach is validated experimentally with comprehensive comparisons on four current datasets (300W, WFLW, HELEN, COFW-68) and against SOTA methods as well. Further evaluations and information in the supplement is also very supportive.\n4. Methods are explained well, implementation details are given and source code is available.\n",
            "summary_of_the_review": "My vote is for the acceptance of the paper. Integration of LDDMM based registration with deep learning can be considered as an alternative approach in the landmarking literature. Authors justify the usefulness of this approach for cross-dataset cross-annotation learning with solid experimentation.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "The paper presents a face alignment algorithm, termed LDDMM-Face, that aims to estimate a diffeomorphic mapping between facial contours in the source and target faces. To this end it extracts image features using a recent backbone, HRNet, and introduces a LDDMM head composed of a moment estimator and a deformation layer, that predict the actual mapping for each contour. It also contributes with a loss function that combines landmarks and contour errors. The relevance of this approach is that it enables cross-annotation face alignment. Since the diffeomorphic mapping is represented with a set of momenta that model the deformation of each curve, we may estimate from them a number of landmarks different from that used to train the model.",
            "main_review": "The paper is well organized and it is easy to read, although some important information is missing. It addresses a relevant and open problem in computer vision, namely, estimating facial landmarks in challenging situations and with different annotations.\n\nI have two fundamental critics, one related to the appropriateness of using a diffeomorphism to model in-the-wild face alignment and, the other, concerning the experimental validation.\n\nIn presence of extreme facial poses, e.g. yaws > 60º, the curves representing different facial contours (eyes, eyebrows, mouth) may appear twisted on the image with their landmarks intermingled. In this situation their mapping cannot be represented by a diffeomorphism. Further, the paper explains at the beginning of section 3.2 that, to achieve an accurate matching, the regularization term in eq. (2) is discarded. This term is a key component of the model to ensure that the mapping is diffeomorphic and it exists, Dupuis et al. 1998. Given these observations, I do not think that a diffeomorphism is the best way to model the face alignment problem.\n\nMost of the experimental results in sections 4.2 and 4.3 support the performance improvement when comparing the NME_c metric between the baseline HRNet model and LDDMM-Face. However, the paper does not explain how NRNet was trained to predict face contours, so it is difficult to discuss those results.\n\nFrom the results in Tables 8 (300W), 9 (WLFW) and 10 (AFLW) we may compare the proposed model against the baseline HRNet and the state-of-the-art (SOTA) in terms of NMR_l. The main conclusion is that the proposed approach performs worse than the baseline HRNet and much worse than the state-of-the-art for these data sets, that was not included in the tables:\n-For 300W, Table 8: 3DDE[a] (3.13), AWing[b] (3.07), Luvli[c] (3.23).\n-For WFLW, Table 9: Luvli[c] (4.37), AWing[b] (4.36)\n-For AFLW, Table 10: Luvli[c] (1.39), this is however NME_diag, strictly not comparable. Surprisingly, many results in this table coincide with those in Table.6 in [c], that normalize with NME_diag. This is not possible. Are the results in Table 10 correct?\n\nIn the cross-dataset (300W/COFW68) experiment in Table 4 the proposed model improves the baseline and ties with the top SOTA performer LUVLi [c]. However, the result reported for this experiment in [c] is 2.75 NME_diag, that is again not comparable with the normalization used in the paper. \n\nThe paper should provide results that are comparable with the published SOTA or explain how they were obtained, otherwise it is difficult to draw any conclusions.\n\nAccording to the results in Table 1 no landmark has a zero or negative Jacobian determinant. However, we can see in some of the results, e.g. Fig.9 first row, that, for extreme poses, the mouth, eye and eyebrow landmarks are intermingled. Can you explain this?\n\nOther comments:\n\nIn section 2, \"Registration-style models\" the paper reads \"Consequently, all these aforementioned methods can only perform within-annotation prediction but not cross-annotation prediction due to their relatively constrained registration.\" This statement is not correct. Any model predicting a global face warping, e.g. AAMs (Cootes, 2001; Matthews, 2004), may predict a map for each pixel in the source and destination images. \n\nIn section 2, \"Cross-dataset face alignment\" the paper reads \"However, no work has ever performed cross-dataset face alignment without re-annotation.\" This is not correct. In [a] extensive cross-dataset experiments, with a common subset of annotated landmarks, were performed.\n\nThe trajectory of the landmarks satisfy the ODE in expr (6). Later, in the same page, the authors state that the trajectory of the landmarks are given by expr (7). But this is not an actual solution since inside the integral of the right hand side appears the same trajectories that the authors want to solve for. In general it will not be possible to explicitly solve (6) and only a numerical solution of the trajectories can be obtained. The paper does not explain how tow solve these equations and how it is integrated in the model.\n\n300W 50% NME_l results in Table 2 do not agree with those in table 5, why?\n\nReferences:\n[a] 3DDE, Valle et. al. Face alignment using a 3D deeply-initialized ensemble of regression trees. Comput. Vis. Image Underst. 189, 2019.\n[b] AWing, Wang et al. Adaptive wing loss for robust face alignment via heatmap regression. In ICCV, 2019.\n[c] Luvli, Kumar et al. LUVLi Face Alignment: Estimating Landmarks' Location, Uncertainty, and Visibility Likelihood. CVPR 2020.\n",
            "summary_of_the_review": "The paper is supported by previous results on diffeomorphic curve matching. It extends learning-based diffeomorphic mapping approaches to the case in which the target curve is not available.\n\nThe use of this approach to perform face alignment is questionable, since the transformation may not be smooth in challenging configurations, such as those with extreme poses or occlusions.\n\nThe experimental evaluation proves that the proposed approach can estimate a number of landmarks different from those used when training. However, in a standard setting, with equal number of training and test landmarks, it deteriorates the performance of the baseline model and does not beat the state of the art.\n",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        },
        {
            "summary_of_the_paper": "This paper points out a problem in face alignment, i.e. the sparse- or cross-annotation. It also presents a novel face alignment algorithm, LDDMM-Face, together with a loss function to measure the distance between two curves. The method is demonstrated to be effective in both sparse- or cross-annotation settings.",
            "main_review": "The main idea of this paper is interesting, since it introduces a novel metric (inter-curve distance) in training, which is reasonable intuitively.\n\nHowever, there are several problems.\n1) The challenge is not illustrated clearly. The claim \"There is no doubt that cross-annotation prediction is one of the most challenging tasks in face alignment\" is too arbitrary.\n2) Be challenging does not guarantee the significance. The authors should illustrate why we should solve the cross- or sparse-annotation face alignment problem, and list some applications.\n3) The experiments in this paper is insufficient:\n    a. Only cross-annotation testing results are presented in the paper. Could you please show testing results in the original dataset?\n    b. Could you please show the affect of the curve loss to the original dataset?\n    c. What is the effect of the trade-off weight \\beta?\n    b. One of the most straightforward application for cross-annotation is to unite data sets with different annotation schemes for training. Have you tried to train with union dataset?\n",
            "summary_of_the_review": "The idea of this paper is interesting but the paper is not well-written. And I think this paper lacks some significant experiments.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "details_of_ethics_concerns": "Face alignment is a classical task. I do not think there would be any ethics concerns.",
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        },
        {
            "summary_of_the_paper": "This paper proposes a new method for localizing landmarks on the human face by extending existing learning-based diffeomorphic mapping method for the case when no template image is provided.",
            "main_review": "The paper presents a method which is of very narrow focus and certainly of low interest to ICLR community. Certainly, the problem of localizing facial landmarks is of low significance to the community and hence not a good fit for ICLR. But even by judging the paper from a computer vision perspective, it is not clear what the advantages over existing methods are. Cross-dataset face alignment is  standard practice in face alignment. The evaluation when there's a mismatch between training and testing annotations is of low interest as most datasets have been re-annotated with the 68 landmarks of 300W. Furthermore, the authors present very limited comparisons with SOTA and primarily on frontal faces which was an almost solved problem even before deep learning. I suggest the authors consider the following two papers for large scale evaluations of face alignment:\nLUVLi Face Alignment: Estimating Landmarks’Location, Uncertainty, and Visibility Likelihood, CVPR 2020\nHow far are we from solving the 2D & 3D Face Alignment problem? (and adataset of 230,000 3D facial landmarks), ICCV 2017",
            "summary_of_the_review": "Paper of limited interest to ICLR community. The authors should consider addressing more high challenging experiments and submit to a computer vision conference",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        }
    ]
}