{
    "Decision": "",
    "Reviews": [
        {
            "summary_of_the_paper": "This paper attempts to model the relations between latent codes in StyleGAN and the semantic attributes of human faces. A non-linear traversal function was proposed to map the original latent codes to the target codes, given original and the desired attributes of faces. A target image is then generated based on the mapped latent code by StyleGAN. Two sparse latent traversal constraints were also added to ensure other attributes remain unchanged during the process. The model is trained by minimizing the error between the estimated attribute of the target image and the target attribute along with the above constraints. Experiments were done on FFHQ and CelebA-HQ face datasets with comparisons to two recently proposed methods.",
            "main_review": "Strengths:\n1) The paper is generally well-written. The formulation of the problems is clear and it's not difficult to follow the main ideas of this paper.\n2) The paper proposes a neural contextualized traversal function that can control attributes in a more precise way.\n2) Some qualitative results in the Appendix look promising. The control of smiles, ages, and poses are mostly working well.\n\n\nWeaknesses:\n\nFirst, I think the novelty of this paper is limited due to the following reasons.\n\na) The main procedure of this method follows \"ENJOY YOUR EDITING: CONTROLLABLE GANS FOR IMAGE EDITING VIA LATENT SPACE NAVIGATION, ICLR 2021\". \"ENJOY YOUR EDITING\" is to add a feature, which is a binary classification problem. So it expresses the loss via a binary cross-entropy. While this paper is to strengthen/weaken a feature, which is a regression problem and a regression loss(L2 loss) is used. \n\nb) The authors attempted to add other constraints to limit the change of other attributes. Similar attempts were done in Interface-GAN by the \"conditional manipulation\" operation. While this paper used a threshold function to address the sparsity and also forces other attributes to remain unchanged, which is not elegant as Interface-GAN and looks like a marginal improvement to me.\n\nSecond, although the experimental results seem promising, the comparison results are not quite convincing to me. The attribute regressor seems to be extremely important in this method, as it controls the estimation of the attribute from the image. However, it seems that this paper utilized a different regressor compared to the previous methods, which makes the comparisons un-justified.\n\nOther minor concerns:\n\n1) Despite the loss for the traversal model, did you use the content loss and discrimination loss as in  \"ENJOY YOUR EDITING, ICLR 2021\"? It seems somehow implausible to ensure the quality of the image without such constraints.\n2) The improvement of quantitative results in Table 1 is not significant in some domains.\n\n",
            "summary_of_the_review": "This paper showed some promising qualitative results on face attribute controls in a StyleGAN model. However, due to the limitation of novelty and some uncertainty of justice in the experiments, I think this paper is marginally below the acceptance threshold. Also, I would like to hear opinions from other reviewers.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This paper is interested in interpreting the latent codes of generative models, and in particular GANs in terms of semantic attributes. It is an important problem and for which several approaches have been recently proposed in the literature. This paper takes the opposite position of recent approaches that assume linear relations between latent codes and semantic attributes (also in view of their interpretation). Indeed, it assumes non-linear, sparse, and contextual relations and proposes a neural latent traversal function to model such complex relations. Both quantitative and qualitative evaluation are done on CelebA-HQ and FlickR-Faces-HQ datasets. ",
            "main_review": "**Strenghs**\n\n+ The hypothesis and the main motivations of the paper are clear and well-explained. Considering that relations between latent codes and semantic attributes is nonlinear is also very interesting making the positioning with respect to the state of the art clear.\n+ The main formulation of the problem is simple but nice, using simple external regressors neural latent traversal\n+ Results, both quantitative and qualitative are promising.\n\n**Weaknessess and main concerns**\n\n+ The loss L_c makes sense but we can wonder if it could be adjusted to the different types of c_k. In particular, many approaches have been proposed for perceptual losses. This could be more discussed.\n+ I have the same concerns for the others losses in section 3.2 and the notions of relevant and irrelevant components should be better explained. How are they identified?\n+ What about the case of non-continous attribute c_k ?\n+ Some experiments on others more synthetic dataset such as the one used in disentanglement learning could enable to confirm the results on non-faces images.",
            "summary_of_the_review": "This is an interesting paper having some interesting results.  It brings novel results on the domain of GAN's latent space interpretation. A few minor revision are list below :\n\n+ More discussion and motivations on the different losses.\n+ More experiments and in particular on non-faces images.\n",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "This paper presents a method for traversing on GAN latent space in order to edit the intended attributes without manipulating the unrelated attributes. Paper argues the trajectories on latent space to manipulate the attributes are non-linear. Hence, presents a non-linear function of source attributes, source latent representations, and target attributes to return the target latent representation.   \nTo evaluate the proposed idea, experiments are performed to manipulate pose, age, and expressions on publicly available data set FFHQ and CelebA-HQ across two pre-trained GAN networks.",
            "main_review": "The paper starts by arguing that the GAN latent representations are entangled rather than disentangled which I don't find fully true. Previous works such as infoGAN or similar works disentangle the representations in an unsupervised way. Even the study present in Figure 2 of the paper shows that only 2-3 components out of 512 of the latent vectors are co-related with the change in the smile. This shows that the representations are disentangled if not fully but to some extent. \n\nAuthors also claim in the intro section that manipulating an expression or other non-identity-related attributes on the face does not affect identity. However, it is not justified by the experiments. Comparing the embeddings of the images extracted from a model trained for identity recognition before/after manipulation would give some idea about identity preservation. \nAlso, could the authors clarify why only three attributes were chosen?  There are 40 different attributes labels on CelebA. Only taking 3 attributes into the consideration for the entanglement/disentanglement of the latent representations is not convincing. \n\nThe idea of using non-linear functions to estimate the trajectories between the attributes seems sensible. The ablation studies employing different non-linear functions vs  linear function demonstrates its significance.  \n",
            "summary_of_the_review": "This paper tackles the important research problem on traversing latent representations in GAN. However, it makes some of the assumptions which are not well justified. For example, the issue with the disentanglement of the attributes. I feel the insight drawn in Figure 2 is counter-acting the hypothesis of the authors on entanglement rather than supporting it. Also, I find the experiments rather weak and less convincing.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This paper deals with the problem of applying controllable changes on semantic attributes of images generated via pre-trained GANs.  In contrast to the majority of works in this area that deal with linear models, the authors propose using a neural transformation (i.e. network-like) to link latent codes and semantic attributes.  Sparsity constraints are used based on MI to constraint the latent transformations, with good results overall.",
            "main_review": "+ The presented framework allows for non-linear 'edits' using pre-trained gans, which apparently can improve the expressivity of the edits\n+ experiments appear good, and ablation studies are conducted to verify the sensitivity of sparsity thresholding as well as the architecture of the method.\n+ the proposed sparsity constraint based on MI seems like a novel approach to model relevance to attributes, and can essentially narrow down manipulation only to contributing dimensions\n\nThis work follows the supervised path to interpreting and editing the latent space of GANs.  This means that a pre-trained regressor for a specific attribute is required, however other works exist that find non-linear semantic changes (e.g. WarpedGANSpace) without supervision.  \n\nThis is also linked to the claim by the authors that other methods need to test the possible ranges of the attribute (section 2.2) - which I also agree is not that intuitive.  However, again should be stated that such methods (e.g. sefa and ganspace) are entirely unsupervised, and this is the price one pays for not including labels/regressors/classifiers in the framework.\n\nWhile experimental results appear good, I am not certain they are conclusive.  The comparison is only with two other works, however they are quite recent and one can say sota.  However, more qualitative and quantitative comparisons could go a long way here.  \n\n\n\n",
            "summary_of_the_review": "I think this paper introduces some interesting concepts (e.g., using MI and the sparsity constraint), and introducing non-linear relationships can be a significant advantage.  However I am not sure that the experimental results are conclusive, and that there is noteworthy improvement in comparison to related work.  ",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        }
    ]
}