{
    "Decision": "",
    "Reviews": [
        {
            "summary_of_the_paper": "The paper proposes Clustering-based Optimal Transport (COT) to address the class imbalance problem and huge computation cost in existing OT-based algorithms. To be specific, the proposed method aligns clusters between source and target domain instead of individual samples to transfer knowledge. Several experiments are conducted to compare COT with state-of-the-art methods.",
            "main_review": "Strengths:\n1. Theoretical analysis on instance and clustering-based optimal transport is well described. The computation cost comparison strengthens the contribution of the paper.\n2. The paper is easy to follow and well written.\n \nWeaknesses\n1. Although the proposed method may somewhat ease the class imbalance problem, it seems that the class imbalance problem has not vanished entirely. The designed optimal transport problem uniformly assigns the source cluster to each target cluster. It assumes that the target clusters do not have the class imbalance problem and are uniformly distributed. However, as the target labels are not provided, we cannot guarantee that the numbers of target clusters belonging to each class are the same. For example, due to the intrinsic distribution of the target domain, the ‘0’ class of the target can be assigned five target clusters whereas the ‘1’ class of the target is assigned only one target cluster. In that case, the class imbalance problem still exists in the proposed method.\n2. As the paper mainly addresses the class imbalance problem of previous optimal transport-based algorithms, it is recommended to compare with these algorithms under both class imbalance setting, and class balanced setting.\n3. The proposed method is applied to existing algorithms while it has many hyperparameters to optimize (three loss weights and K). It hampers the applicability of the proposed method.\n4. The experimental improvements are not significant. The proposed method outperforms 0.1% on Office-31, 0.2% on Office-Home. The improvement over MCC reported in Table 3 is interesting, but the overall accuracy is not competitive compared to other methods (for example, [Ref 1] achieves 87.2%).\n \n[Ref 1] Kang, Guoliang, et al. \"Contrastive adaptation network for unsupervised domain adaptation.\" Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition. 2019.\n",
            "summary_of_the_review": "The intuition of the paper is interesting; addressing the class imbalance problem of existing OT-based methods, but the proposed method still seems to have a similar problem. More experimental results should be provided to demonstrate the contribution of the paper over previous OT-based algorithms. The proposed method is utilized as an additional module to existing methods, but it has a lot of hyperparameters to tune and the empirical contribution is incremental. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "This paper proposed a Clustering-based Optimal Transport (COT) algorithm, which formulates the alignment procedure as an Optimal Transport problem by capturing the fine-grained attribute alignment. They evaluate on several cross-domain benchmarks by comparing several existing DA methods. ",
            "main_review": "Generally the paper is easy to follow and straightforward. \n\nMy major concern is the novelty of this paper. This is a combination of OT and pseudo label based clustering. OT based DA has been widely explored. What will be the difference? \n\nThe performance is not good enough. They showed the results from three benchmarks, however, they are not state-of-the-art, e.g., 74% in average is for Office-Home. \n\nThe tables are not in a good shape, say Table 3-4. \n\nFor Figure 2, what is the improvement of COT over DANN?",
            "summary_of_the_review": "Based on the novelty and performance, I will reject this paper. ",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "details_of_ethics_concerns": "No",
            "recommendation": "1: strong reject",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        },
        {
            "summary_of_the_paper": "This paper studies unsupervised domain adaptation UDA problem. The authors target the existing issue of optimal transport based UDA solutions, where the required instance-pair alignment needs significant computations. Moreover, the authors argue that the existing methods cannot well handle the class-imbalanced challenge. To address these, a clustering-based OT (COT) is proposed by capturing a fine-grained attribute alignment. The authors design a new loss to align between cluster centers in source and target domains.",
            "main_review": "Pro:\n+ Clustering idea is a technically sound and interesting practice to handle the large-scale data. The cluster centroids are usually well descriptive to represent a group of data points.\n+ The paper writing is easy to follow.\n+ Computational cost analysis is discussed.\n\nCon:\n-Clustering is the key component in the proposed solution. However, this designed component lacks detailed examination. For instance, how to choose hyper-parameter $K$? My understanding is -  if $K$ is small, then building a mapping only based on few centroids might lose much information. While if $K$ is large, the computational cost increases. A careful discussion is needed here.\n\n- The authors claim with clustering techniques, it is able to capture fine-grained attribute information. It would be helpful to quantitively and/or qualitatively support this key claim.\n\n-Although a complexity analysis is provided. It is still important to report the running time of each component (e.g. feature extractor, clustering-based OT) on each dataset.\n\n-I suggest the authors include another widely used, even larger dataset DomainNet (containing ~0.6million data points) in the experiments for large-scale dataset evaluation. \n",
            "summary_of_the_review": "The authors propose a clustering based optimal transport method to address the class-imbalanced and expensive computational challenges in unsupervised domain adaption problem. The idea is interesting, while unfortunately, the current version does not fully support the claims.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        }
    ]
}