{
    "Decision": {
        "title": "ICLR committee final decision",
        "comment": "The paper proposes a simple recurrent architecture for question-answering, achieving good performance on several reasoning benchmarks. All three reviewers agree on the merit of the contribution.",
        "decision": "Accept (Poster)"
    },
    "Reviews": [
        {
            "title": "",
            "rating": "7: Good paper, accept",
            "review": "The paper proposes a simplistic recurrent architecture that has a very small temporal dependence in its definition (which, in turn, allows it to be parallelized across the temporal axis). Paper is clear to follow, the architecture has appropriate motivation and the experiments seem to be very thorough and over an appropriate range of synthetic and real datasets. Results are very impressive on its own especially considering the simplicity of the model. Activation and gate visualizations are informative. Overall, the work is sufficient as a conference contribution.\n\nI appreciate the effort by authors in responding to questions and incorporating revisions.",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "",
            "rating": "7: Good paper, accept",
            "review": "This work introduces a new RNN model and shows how it can be used for QA in bAbI-like settings.  I think the model is simple and interesting, and the results are strong.  I would like the authors to also show results training on all tasks simultaneously, but other than that, I think it is an interesting model and it is nicely described and tested. ",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "",
            "rating": "7: Good paper, accept",
            "review": "The paper proposed a simple and effective model for QA. The paper is easy to read and result is impressive on the synthetic and real dataset. The one question is the paper is called query-reduction, but there is no place to show this reduction explicitly.",
            "confidence": "3: The reviewer is fairly confident that the evaluation is correct"
        }
    ]
}