{
    "Decision": "",
    "Reviews": [
        {
            "title": "Good experimental design and clarity of writing, but limited novelty, experimentation, and analysis",
            "review": "Summary of the paper: This work builds on the adversarial autoencoder (AAE) proposed by Makhzani et al 2015 and the adversarially regularized auto encoder (ARAE) proposed by Kim et al. 2017. It does this by integrating Vaswani et al. 2017’s transformer model and self-attention (Parikh et al. 2016 and many others) and the AAE and ARAE methodologies. The authors call this SALSA (Self Attentive Latent Space Based Adversarial Text Generation). Basically SALSA combines these parts that are successful on their own and shows on the Google Sentence Compression dataset that ARAE and AAE can be beaten with the inclusion/injection of Transformer + self-attention. Their models show longer and higher-quality sentence generation with more diversity. For some of the BLEU/Human Eval metrics though, ARAE seems to perform better. SALSA seems to aid in alleviating mode collapse (something ARAE struggles dramatically to do).\n\nPreliminary Comments:\n  * Paper is easy-to-read and organized.\n  * Experimental design is well-described especially in how the dataset was preprocessed; something many papers in this area fail to do.\n  * Evaluation metrics are discussed in detail, which is a plus.\n\nDrawbacks:\n  * Novelty is limited: SALSA is an aggregation of already proposed methodologies. \n  * The experimentation could’ve been more robust. \n        - It seems as though there’s only one model that is evaluated here. Trying different models (varying HPs or just random seeds) or providing justification of how this specific model was chosen would be helpful. If I missed this, please correct me.\n        - Varying the dimensionality of the noise vector, how often it is copied would be helpful.\n        - Discussion on why copying the noise vector T times rather than generating a smaller dimensional noise vector (or the same dimensional noise vector) at each step would strengthen the paper.\n  * Statistics of the human evaluation, standard errors/variances of how the humans evaluated the sentences would strengthen the results more.\n  * The discussion of experimental results leaves a little to be desired. I’d like to know what a 0.1 improvement in grammaticality, semantic consistency, fluency etc means. Standard errors like I mentioned before and/or examples of this would go a long way to helping that.\n  * The authors discuss how SALSA aids in ‘better performance’ on long/complex sentences. A definition of what is long and complex in conjunction with evaluation across BLEU/Self-BLEU/PPL/R-PPL/3 Human metrics would strengthen the paper dramatically.\n  * Looking at SALSA-ARAE vs ARAE in Table 2, ARAE has much higher BLEU scores. Some discussion at why this is the case would also improve the paper.\n\nMinor Issues:\n  * There are many typos in the text, so another proof-read would be good.\n  * Figures and tables are not space-efficient and do not need to be so large; placed in the manners they are. This empty space could be used to add more discussion/further experimentation. Figure 1 can be rotated to give you 6-8 lines more. Figures 2 and 3 can be put side by side without reducing the font too much.\n  * The bolding of certain numbers in the tables are confusing on first glance because you’re obviously comparing SALSA-AAE to AAE and SALSA-ARAE to ARAE, but the tables have both without a divider, so on first glance I was confused (wasn’t the best performance in the row). So including a double lined divider on each table would be helpful.\n  * A few papers have been listed multiple times in the references (AAE and ARAE papers).\n  * Related work section: an inclusion of a few of the more recent GAN papers for text is missing. I think some discussion of other VAE approaches to text such as Bowman et al. 2016: Generating Sentences from a Continuous Space among others would be good. I think citing Kingma and Welling 2014 Auto-Encoding Variational Bayes and Rezende et al. 2014 Stochastic Backpropagation and Approximate Inference in Deep Generative models is important in the first mention of VAEs.\n\nConcluding Thoughts:\n  * This paper has limited model novelty and doesn’t overcome this by having great experiments or analysis.\n  * This paper has the building blocks for great experimentation and analysis, and if those are completed well, has the ability to make strong claims regarding the impact of SALSA on a variety of metrics.",
            "rating": "4: Ok but not good enough - rejection",
            "confidence": "3: The reviewer is fairly confident that the evaluation is correct"
        },
        {
            "title": "Strong experimental results but the technical novelty is limited",
            "review": "Building on prior work  exploring Adversarial Autoencoder (AAE) and Adversarial Regularized Autoencoder \n(ARAE) for text generation (Cifka et al., 2018), this paper proposes to employ widely adopted Self Attention \nand Transformer to enhance the modeling capabilities of the generator and discriminator in AAE and ARAE \nfor text generation. Experiments on the Google Sentence Compression dataset show that, AAE and ARAE \nenhanced with self attention and Transformer generate long and high-quality sentences with much higher \ndiversity than the corresponding models without attention, although ARAE without attention achieves higher \nBLEU and human evaluation scores.\n\nThis paper is well written and organized, the experiments are well executed, and the results are convincing,\nwhich demonstrates the effectiveness of Self Attention and Transformer that have been widely adopted in \nnatural language processing recently.\n\nMajor:\n\n1. The technical novelty of this paper is very limited. It is a trivial combination of Self Attention, Transformer, \nand previous models for text generation. The experimental results are not surprising. \n\n2. The experimental results in Table 2-5 just list the performance of AAE and ARAE with/without attention. \nIn-depth analyses about the performance of different model variants will make the paper much more \ninteresting.\n\n3. The current model generates sentences by fixing the length to 50 first. It is important to explore other more\nnatural modeling variants  for generating sentences of variable lengths.\n\n4. In Fig. 1, it is surprising that one 100-d noise vector passed to a fully connected layer is copied T times. \nIs it better to use a different noise vector in each step?\n\n5. On page 8, the last sentence above Section 5 is inappropriate. Table 2 and 5 clearly show that ARAE has \nthe best performance on BLEU and human evaluation scores, although it lacks generation diversity.\n\nIn conclusion, this paper has well-executed experiments. But the novelty is very limited, the model design might \nneed more exploration, and detailed analyses of the results are required.",
            "rating": "4: Ok but not good enough - rejection",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "Interesting idea but not novel enough and lack of insights",
            "review": "Contributions:\n\nThe main contribution of this paper is the incorporation of the Transformer architecture for adversarial latent-code-based text generation. Specifically, Transformer is used for the encoder and decoder design of AAE and ARAE. This is different from previous GAN models designed for text generation, where LSTM is used for generator, and LSTM or CNN is used for discriminator.\n\nWeaknesses:\n\n(1) Novelty: I think the novelty of this paper is somehow limited. Basically, instead of using LSTM and CNN, the main novelty is the usage of Transformer for encoder and decoder design. From the modeling perspective, there is no novelty, using the same AAE and ARAE models proposed by previous work. \n\nIt the paper is well-written and well-executed, this paper still has the chance to be a good paper, however, I think this paper is quite thin. The contents seems not enough to support a paper.\n\n(2) Presentation: \n\nFirst, in the related work section 2.4, I think the authors should discuss related works not just AAE & ARAE. SeqGAN, RankGAN, TextGAN, LeakGAN and MaskGAN is another research line that needs to be discussed.\n\nSecond, there is no need to make Figure 1 & 2 & 3 this large. It really just wastes a lot of spaces. Table 1 also wastes a lot of spaces. If getting rid of these, the contents in this paper is really thin. \n\nThird, there are several typos in the paper. Please proofread the paper carefully.\n\n(3) Evaluation: Please see my detailed comments listed in the Questions below. \n\nQuestions:\n\n(1) This paper is interested in adversarial latent-code-based text generation. I have a general question about this paper. In the introduction section, the authors mentioned the problem of exposure bias, and then say GAN is a promising approach to alleviate this problem. This is true. However, doing adversarial learning on the latent code seems not help alleviate this exposure bias problem, since still no sequence-level guidance is provided. The model is still generating next word based on previous ground-truth words, with the difference being that an adversarially learned latent code is also injected. Can the authors justify why this model is useful and how it can alleviate exposure bias?\n\n(2) I think the Transformer used in this work can be also adopted for SeqGAN etc. Do the authors think SeqGAN, MaskGAN etc will also benefit from using Transformer?  \n\n(3) In section 4.3, the authors show qualitatively SALSA generates longer and more diverse text. Can the authors provide some intuition why this is the case?\n\n(4) I think the sample size used in the human evaluation is too small. Only 18 sentences are used. A larger-scale human evaluation is needed. How reliable and what are the variances of the scores in Table 5? \n\nMinor issues:\n\n(1) AAE and ARAE has been cited twice in the references. Please correct it. \n\n(2) Not all the boldings in Table 2-5 are correct. Usually, bolding is used for the best performing model. Please correct them. ",
            "rating": "5: Marginally below acceptance threshold",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        }
    ]
}