{
    "Decision": "",
    "Reviews": [
        {
            "title": "Good but novelty concerns",
            "review": "This review will be short considering the current state of the paper and the reviews. I would just like to note to the authors that a somewhat similar piece of work was done in \"Learning Locomotion Skills Using DeepRL: Does the Choice of Action Space Matter?\". The authors optimized muscle insertion locations as part of their results. There is also an abstract on the topic that learns how to add links and morphology in \"Real-time motion generation for imaginary creatures using hierarchical reinforcement learning\".\n\nBest of luck, look forward to seeing more work.\n\n",
            "rating": "4: Ok but not good enough - rejection",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "More experiments are needed to show the effectiveness and novelty",
            "review": "This paper discuss the joint evolution of controllers and topologies of agents.\nThe PEOM algorithm in the paper incorporates Shapley value to accelerate the evolution by identifying contribution of each body part.\n\nSide note: I am an added emergency reviewer due to the missing of reviewer 2.\nSorry for the caused trouble. I am already many days late, so I try to make this review available as soon as possible.\nAlthough I would not say that I understand the paper perfectly,\nthis review should cover the contents enough for the authors’ rebuttal. And I will probably update the reviews in the following days.\n\n*******    Pros    *******:\n---- I really enjoy the idea of identifying the contribution of each body parts. I believe it should be a good direction to go for research on automatic robot design or creature evolution.\n---- The topic of joint policy & morphology learning is interesting and deserves more attention.\n \n*******    Cons    *******\n---- The contribution and novelty of the paper is relatively limited other than the use of Shapley value.\n---- The experiment session really undermines the value of this paper. (see details below).\n---- It is not clear what information is delivered in the paper, in terms of what components of PEOM are beneficial and what are not. \n---- This paper could benefit from better writing. (see details below)\n\n*******    Detailed comments and suggestions    ******* \n---- Why does the author start with a multi-agent competing environment like sumo?\nAs the author also pointed out in the paper, \"Further, changes in the agent’s own body also contribute to the non-stationary nature of the environment\",\nit seems to me that the algorithm should be first tested in a single agent environment.\nThe introduction of multi-agent and Elo rating, seems to me, complicates the problem.\n---- It will be great if the author could well introduce and formulate the objective function at the beginning method section.\n---- (This is not a criticism) For the training algorithm of the controllers, why do the authors choose SVG?\nThere are other more stable and well-used algorithms (both model-free and model-based) available, for example TRPO / PPO / PETS algorithm.\n---- For agent i to inherit policy network from agent j by cross-over, how does it work exactly?\nIn the paper it is simply said that “and body configuration parameters are set to the target j’s configuration.” \nIf the agent i and agent j has different topologies, then parameters for network i and network j should not be transferable.\n---- Shapley value seems to a core idea of PEOM. For the better presentation of this paper, it will be great if a background section (with math) on Shaley value is included.\n---- Ablation study on Shapley value is needed.\nIt seems to me that the introduction of Shapley value also introduce the problem of falling into local-minima (more easily).\nMy personal understanding of the difficulty of creature evolution is that, it is easily stuck in local-minimas.\nFor example, (for a two-legged under-evolved ant) evolving only one leg might be bad, as it adds more difficulty to controlling and introduce unbalancing.\nBut adding two symmetrical leg will boost the performance.\nHowever, Shapley value might discourage evolving a leg.\nHow does POEM overcome this?\n---- More experiments are needed.\nCurrently only one environment type is tested (the ant). More experiments will greatly increasing the quality of the paper.\n---- It seems that POEM does not evolve creatures of different topologies by looking at the youtube video.\n\n\n---- General comment ---- \n\nIn general, I believe more experiments and better presentation is needed for this paper.\n\n",
            "rating": "4: Ok but not good enough - rejection",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "Compelling idea, limited novelty, insufficient experiments",
            "review": "The paper is generally clear and well structured, with the exception of the proposed approach which is not clearly explained.\nAlthough not very novel, the topic considered is fairly interesting as it might tap into important questions about natural evolution. \n\nPro:\n- The use of multi-agents cooperative game theory is interesting and well fit with the evolution of bodies. \nCons:\n- This cooperative game theory formulation is not really explored in details and has little practical consequences to the experimental setting.\n- The contribution of the paper is very limited. The idea of jointly optimizing bodies and controllers has been extensively explored in the existing literature. Compared to this literature, I do not see any significant novelty being introduced.\n- The actual algorithm used is unclear to me. Where is SVG being used in algorithm 1?\n- The experimental results are weak (more details below).\n- The paper is often not sufficiently rigorous in its statements (see details below).\n\nIn its current form, the paper does not seem to be a significant contribution to the literature.\n\n\nMinor points:\n- \"the the\" in the abstract\n- In the paragraph at the end of the first page and the beginning of the second page, there is a number of statements about the role of the body and intelligence. In a scientific article, this type of unsupported and hand-wavy statements is unacceptable and must either be supported by previous works or clearly indicated as a hypothesis.\n- What is a \"physically simulated environment\"? I guess that you refer to a software simulator, but this wording is non-sense. A physically simulated environment to me suggests that somebody physically simulates the environment with action-figures or something similar. \n- In the related work, you indicate a number of previous work from the evolutionary community without comparing them to your work. Instead, you briefly conclude that \"in contrast, we use an RL algorithm\". Since both evolutionary strategies and RL are nothing more than optimizers (and in particular, since your approach is also based on populations and evolution), you need to explain this connection significantly more in details.\n- One aspect that I find worthy of further explanations in the paper it is the use of self-play and a population of agents. This could be at the same time beneficial and a limitation. Thinking about and discussing both would be valuable.\n- please use a spell checker: \"algoithm\"\n- The experimental results in Sec 3.1 this moment only show that adding parameters of the body increase performances -- which is a fairly well-studied phenomenon in the literature. No comparisons to previous literature are performed (e.g., evolutionary strategies). Moreover, it naturally raises the question of how would an equal-weight fix-configuration robot perform.\n- Fig.5A should be in the number of iterations of similar metric. Using time can be misleading and unclear (is it the computational time or equivalent real-time?). Whatever metric you decide to use, you should accurately describe how it is computed.\n- It would be nice to have an intuitive explanation of what elo scores correspond to behaviorally.\n- statements such as the \"in 64% of the runs\" would benefit from including a plot of the whole distribution.\n",
            "rating": "3: Clear rejection",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "Interesting study, results not convincing, analysis provides a biased picture",
            "review": "The paper proposes a way to optimize morphology and controller of a simulated robot.\n\nStrong aspects:\n- Combination of Evolutionary search over morphology and hyper parameters with RL for controller\n- Introducing analysis tools from game theory to the community\n- entertaining video\n- good presentation/clear writing\n\n\nWeak aspects:\n- authors do not mention that they will make the code public\n- presentation is based on the best of 50 runs! They are not directly hiding this fact, but when looking through the results they appear much better than they are.\n  Only in 70% of the cases their algorithm is finding a better morphology! Not sure we can call this a success, given that it takes an enormous training effort.   \n- Only one particular environment is considered\n- The result that controllers from body-improving population is better (in 64% of cases) than with fixed body is suspicious and would have needed a stronger analysis.\n a) in principle the controller optimized for the fixed body should not be out beaten by a controller that was optimized for a different morphology\n b) when considering the process of changing morphology as a source of noise then the controllers in the body-improving sub-population might be able to find a different strategy which is also better on the original body, but was not found. Still, a bit strange.\n- The Shapley analysis is not really convincing: It really depends on how the controller is adapted to these changes. For instance if the changes were early during evolution than they are very important because the controller would \"forget\" how to behave without them. So a temporal aspect would have been important as a baseline. Also, running the same analysis with many agents, not just the one best agent from 50 runs. This is not a generic or particularly useful result. \n- in evolutionary robotics work studying the interplay of learning and evolution, the body would vastly change, in order to obtain surprising and creative solutions. Here is it merely a fine-tuning operation.\n\n- When referring to the Baldwin and Lamarkian evolution, it would be useful to state what this paper studies, i.e. the unbiological Lamarkian version.\n\nWhat did we really learn from the paper? It not really surprising that an adapted morphology can be better than an unadapted one. I understand that it is not necessarily easy to obtain this result, but that the algorithm is only managing this in 70% of the cases is actually not a good sign. Since the analysis is based on a particular run, how does the worst run look like? Which conclusions would have been made with the given analysis tools? ",
            "rating": "4: Ok but not good enough - rejection",
            "confidence": "3: The reviewer is fairly confident that the evaluation is correct"
        }
    ]
}