{
    "Decision": {
        "metareview": "As the reviewers point out, the paper seems to be below the ICLR publication bar due to low novelty and limited significance. ",
        "confidence": "5: The area chair is absolutely certain",
        "recommendation": "Reject",
        "title": "decision"
    },
    "Reviews": [
        {
            "title": "Weak novelty and significance",
            "review": "Summary\nThis paper introduced a parameterized image processing technique to improve a robustness of visual recognition systems against noisy input data. The proposed method is composed of two components; a denoising network that suppresses the noise signals in an image, and gating network that predicts whether to use the original input image or the one produced by the denoising network. The proposed idea is evaluated on three tasks of object detection, tracking and action recognition. \n\nOriginality and significance:\nThe originality of the paper is very limited since the paper simply combines the existing image denoising technique with the idea of gating. The practical significance of the work is also limited since the model is trained and evaluated with only synthetically generated noise patterns; it is not surprising that the proposed method (both denoising and gating networks) works under this setting, as the noise is created synthetically under the same setting in both training and testing. To demonstrate the practical usefulness, it would be great if the model is evaluated with the actual source of noises (e.g. noises from input sensors, distortion by image compression, etc).  \n\nClarity:\nI think the title of the paper is misleading; the proposed model is actually not a mixture of preprocessing units, as it combines *a* denoising unit together with identity mapping. The gating network is also not designed to incorporate a mixture of more than two preprocessing units, as it outputs only “on/off switches” instead of weights for K mixture components (K>2).\n\nMinor comments:\n1) the paper argued the importance of lightweight preprocessing but have not provided analysis on computation costs. From the current results, I don’t see the clear benefit of the proposed method (denoising network) over the average filtering considering the tradeoff between computation vs. performance. \n2) In Figure 5, I suggest highlighting the differences among the examples for clarity.\n",
            "rating": "3: Clear rejection",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "Synthetic naive approach to handling distorted images by deep neural networks",
            "review": "The paper presents a synthetic naive approach to analyzing distorted, especially noisy, images through deep neural networks. It uses an existing gating network to discriminate between clean and noisy images, averaging and denoising the latter, so as to somewhat improve the results obtained if no such separation was used. It deals with a well known problem using the deep neural network formulation. Results should be compared to other image analysis methodologies, avoiding smoothing when not required, that can be used for the same purpose.  This should also be reflected in related work in section 2; the reason of including Table 1 in it seems unclear. \n",
            "rating": "4: Ok but not good enough - rejection",
            "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"
        },
        {
            "title": "A  reasonable approach for noise robust training but there is a lack of novelty",
            "review": "The paper addresses the problem of training an object detection network that can achieve good performance on both clean and noisy images.   \nThe proposed approach is based on a gating network that decides whether\nthe image is clean or  noisy. in case of  noisy image a denoising  method is applied.  The network components form a mixture of experts architecture and are  jointly trained after a component-level pretraining.\nHow good is the gate performance? what happen if you use only one of the trained experts for all the clean/noisy  test data? It is not clear how you combined the results of the two experts. Are you computing a weighted average of the original and the enhanced images? Did you try to use a hard decision gating at test time? \n  ",
            "rating": "4: Ok but not good enough - rejection",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        }
    ]
}