{
    "Decision": {
        "metareview": "This submission proposes an interesting new approach on how to evaluate what features are the most useful during training. The paper is interesting and the proposed approach has the potential to be deployed in many applications, however the work as currently presented is demonstrated in a very narrow domain (stability prediction), as noted by all reviewers. Authors are encouraged to provide stronger experimental validation over more domains to show that their approach can truly improve over existing multitask frameworks.",
        "confidence": "4: The area chair is confident but not absolutely certain",
        "recommendation": "Reject",
        "title": "Interesting idea for which the presented evaluation is too narrow"
    },
    "Reviews": [
        {
            "title": "A well-written paper with limited implication.",
            "review": "The paper focuses on the stability prediction task on the ShapeStacks dataset. Specifically, the paper creates a new extension to the dataset, and it proposes the use of \"Neural Stethoscopes\" framework to analyze deep neural nets' physical reasoning of local stability v.s. global stability. It is shown in the paper neural nets tend to be misled by local stability when the task is to predict global stability. Then the paper utilizes the proposed framework to de-bias the misleading correlation to achieve a state-of-the-art on the dataset.\n\nThe paper is very well-written and easy to follow. The main idea is simple and the experiments are detailed. Specifically on the task of stability prediction, it is quite interesting to know that neural nets can be misled by visual cues (local stability).\n\nHowever, my concern is that the paper focuses only on a very specific application domain,  and an improvement over the niche dataset with much more supervision (from the extension) is not surprising at all. In the mean time, the notion of \"Neural Stethoscopes\" could be much more  generally applied. Without applications in other domains, it is not immediately clear what the paper's implication is.",
            "rating": "6: Marginally above acceptance threshold",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "Preliminary report, the idea could be shaped into a better one",
            "review": "This paper combines the global and local stability prediction and tries to get interpretable results using the stethoscope design, which is actually a weighted subbranch for the main branch. There are several concerns regarding the proposed framework. \n\n1) How to choose \\lambda? A better design could be a learnable \\lambda. Instead of just one scalar value, it could be better to learn a map of \\lambdas, which indicates the distribution of local stability and how it is related to global stability. The visualization of the \\lambda map might be more interpretable for understanding the stability prediction. \n\n2) The global stability prediction does not have a consistent correlation with the local stability prediction, as shown by the easy and hard examples. This complex relationship will confuse the network during the training. That is, the current design hasn't well considered the local and global stability relation, but just simply sum them up. This is hard to provide a meaningful interpretation of the task. \n",
            "rating": "4: Ok but not good enough - rejection",
            "confidence": "3: The reviewer is fairly confident that the evaluation is correct"
        },
        {
            "title": "nice solid paper",
            "review": "This paper is about using \"neural stethoscopes\", small complementary neural networks that are added to a main network which with their auxilary loss functions can measure suitability of features or guide the learning process. The idea is incremental to multi-task learning and enable, in a single framework, to validate intermediate features for additional related tasks. Moreover it can promote or suppress the correlation of such features to the tasks related to the main one. The framework is applied to the task of visual stability prediction of block towers. The paper builds upon Groth et al. 2018, adding the concept of local stability as correlated secondary task, used with the proposed neural stethoscopes. Experiments with an extension of ShapeStacks (Groth et al. 2018) dataset where the local stability is added to the global stability class, show that it is possibile increase the performance using the additional task. Moreover, it is shown that neural stethoscopes can suppress nuisance information when using a biased training dataset where the local and global stability are purposely inversely correlated.\n\nStrengths:\n+ A very nice paper, well written and easy to read. Figures are helpful and the structure is clear.\n+ The concept of neural stethoscope is interesting and simplify the concepts behind multitask learning.\n+ Experiments are convincing, interesting and there is some novelty in vision stability prediction.\n\nWeaknesses:\n- The novelty is limited related to multitask learning, thus it is an incremental paper.\n",
            "rating": "7: Good paper, accept",
            "confidence": "3: The reviewer is fairly confident that the evaluation is correct"
        }
    ]
}