{
    "Decision": "",
    "Reviews": [
        {
            "title": "Paper withdrawn before review was ready",
            "review": "As the paper was withdrawn, I am not proceeding with the review.",
            "rating": "4: Ok but not good enough - rejection",
            "confidence": "3: The reviewer is fairly confident that the evaluation is correct"
        },
        {
            "title": "random sphere sampling for data augmentation for training robust model against adversarial attacks - limited contribution and insufficient analysis",
            "review": "This paper proposed a data augmentation training method to gain model robustness against adversarial perturbations, by augmenting uniformly random samples from a fixed-radius sphere centered at training data. Comparing to adversarial training methods that trained on specific attacks, the authors claim better universal robustness across different kinds of attacks, especially to Gaussian perturbations. \n\nHowever, this paper has severe flaws in terms of analysis and limited contributions. The details are summarized as follows.\n\n1. Uniform/Gaussian data augmentation is known to have limited benefit to adversarial robustness - Uniform/Gaussian perturbed data augmentation has been a standard way to improve model robustness to input perturbations (not necessarily adversarial) in the computer vision literature. Recently, papers have shown that Gaussian data augmentation alone provided limited improvement for model robustness. For example, see the analysis of https://arxiv.org/abs/1707.06728 , https://arxiv.org/abs/1711.08478 and reference therein. The experimental results presented in this paper basically agrees with this trend - the proposed method is more effective against Gaussian perturbations (which is, strictly speaking, NOT a strong adversarial attack), while showing weak defense performance against PGD attack. Therefore, the contribution of this work is quite limited.\n\n2. Why using the distortion of a particular attack to measure robustness? Throughout the entire paper, the authors use the L2 distortion from untargeted CW attack as a robustness metric. However, the motivation of this paper is towards an attack-agnostic data augmentation for robust model training. Therefore, the use of a distortion metric from a particular attack could be very biased, and it does not fully support the motivation of this work. The authors are suggested to use some attack-independent robustness metrics for making robustness claims, or using some certified robustness verification tools (such as https://arxiv.org/pdf/1711.00851.pdf) for justification. \n\n3. Insufficient analysis - The analysis and experiments in this paper are not sufficient to provide convincing results. For example, in Table 1, why the authors only show the distortion of CW attack but not their defense rates as the row of PGD. In Table 2, why did the authors only show the results of FGSM (a known weak attack)? What about PGD and CW attacks? Lastly, it will be more convincing if the authors directly show two plots to compare different robust models: (1) attack performance (success rate) vs attack strength;  (2) distortion of successful attack vs attack strength, where attacks should at least include PGD and CW. These plots will evidently justify the robustness claims. The authors are also encouraged to follow the comments of testing model robustness in the Discussion Section of https://arxiv.org/abs/1802.00420 for robustness validation.",
            "rating": "3: Clear rejection",
            "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"
        }
    ]
}