{
    "Decision": {
        "metareview": "This paper presents an heuristic method to detect periodicity in a time-series such that it can handle noise and multiple periods. \n\nAll reviewers agreed that this paper falls off the scope of ICLR since it does not discuss any learning-related question. Moreover, the authors did not provide any response nor updated manuscript addressing the reviewers remarks. The AC thus recommends rejection. ",
        "confidence": "5: The area chair is absolutely certain",
        "recommendation": "Reject",
        "title": "not fit for ICLR"
    },
    "Reviews": [
        {
            "title": "A heuristic method for time series periodicity detection; topic not matching scope of ICLR",
            "review": "The authors present a heuristic method to detect periodicity in time series. It extends a previous approach in dealing with noise and the setting of multiple periodicities.\n\nThe topic does not match the scope of ICLR and would be better suited for a different venue.\n\nThe method is demonstrated in a purely experimental fashion. However, without detailed inspection of the datasets it remains unclear in what cases the heuristics apply and where they fail. A more thorough analysis of the robustness of the algorithm is necessary, in particular a detailed presentation of failure cases.",
            "rating": "3: Clear rejection",
            "confidence": "3: The reviewer is fairly confident that the evaluation is correct"
        },
        {
            "title": "This paper would not be best fit to ICLR.",
            "review": "This paper focuses on the extraction of the (multi) periodicities from a signal. The paper describes the conventional method based on the Fourier transformation and/or autocorrelation methods, and proposed method, which first detects a distribution of spectral leakages, and prune the periodicity hints by using a clustering algorithm. The proposed method is also extended to deal with multi-periodicities. The effectiveness of the proposed method is shown with the controlled simulation data and several real data. This paper is well written (note it is over 8 pages though), but it is not learning-based approach, and would not best fit to major ICLR interests.\n\nComments:\n- The abstract needs to be more self-consistent without referring the citation for a brief explanation. Also it should have more detailed experimental discussions.\n- Algorithm 1 needs some refinement (too code-like, although it is understandable). For example, several methods (nextBinValue and append) would be better to be replaced with other (human readable) expressions.",
            "rating": "5: Marginally below acceptance threshold",
            "confidence": "2: The reviewer is willing to defend the evaluation, but it is quite likely that the reviewer did not understand central parts of the paper"
        },
        {
            "title": "An ad-hoc method for period detection. Possibly unfit for this conference",
            "review": "This paper introduces a method to do period detection. It builds off of the autoperiod method by adding density clustering, a lowpass filter, and a linear detrending after auto correlation.\n\nThe results section was very vague. The process of  generating the synthetic signals was not specific. There were no visualizations, which would help the reader understand how this method performs better. Visualizations would have been especially useful for the real datasets.\n\nHaving said this, I don't think this paper is fit for this conference.",
            "rating": "3: Clear rejection",
            "confidence": "2: The reviewer is willing to defend the evaluation, but it is quite likely that the reviewer did not understand central parts of the paper"
        }
    ]
}