{
    "Decision": {
        "metareview": "The reviewers are unanimous in their assessment that the paper lacks originality in its current form to be publishable at ICLR-2018.",
        "confidence": "5: The area chair is absolutely certain",
        "recommendation": "Reject",
        "title": "Unconvincing originality"
    },
    "Reviews": [
        {
            "title": "well written - standard / light content  ",
            "review": "The paper discusses how to embed nodes of a graph to a vector space using singular value decomposition of the normalized adjacency matrix. The material in this paper are standard literature in graph theory and spectral analysis. The paper contains a well-written literature review. The contributions and not new enough for a publication.",
            "rating": "5: Marginally below acceptance threshold",
            "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"
        },
        {
            "title": "Incremental and trivial observations",
            "review": "The paper studies embeddings of directed graphs based on SVD. It proposes an interpretation of the embedding obtained from the normalized adjacency matrix in terms of the forward-backward random walk on the graph. In such random walk odd steps are taken using the edges of the graph while even steps are taken using reverse edges. Such an interpretation seems to be a trivial extension of the work for undirected graphs. \n\nFor example, consider bipartite graphs, in such graphs the forward-backward random walk can be seen as a standard random walk on the graph with directions removed. Indeed, if the walk starts in part A then remove all edges from B to A and make A to B edges undirected.\n\n",
            "rating": "3: Clear rejection",
            "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"
        },
        {
            "title": "An interesting and valuable idea, but flawed in terms of execution and distinction/difference to previous works",
            "review": "# Summary of the paper\n\nThis paper proposes an embedding of directed graphs based on the SVD of a normalized adjacency matrix. This embedding is shown to be equivalent to the spectral embedding of a co-citation graph, which is more complex to calculate. Interestingly, the proposed approach does not require the *explicit* representation of this graph. Moreover, the paper also shows that distances of the embedded vectors are proportional to mean commute times of a forward--backward random walk in the original graph. A suite of experiments is run on graphs from KONECT.\n\n# Review\n\nThis is a well-written paper, which I enjoyed reading. The extension of embeddings to the case of directed graphs is significant and warrants a detailed exploration.\n\nThe principal issues I see with this paper are as follows:\n\n- The originality or scope of the contribution is not clear\n- The experimental section is uncompelling\n- Several relevant works appear to have been ignored\n\nOverall, I like the way the paper treats the subject. In particular, I appreciate the fact that proofs are explained well; additionally, code is provided, which will increase reproducibility. This is uncommon and praiseworthy!\n\nAs for the originality of the paper, I find it hard to judge the scope of the contribution. The paper is extremely well written and employs a very pedagogical treatment of the subject, which I appreciate. Yet, it is hard for me to judge the utility and novelty of the proposed method in light of Section 8, where the paper shows that a spectral embedding of the undirected variant of the graph leads to essentially the *same* eigenvectors (up to renormalization and permutations). To prove that a new method is more effective, this point should be emphasized more:\n\n1. In a sense, I would see the results from Section 8 as the equal to what 'Laplacian Eigenmaps' (LE) yields. This needs to be stressed, and analysed in an experimental section.\n\n2. I understand that the order of the singular vectors is different, so embeddings that use only parts of them will be different. However, a convincing experiment should assess the differences. For example, in which regime for $d$ (number of used vectors) will the new method be surpassed by the old one? Is there such a regime? Ideally, this will be answered in the form of an asymptotic theorem; it could also be a larger experiment, though (to simulate the conditions in practice).\n\n3. I understand that the new approach has a lower run-time, because the SVD is more efficient than eigendecomposition. However, what about a simple baseline algorithm that uses SVD for the *undirected* graph of the input data? This should be simple to accomplish, and would be a way to ascertain the benefit of using edge directions.\n\n  To my understanding, LE should be this embedding, but from the table, I can see that its runtime is a lot worse than the novel method. What causes this? The fact that eigendecomposition is used instead of SVD?  If so, an additional SVD-based approach should be implemented.\n\nThis brings me to the experimental section. Here, the paper demonstrates the superiority of the new embedding based on evaluating modularity of a set of different clusterings of larger graphs, obtained using $k$-means. I have several concerns about this:\n\n1. Modularity has problems with larger networks because only a small part of the network will be used in its configuration.\n\n2. Since the embeddings cannot be easily compared due to missing ground truth information, other metrics should be employed. Here are a few, which are often used  by the community. See 'Is there a best quality metric for graph clusters?' by Almeida et al. for more details and a description of their shortcomings:\n    - Silhouette coefficient\n    - Coverage\n    - Conductance\n\n  Different ones should be evaluated here in order to show the behaviour of the new embedding. Do the embeddings differ if the modularities are similar?\n\n3. How do the results change for different values of $d$? I find it hard to disentangle such a discussion from instabilities in $k$-means, but to my understanding of the method, tuning $d$ means that more or less information is used from the singular vectors.\n\n   This could also be quantified in a proof (about asymptotic behaviour) but an experiment would be equally fine.\n\nConcerning the bibliography, or the treatment of prior works, there are some issues:\n\n- There appear to be some missing references of earlier works that used SVD or variants in order to cluster graphs or embed them:\n\n  - Drineas et al.: 'Clustering Large Graphs via the Singular Value Decomposition'\n  - Malliaros and Vazirgiannis: 'Clustering and Community Detection in Directed Networks: A Survey'\n\n- Likewise, the use of pseudo-inverse Laplacians has a lot more papers attached to it (these are only a few that are relevant):\n\n  - Ho and Dooren: 'On the pseudo-inverse of the Laplacian of a bipartite graph'\n  - Gutman and Xia: 'Generalized inverse of the Laplacian matrix and some applications'\n\n# Suggestions for improvement\n\n- In some sense, this work can be seen as an extension of Laplacian eigenmaps to the directed case. The paper needs to be more clear about these extensions with respect to prior work. In Section 2, it is claimed that 'our main contribution is a proper normalization'. This strikes me as a rather small contribution in light of the experimental section, as outlined above.\n\n- I am also hesitant to speak about a better interpretability of the mean commute time. I agree that it is nice to know that the distance permits such an interpretation in terms of random walks, but what is the impact of knowing the MCT? It is not only used in the embedding insofar as one obtains a vector representation.\n\n- Section 5 is then the standard way of defining random walks based on a Laplacian matrix, and the correspondence to the pseudo-inverse of the Laplacian is shown. This is mathematically interesting, but appears to me to be in line with previous research.\n\n- The section about co-citation graphs should make it more clear that 'successors' are to be taken in terms of the original graph and the directionality of edges. Since this is a standard definition in the domain of network analysis I would suggest citing a textbook here.\n\n- In Section 6, the paper could give more details about random walk concepts such as 'stochastic', 'stationary distribution' etc., as it would make the paper more accessible (I am familiar with these concepts but since the writing of the paper is of high quality in the other sections, I am convinced this would improve its impact, and attract more readers).\n\nTypos & grammar issues:\n\n- 'in terms of random walk' --> 'in terms of random walks'\n- 'equivalent to build' --> 'equivalent to building'\n- 'with corresponding unitary matrix' --> 'with a corresponding unitary\n  matrix'\n- 'square Euclidean distance' --> 'squared Euclidean distance'\n- 'equivalent to consider' --> 'equivalent to considering'\n- 'irreductible' --> 'irreducible'\n- 'and provide generally' --> 'and provides generally'\n- 'in low dimension' --> 'in a lower dimension'\n\nFurthermore, the bibliography should employ consistent capitalization and journal names for articles.",
            "rating": "4: Ok but not good enough - rejection",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        }
    ]
}