Table 1: AUCs (%) of benchmark comparison. “Bad-GAN” and “original BadGAN” refer toFenceGAN (Ngo et al., 2019) and the approach of Dai et al. (2017), respectively. Items with * areour settings and “Taichi-GAN” is our ultimate model. The highest AUCs are bold.
Table 2: AUCs (%) of different anomaly class (MNIST). For example, {0-4} represents 0-4 areoutliers and the rest are inliers. 1 sample per outlier classes is available for bottom three settings.
Table 3: AUCs (%) of different anomaly availability where all 0-2 are inliers (MNIST). For example,[3-9]*5 represents 5 anomalies per 3-9 classes available.
Table 4: NetWOrk StrUCtUreS of generator for MNIST, FaShiOn-MNIST		Layer (type)	Output Shape	Param #Linear-1	[-1, 256]	51,456ReLU-2	[-1, 256]	0BatchNorm1d-3	[-1, 256]	512Linear-4	[-1, 512]	131,584ReLU-5	[-1, 512]	0BatchNorm1d-6	[-1, 512]	1024Linear-7	[-1, 6274]	3,217,538ReLU-8	[-1, 6274]	0BatchNorm1d-9	[-1, 6274]	12,544Reshape-10	[-1, 128, 7, 7]	0ConvTranspose2d-11	[-1, 64, 14, 14]	131,136ReLU-12	[-1, 64, 14, 14]	0BatchNorm2d-13	[-1, 64, 14, 14]	128ConvTranspose2d-14	[-1, 1, 28, 28]	1025Tanh-15	[-1,1,28,28]	0Input shape: [-1, 200] Total Params: 3.5M Trainable Params: 3.5M		14Under review as a conference paper at ICLR 2022
Table 5: Network structures of discriminator for MNIST, Fashion-MNIST. The discriminator of“Bad-GAN” and “Good-GAN" Share the Same structure.__________Layer (type)	Output Shape	Param #Conv2d-1	[-1,64,14,14]	1088LeakyReLU-2	[-1, 64, 14, 14]	0Conv2d-3	[-1, 64, 7, 7]	65600LeakyReLU-4	[-1, 64, 7, 7]	0ReShape-5	[-1, 3136]	0Linear-6	[-1, 512]	1605632LeakyReLU-7	[-1, 512]	0Linear-8	[-1, 128]	655664LeakyReLU-7	[-1, 128]	0Linear-8	[-1, 1]	256Sigmoid-9	[-1, 1]	0Input shape: [-1,1, 28, 28]Total ParamS: 1.7MTrainable Params: 1.7MTable 6: NetWork StrUctureS of generator for HAM10000Layer (type)	Output Shape	Param #Linear-1	[-1,256]	51,456
Table 6: NetWork StrUctureS of generator for HAM10000Layer (type)	Output Shape	Param #Linear-1	[-1,256]	51,456ReLU-2	[-1, 256]	0BatchNorm1d-3	[-1, 256]	512Linear-4	[-1, 512]	131,584ReLU-5	[-1, 512]	0BatchNorm1d-6	[-1, 512]	1024Linear-7	[-1, 4608]	2363904ReLU-8	[-1, 4608]	0BatchNorm1d-9	[-1, 4608]	9216ReShape-10	[-1, 128, 6, 6]	0ConvTranSpoSe2d-11	[-1, 64, 12, 12]	131,136ReLU-12	[-1, 64, 12, 12]	0BatchNorm2d-13	[-1, 64, 12, 12]	128ConvTranSpoSe2d-14	[-1, 64, 24, 24]	65600ReLU-15	[-1, 64, 24, 24]	0BatchNorm2d-16	[-1, 64, 24, 24]	128ConvTranSpoSe2d-17	[-1, 3, 48, 48]	3075Tanh-18	[-1,3, 48,48]	0
Table 7: Network structures of discriminator for HAM10000. The discriminator of “Bad-GAN” and“Good-GAN” share the same structure.___________________________Layer (type)	Output Shape	Param #Conv2d-1	[-1, 64, 24, 24]	3072LeakyReLU-2	[-1, 64, 24, 24]	0Conv2d-3	[-1, 64, 12, 12]	65600LeakyReLU-4	[-1, 64, 12, 12]	0Conv2d-5	[-1, 64, 6, 6]	65600LeakyReLU-6	[-1, 64, 6, 6]	0Reshape-7	[-1, 2304]	0Linear-8	[-1, 512]	1180160LeakyReLU-9	[-1, 512]	0Linear-10	[-1, 128]	655664LeakyReLU-11	[-1, 128]	0Linear-12	[-1, 1]	256Sigmoid-13	[-1,1]	0Input shape: [-1,1, 48, 48]Total Params: 1.4MTrainable Params: 1.4MTable 8: Network structures of generator for BraTS20
Table 8: Network structures of generator for BraTS20Layer (type)	Output Shape	Param #ConvTranspose2d-1	-[-1,256, 6, 6]^^	1638400BatchNorm2d-2	[-1, 256, 6, 6]	512ReLU-3	[-1, 256, 6, 6]	0ConvTranspose2d-4	[-1, 128, 12, 12]	819200BatchNorm2d-5	[-1, 128, 12, 12]	256ReLU-6	[-1, 128, 12, 12]	0ConvTranspose2d-7	[-1, 64, 24, 24]	204800BatchNorm2d-8	[-1, 64, 24, 24]	128ReLU-9	[-1, 64, 24, 24]	0ConvTranspose2d-10	[-1, 32, 48, 48]	51200BatchNorm2d-11	[-1, 32, 48, 48]	64ReLU-12	[-1, 32, 48, 48]	0ConvTranspose2d-13	[-1, 32, 96, 96]	25600BatchNorm2d-14	[-1, 32, 96, 96]	64ReLU-15	[-1, 32, 96, 96]	0Upsample-16	[-1, 32, 192, 192]	0Conv2d-17	[-1, 1, 192, 192]	800Tanh-18	[-1,1,192,192]	0
Table 9: Network structures of discriminator for BraTS20. The discriminator of “Bad-GAN” and“Good-GAN” share the Same structure._____________________________Layer (type)	Output Shape	Param #Conv2d-1	[-1,32, 96, 96]	832LeakyReLU-2	[-1, 32, 96, 96]	0Conv2d-3	[-1, 64, 48, 48]	51264InstanceNorm2d-4	[-1, 64, 48, 48]	128LeakyReLU-5	[-1, 64, 48, 48]	0Conv2d-6	[-1, 64, 24, 24]	102464InstanceNorm2d-7	[-1, 64, 24, 24]	128LeakyReLU-8	[-1, 64, 24, 24]	0Conv2d-9	[-1, 128, 12, 12]	204928InstanceNorm2d-10	[-1, 128, 12, 12]	256LeakyReLU-11	[-1, 128, 12, 12]	0Conv2d-12	[-1, 256, 6, 6]	819456InstanceNorm2d-13	[-1, 128, 12, 12]	512LeakyReLU-14	[-1, 128, 12, 12]	0Conv2d-15	[-1, 256, 3, 3]	1638656LeakyReLU-16	[-1, 256, 3, 3]	0Conv2d-17	[-1, 1, 1, 1]	2305
