{
    "Decision": {
        "decision": "Accept (Poster)",
        "comment": "This paper considers the problem of reasoning about uncertain poses of objects in images. The reviewers agree that this is an interesting direction, and that the paper has interesting technical merit. ",
        "title": "Paper Decision"
    },
    "Reviews": [
        {
            "rating": "6: Weak Accept",
            "experience_assessment": "I have read many papers in this area.",
            "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.",
            "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.",
            "title": "Official Blind Review #2",
            "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.",
            "review": "This paper focuses on the problem of reasoning about uncertain poses and orientations. To address the limitations of current deep learning-based approaches, the authors propose a probabilistic deep learning model with a novel loss function, Bingham loss, to predict uncertain orientations. The experimental results demonstrate the effectiveness of the proposed approach.\n\nThis paper is well-motivated and the proposed method addresses important problems in uncertain orientation prediction. The paper is well-supported by theoretical analysis, however, the empirical analysis is a little weak and the model does not consider multimodal cases. For the above reasons, I tend to accept this paper but wouldn't mind rejecting it. \n\nQuestions: \n1. You only compared with one baseline. How does the model compare with a loss that is not based on directional statistics or Gaussian models?\n2. How can you improve the model for multimodal cases?"
        },
        {
            "experience_assessment": "I do not know much about this area.",
            "rating": "6: Weak Accept",
            "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.",
            "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.",
            "title": "Official Blind Review #2513",
            "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.",
            "review": "The paper proposes a Brigham loss (based on the Brigham distribution) to model the uncertainty of orientations (an important factor for pose estimation and other tasks). This distribution has the necessary characteristics required to represent orientation uncertainty using quaternions (one way to represent object orientation in 3D) such as antipodal symmetry. The authors propose various additions such as using precomputed lookup tables to represent a simplified version of the normalization constant (to make it computationally tractable), and the use of Expected Absolute Angular Deviation (EAAD) to make the uncertainty of the Bingham distribution more interpretable. \n\n+Uncertainty quantification of neural networks is an important problem that I believe should gain more attention so I am happy to see papers such as this one. \n+Various experiments on multiple datasets show the efficacy of the method as well as out performing or showing comparable results to state-of-the-art\n\n-In the caption for Table 1 the author’s write: “the high likelihood and lower difference between EAAD and MAAD indicate that the Bingham loss better captures the underlying noise.” How much difference between EAAD and MAAD is considered significant and why?\n\n-In section 4.5 they write “While Von Mises performs better on the MAAD, we observe that there is a larger difference between the MAAD and EAAD values for the Von Mises distribution than the Bingham distribution. This indicates that the uncertainty estimates of the Von Mises distribution may be overconfident.” Same question as above. What amount of difference between MAAD and EAAD is considered significant and why?\n"
        }
    ]
}