{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Accept (Oral)",
        "comment": "The authors focus on the conditional generation of molecular conformations (i.e. 3D cartesian atom positions) from a given molecular graph. They formulate the generation via diffusion probabilistic models.  Conformations are generated by a reverse diffusion process from isotropic Gaussian noise to molecular conformations. This diffusion process is learned from data using a SE(3) invariant formulation of the diffusion process. The authors work directly with atomic positions (i.e. a point cloud) instead of interatomic distances or an intermediate bond geometry representation. Experimental evaluations show state-of-the-art results according to COV/MAT metrics on GEOM-Drugs and GEOM-QM9 datasets.\n\nStrengths:\n\n- High technical novelty: first generative model for molecular conformation generation based on a diffusion framework\n- Very clearly written paper.\n- Impressive empirical results with state-of-the-art results on GEOM-Drugs and GEOM-QM9 datasets.\n\nWeaknesses:\n\n- Most of the weaknesses reported by the reviewers seem to have been addressed in the rebuttal.\n\nThe idea of the work is highly novel. The authors propose the first generative model for molecular conformation generation based on a diffusion framework. This paper brings together recent ideas and methods (e.g. diffusion, SE(3) equivariance) to the established task of molecular conformation generation with impressive empirical results. All the reviewers agree on acceptance with high scores. I recommend the authors to look at the reviewers' comments to improve the paper for the camera-ready version"
    },
    "Reviews": [
        {
            "summary_of_the_paper": "This paper tackles the problem of conditional generation of molecular conformations (i.e. 3D cartesian atom positions) given a molecular graph. The authors formulate the generation process via diffusion probabilistic models; Conformations are generated by learning a reverse diffusion process from isotropic gaussian noise to molecular conformations. They use a SE(3) invariant formulation of the diffusion process based on Kohler et al 2020, and they operate directly on atomic positions (i.e. a point cloud) instead of interatomic distances or an intermediate bond geometry representation. The authors show state of the art results evaluated by COV/MAT metrics on GEOM-Drugs and GEOM-QM9 datasets.",
            "main_review": "This paper brings together recent ideas and methods (e.g. diffusion, SE(3) equivariance) to the established task of molecular conformation generation with impressive empirical results. A few more experiments are necessary. The paper is well written. I am only tangentially in this area so I am not intimately familiar with the prior works and benchmarks, and may have missed something in the empirical evaluation.\n\nComments:\n* The authors state that roto-translation invariance is a critical inductive bias for this problem. But I am not convinced that it is critical for this setup and model class. It would be nice to include a baseline of the diffusion model without SE(3) invariance.\n* I am curious about the sensitivity of the performance of the model to the hyperparameters of the diffusion process. Can the authors describe how they reached the current settings given in Table 5. In particular, T=5000 steps seems quite high and I was curious about the performance with lower T say around 1000. As a minor note, there appears to be an inconsistency in the reported batch size (128 in the text vs. 32/64 in Table 5)\n* What is the generation time with 5000 diffusion steps? Does that become a bottleneck in conformation generation?\n* What happened to the other methods on the geom-drugs dataset for Table 3?\n* The authors should mention recent point cloud diffusion papers in their related works as it is addressing a very similar problem\n* What are the reverse process sigmas set to?\n\nMinor comments:\n* Typo: translatoinal\n* Typo: sophisticate\n* I noticed a reference that seemed incorrect: Xu et al 2021a as the reference for molecular generation with VAEs in the second paragraph. The authors should double check their references\n",
            "summary_of_the_review": "Overall a nice paper with technical novelty and good empirical results. I have some questions about the evaluation since some apt baselines are missing. I will raise my score if the authors can address my comments.\n",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "The work introduces a novel **GeoDiff** model for conformation generation task, based on a promising diffusion model approach that shows state-of-the-art results in other domains. The authors improved and adapted the concept of the diffusion model for the new domain so that it can work with rotation and translation invariant objects, such as conformations - authors introduced an architecture based on SE(3)-equivariant Graph Field Network (GFN) for parameterizing Markov kernels, also used roto-translational invariant starter density.\n\nThe main contributions of the paper are: the authors are the first who propose an architecture based on principal novel generative diffusion framework for molecular conformation generation and explore suitable roto-translational invariant architecture to parameterize the kernel of the method. Experiments show that the proposed model outperforms recent state-of-the-art approaches with a huge gap on **Conformation Generation** and **Property Prediction** tasks.",
            "main_review": "**Originality:** The idea of the work is novel - **GeoDiff** is the first generative model for molecular conformation generation based on a diffusion framework.\n\n**Clarity and Quality:** The authors clearly provide motivation and state the differences of the proposed model from other approaches. The architecture is described in an easy-to-follow and intuitive way. The paper provides good **Related Work** and **Results & Discussion** sections. Still, it would be great if authors add a clear description of contributions and additional figures of architecture and an aligned cloud of conformations to visually evaluate the diversity of conformations.\n\n**Significance:** The contribution of the paper to the field is significant. The experiments show a significant metrics gap between the proposed method and baselines, still, it would be great if authors will add standard deviation of metrics to evaluate the stability of the method.\n\n**Drawbacks / questions**:\n\n1. In 3.1 Authors say, they are interested in generating stable conformations. Authors provide energy metrics for the generated ensemble on GEOM-QM9 split, which covers only 30 molecules. Still, they don't provide energy metrics for medium size molecules from GEOM-DRUGS dataset.\n2. Despite the proposed model being compared against a variety of baselines and that the authors mentioned the reason why they are not compared with the GeoMol, it requires a more detailed explanation of GeoMol limitations, since the GeoMol is the current state of the art approach in conformation generation task.\n3. Diffusion models suffer from high computational complexity. Based on the parameters provided by the authors in appendix B, it's logical to assume that 5000 iterations per molecule are very computationally expensive. The article lacks an estimate of the generation time for one molecule.",
            "summary_of_the_review": "The idea of the paper is novel. The text of the paper is clear and easy to follow. The experiments show a significant gap in metrics values between the proposed model and baselines. Still, there are several minor drawbacks that can be fixed in the next revision of the paper.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        },
        {
            "summary_of_the_paper": "This paper describes and tests GeoDiff, an end-to-end denoising diffusion model for generating molecular conformations from a molecular graph. The idea is to learn how to denoise a random conformation so as to generate a realistic structure of a small molecule. To do so, a molecular structure is first transformed into a random configuration from an uncorrelated multivariate normal distribution via a diffusion process (forward process). By training a backwards model that inverts the diffusion process, molecular conformations can then be generated from white noise. The reverse process is modeled as a sequence of Markov kernels where each kernel is a Gaussian whose means are neural networks that are trained based on the forward  trajectories. Molecular conformations are directly parameterized in Cartesian coordinates. Therefore, an important property that should be imposed on the reverse process is *equivariance*. Equivariance refers to the following behavior of a mapping under the action of a group: Transforming the input and then mapping it to some output is the same as applying the mapping first and then transforming the output. Here, the relevant group, the special Euclidean group $SE(3)$, is formed by the rigid transformations in $\\mathbb R^3$. Equivariance is implemented by drawing the initial conformation from a distribution that is invariant under rigid transformations (isotropic Gaussian that removes the center of mass) and by using equivariant Markov kernels for the reverse process. The equivariance of the Markov kernels is implemented with equivariant convolutional layers (graph field network (GFN)). Two invariant objective functions for training are derived (\"alignment approach\" and \"chain-rule approach\"). GeoDiff is tested on two standard benchmarks and shows a superior performance compared to other molecular configuration generators. Also property predictions made by GeoDiff are better than with concurrent methods. \n",
            "main_review": "## Pros\n\n* GeoDiff is an end-to-end model for generating Cartesian coordinates from a molecular graph. \n\n* GeoDiff shows very good performance on standard test sets.\n\n* GeoDiff outperforms various state-of-the-art methods for generating molecular conformations. \n\n## Cons\n\n* GeoDiff's model seems to involve a large number of parameters. \n\n## Comments and Questions\n\n* What is the computation time for generating a structure with GeoDiff? How does this compare to other ML approaches or RDKit? \n\n* What is the accuracy of the structures at intermediate stages of the diffusion process? Perhaps this could provide some insight into whether $T=5000$ diffusion steps are needed to reach the reported performance. \n\n* Have you also run tests with a smaller number of diffusion steps? \n\n* You show that GeoDiff's model and objective functions are invariant under rigid transformations. However, what if the training data are not invariant? Doesn't this still fix some arbitrary orientation in the trained model? \n\n* Which threshold $\\delta$ did you use in the computation of the precision and recall measures? \n\n* What is the total number of model parameters that are trained? \n\n* How is GeoDiff +FF implemented? What is GeoDiff's performance in property prediction without FF? \n\n## Language\n\n* Page 3: \"It has been shown effective\"\n\n* Page 9: \"can stay the superior diversity\"\n\n* Page 9: \"yeild\" instead of \"yield\"\n\n",
            "summary_of_the_review": " GeoDiff is an end-to-end model for generating Cartesian coordinates from a molecular graph. GeoDiff outperforms various state-of-the-art methods for generating molecular conformations. ",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        }
    ]
}