{
    "Decision": {
        "metareview": "The paper presents a new approach for domain generalization whereby the original supervised model is trained with an explicit objective to ignore so called superficial statistics present in the training set but which may not be present in future test sets. The paper proposes using a differentiable variant of gray-level co-occurrence matrix to capture the textural information and then experiments with two techniques for learning feature invariance. All reviewers agree the approach is novel, unique, and potentially high impact to the community. \n\nThe main issues center around reproducibility as well as the intended scope of problems this approach addresses. The authors have offered to include further discussions in the final version to address these points. Doing so will strengthen the paper and aid the community in building upon this work. ",
        "confidence": "4: The area chair is confident but not absolutely certain",
        "recommendation": "Accept (Oral)",
        "title": "Original work for domain generalization with strong experimental evidence"
    },
    "Reviews": [
        {
            "title": "A domain generalization approach is introduced to reveal semantic (relevant) information based on a linear projection scheme from CNN and NGLCM ouput layers.",
            "review": "The paper is clear regarding motivation, related work, and mathematical foundations. The introduced cross-local intrinsic dimensionality- (CLID) seems to be naive but practical for GAN assessment. Notably, the experimental results seem to be convincing and illustrative. \n\nThe domain generalization idea from CNN-based discriminative feature extraction and gray level co-occurrence matrix-based high-frequency coding (superficial information), is an elegant strategy to favor domain generalization. Indeed, the linear projection learned from CNN, and GLCM features could be extended to different real-world applications regarding domain generalization and transferring learning. So, the paper is clear to follow and provides significant insights into a current topic.\n\nPros: \n- Clear mathematical foundations.\n- The approach can be applied to different up-to-date problems.\n-Though the obtained results are fair, the introduced approach would lead to significant breakthroughs regarding domain generalization techniques.\n\nCons:\n-Some experimental results can be difficult to reproduce. Indeed, authors claim that the training heuristic must be enhanced.\n-Table 2 results are not convincing.\n",
            "rating": "7: Good paper, accept",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "Revisit old image processing idea, add parameters, make differentiable. Show that it can be used to ignore background textures. Extensive experiments on domain adaptation.",
            "review": "Summary:\nThe paper proposes an unsupervised approach to identify image features that are not meaningful for image classification tasks. The goal is to address the domain adaptation (DA)/domain generalization (DG) issue. The paper introduces a new learning task where the domain identity is unavailable during training, called unguided domain generalization (UDG). The proposed approach is based on an old method of using gray level co-occurence matrix, updated to allow for differentiable training. This new approach is used in two different ways to reduce the effect of background texture in a classification task. The paper introduces a new dataset, and shows extensive and carefully designed experiments using the new data as well as existing domain generalization datasets.\n\nThis paper revisits an old idea from image processing in a new way, and provides an interesting unsupervised method for identifying so called superficial features. The proposed block seems to be very modular in design, and can be plugged into other architectures. The main weakness is that it is a bit unclear exactly what is being assumed as \"background texture\" by the authors.\n\n\nOverall comments:\n- Some more clarity on what you mean by superficial statistics would be good. E.g. by drawing samples. Are you assuming the object is centered? Somehow filling the image?  Different patch statistics? How about a texture classification task?\n- please derive why NGLCM reduces to GLCM in the appendix. Also show the effect of dropping the uniqueness constraint.\n- Section 3.2: I assume you are referring to an autoencoder style architecture here. Please rewrite the first paragraph. The current setup seems to indicate that you doing supervised training, since you have labels y, but then you talk about decoder and encoder.\n- Section 3.2: Please expand upon why you use F_L for training but F_P during testing\n\n\nMinor typos/issues:\n- Last bullet in Section 1: DG not yet defined, only defined in Section 2.\n- page 2, Section 2, para 1: data collection conduct. Please reword.\n- page 2, Section 2, para 2: Sentence: For a machine learning ... There is no object in this sentence. Not sure what you are trying to define.\n- page 2, Section 2, para 2: Is $\\mathcal{S}$ and $\\mathcal{T}$ not intersecting?\n- page 2, Section 2.1: Heckman (1977), use \\citep\n- page 2, Section 2.1: Manski, citep and missing year\n- page 3, Section 2.1: Kumagai, use citet\n- page 3, Section 3.1: We first expand ... --> We first flatten A into a row vector\n- page 4, Section 3.1: b is undefined. I assume you mean d?\n- page 4, Section 3.1: twice: contrain --> constraint\n- page 4, Section 3.2: <X,y> --> {X,y} as used in Section 3.1.\n- page 4, Section 3.2, just below equation: as is introduced in the previous section. New sentence about MLP please. And MLP not defined.\n- page 4, Section 3.2, next paragraph: missing left bracket (\n- page 4, Section 3.2: inferred from its context.\n- page 5, Section 4: popular DG method (DANN)\n- page 7: the rest one into --> the remaining one into\n- page 8: rewrite: when the empirical performance interestingly preserves.\n- page 8, last sentence: GD --> DG\n- A2.2: can bare with. --> can deal with.\n- A2.2: linear algebra and Kailath Variant. Unsure what you are trying to say.\n- A2.2: sensitive to noises --> sensitive to noise.\n",
            "rating": "7: Good paper, accept",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": " The proposal is well structured and written. The quality of the paper is excellent in terms of novelty and originality.",
            "review": "The paper proposed a novel differentiable neural GLCM network which captures the high reference textural information and discard the lower-frequency semantic information so as to solve the domain generalisation challenge. The author also proposed an approach “HEX” to discard the superficial representations. Two synthetic datasets are created for demonstrating the methods advantages on scenarios where the domain-specific information is correlated with the semantic information. The proposal is well structured and written. The quality of the paper is excellent in terms of novelty and originality. The proposed methods are evaluated thoroughly through experiments with different types of dataset and has shown to achieve good performance. ",
            "rating": "9: Top 15% of accepted papers, strong accept",
            "confidence": "3: The reviewer is fairly confident that the evaluation is correct"
        }
    ]
}