{
    "Decision": "",
    "Reviews": [
        {
            "title": "While the application is interesting and the paper is well written, i cannot see enough technical novelty compared to Weyand et al. (2016) to justify publication at ICLR18.)",
            "rating": "3: Clear rejection",
            "review": "The paper deals with global geolocation estimation from a partially sparse set of images. It proposes replacing the usual quad-tree approach with a Delaunay meshing strategy to better cope with low data volumes for geolocation estimation.  The paper is generally well written, experiments are well presented and the application is interesting.\n\nMy main concern is that this is only a slight extension of the PlaNet work of Weyand et al. (2016). As described on P3, section 3.1.1, first two rows, the claimed contribution with respect to PlaNet is \"The classification structure is generated using a Delaunay triangle-based meshing architecture. This differs from the PlaNet approach, which utilizes a quad-tree mesh\". That is, the authors replace the quad-tree component of the PlaNet paper with a Delaunay mesh. Moreover, the authors replace the Inception v3 network architecture of PlaNet with Inception v4 (P4, section 3.1.2) and add time meta data (section 3.2).\n\nIf the authors would want to make their meshing strategy the main point of the paper, I would expect them running additional approaches from literature (and not only PlaNet of Weyand et al., (2016)) with the Delaunay approach. This would more generally prove the concept and show that it generalizes to any kind of approach dealing with global geolocation estimation from partially sparse image sets. And still that would probably not be enough for its own paper at a top conference.  \n\nAlthough all of these slight variations do improve numbers slightly, I view them as merely incremental over (Weyand et al., 2016). This seems a very \"applied\" paper without much if any methodological contribution. There is not enough technical novelty to make this a standalone, mature ICLR 2018 paper.  I therefore recommend rejection of this submission from ICLR18.\n \n",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "Good insights, but no strong technical contributions",
            "rating": "4: Ok but not good enough - rejection",
            "review": "The paper addresses the problem of image geolocation -- i.e. estimating the location where an image was taken.\nThe proposed approach is based on CNNs. The authors propose three classification models: the first one exploits only image content; the second fuses, in a multi-modal way, content with information about time; the third one exploits also information about the user posting the photo.\nThe approach differs from previous work mainly in the meshing architecture/labelling scheme used to associate photos to geographic locations, and in the use of time and user information. \nQuantitative evaluation on the Im2GPS dataset shows that the approach has an accuracy comparable to the state of the art (while using less training data). Also, the use of time/user info (slightly) helps improve accuracy.\n\nThe paper is clear and easy to read. The authors provide an extensive quantitative evaluation, trying to highlight the impact of different factors (e.g. mesh resolution, features considered etc.) on accuracy and bias.\n\nHowever, the main concerns are:\n- limited technical contribution: multi-modal approaches to image geolocation were already proposed in previous work. While the authors provide some interesting insights, they do not introduce strong novelties.\n- indeed, quantitative results do not seem to bring enough evidence for considering the proposed approach more effective than the state of the art. Also, the impact of the new features considered on the final model accuracy seems quite limited.\nFor these reasons, the paper seems below the acceptance bar for ICLR.\n\nOther notes:\n- In YFCC100M, the \"time\" associated to an image is the time of upload. This might be very different from the time the image was taken. Do the authors think the results might be significantly different if one had access to the actual capture time?\n- The authors could discuss in more detail what the challenges would be for training an end-to-end model exploiting content, time and user-related features.\n- Would it be possible to train the model on more data, so that a fair comparison with the state of the art can be performed?\n- There are quite a few typos (e.g. Caption Fig. 1: \"tahn\", Sec. 3.1.1: Refinment, Figure 3.1.1, Sec. 5: Delunary etc.).",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "Limited contribution",
            "rating": "4: Ok but not good enough - rejection",
            "review": "This paper proposes a novel image/album geolocation algorithm. This is based on the recent PlaNet approach, with several extensions, including a better mesh representation for discretization and the time-aware prediction. However, contributions are limited to me.  \n\nPros: \n- Clearly written\n- Good results\n- Interesting empirical analysis between UTC time and geo-location\n\n\nContribution: \n- Triangulation based meshify vs quad-tree meshification was claimed to be one of the major contributions. It is an incremental improvement towards Wayand et al. However I don’t think this is significant enough for an ICLR paper. \n- Incorporating the time-ordering into album based geo-localization is considered a contribution on the application side. But in computer vision this is not the first one to exploit this information (see [a]) while the technical approach to encode this information is quite standard (LSTM).\n\nImprovement:\n- Compared against Wayand et al. and Vo et al. the quantitative results are not very impressive. \n\nMinor:\nSome choices in feature engineering are not explained well: e.g. In section 3.2, why you only choose top 10 maximum entries, why l1-norm is appended as a feature? Are those choice made because of validation performance?\n\nMinor writing:\nFig. 1 “01:00 than”\nFig. 1 “to make a prediction”\n“Fig. 3.1.1”\nTable 5. Why not bold the best performance?\nAcknowledgements shouldn’t be put in double-blind reviewing process\n\n[A] Evangelos Kalogerakis, Olga Vesselova, James Hays, Alexei A. Efros, Aaron Hertzmann, \"Image Sequence Geolocation with Human Travel Priors\", Proceedings of the IEEE Internaltional Conference on Computer Vision Recognition (ICCV), 2009. ",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        }
    ]
}