{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Accept (Poster)",
        "comment": "The paper studies the problem of finding an optimal memory less policy for POMDPs.  This work makes an important theoretical contribution.  The reviewers are unanimous in recommending the acceptance of the paper.  Well done!"
    },
    "Reviews": [
        {
            "summary_of_the_paper": "This paper studies the geometric property of memoryless policy optimization problem for POMDP. The main idea is to formulate the state-action visitation frequency constraint as a polynomial constraint. Then, the degrees on the polynomials are bounded, based on which the number of critical points is obtained. \n",
            "main_review": "Strength: \nPOMDP is a very hard problem, and so is the memoryless policy optimization problem for POMDP. This paper sheds some light on the geometry of this non-convex problem, and I appreciate the effort and the mathematical rigor. I enjoyed reading the paper. \n\nWeakness:\n\nWhile this is a hard problem, the results in this paper are far from the practice in most senses. I am not sure how the bound on the number of critic points will be helpful for policy optimization algorithms in practice. \n\nFor example,  the authors can think about whether the bound in (5) can help identify “easy” cases, i.e. problems with one or relatively few critical points. \n",
            "summary_of_the_review": "As I said, this is a hard problem and the authors obtained some interesting results. Yet, I am not sure ICLR is the best venue for this paper. Maybe a more theoretic-focused venue is more relevant. ",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper",
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "This paper studies the problem of finding the best memoryless stochastic policy for an infinite-horizon partially observable Markov decision process (POMDP). It is shown that the (discounted) state-action frequencies and the expected cumulative reward are rational functions of the policy, and the degree is determined by the degree of partial observability. The problem is then formulated as a linear optimization with polynomial constraints. The authors then demonstrate how the partial observability constraints can lead to multiple smooth and non-smooth local optimizers and we estimate the number of critical points. ",
            "main_review": "In general, the paper is well-written and I enjoyed reading, and the tools and ideas are novel. To the best of my knowledge, this appears to be the first study of the geometry of memoryless stochastic policy search for POMDPs. It would make the paper stronger if more simulation results, for example, on the geometry around the critical points, and/or compare with the case with finite-memory policies, etc. In other words, though highly nontrivial and I appreciate it, only asserting on the upper bound on the number of critical points seem not super useful. As an initial attempt, it might be also valuable to try some numerical examples to have more insights on the scenarios where the theory cannot cover. ",
            "summary_of_the_review": "Here are some (relatively minor) comments:\n\n1. Terminology. I think usually in RL we refer to the \"expected (discounted) state-action frequency\" here as \"(discounted) visitation/occupancy measure\". Calling it \"frequency\" sounds a bit non-standard to me.\n2. Proposition 22, should the mapping p being from t to $det(A+t B)$ (instead of $det(A+\\lambda B)$)?\n3. I was wondering how the results in the current paper reconcile with the results in Azizzadenesheli et al., '18? It seems that in that paper, some \"Gradient dominance\" property can be established, which should lead to some global convergence results. Since it is a closely related paper, a more detailed comparison seems necessary.\n4. I was wondering whether the results in Sec. 5 can be extended to the case with $\\gamma=1$ (average reward case)? If not, what would be the technical hurdles? Some discussion might be needed.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "In this work, the authors study the problem and structure of memoryless stochastic policies in POMDPs. The focus is on the discounted infinite-horizon problem over finite state-action spaces. For this problem, the authors show theoretical properties on the the problem critical points and provide methods to compute their number.",
            "main_review": "The paper is interesting, well written and the ideas introduced appear to be novel. I have the following comments:\n\nThe presentation is at times somewhat dry. Commentary on the implications of some of the statements would benefit the paper. In this regard, while theoretical properties are always welcome and of interest. It is not very clear what is the direct application of the author's work is. E.g., what is the practical importance of bounding the number of critical points? Can the resulting number be exploited in the construction of efficient algorithms? Can the author's illustrate this in numerical examples?",
            "summary_of_the_review": "The paper appears to be novel and well written. I am somewhat concerned on how interesting it might be to the community at large, due to its focus on theoretical properties with no clear direct application. In this regard, it it not entirely clear to this reviewer that ICLR is really the correct venue for this work.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "This paper studies several properties of the landscape of memoryless planning in infinite-horizon POMDPs. The primary focus of this paper is to provide formal expression of (a) state-action frequencies and (b) cumulative reward functions given a set of memoryless stochastic policies. Specifically, they show that both quantities can be expressed as rational functions of polynomial equations. The degree of polynomials used is proportional to the number of possible internal states given a set of observations (Theorem 4). Then, the authors describes the set of feasible state-action frequencies as the solution set to a system of polynomial equations and inequalities (Theorem 16). Finally, they provide the upper bound for the number of critical points in the landscape of policy optimization (Section 5). ",
            "main_review": "The paper presents an interesting set of theoretical properties about the landscape of planning in infinite-horizon POMDPs. It is interesting to know that key quantities as visiting frequencies or expected values of POMDP can be expressed as a fractional function of polynomial equations. Most importantly, degree of polynomials is proportional to a certain measure of observability (the number of possible internal states). \n\nMy main criticism is about the implication of results. While several interesting discoveries are presented in order, it does not provide much implications to actually solving the planning problem, or deeper understandings of POMDP. The paper is also quite heavy on notation and terminologies, and thus hard to follow. IMO, applying the results to a few more interesting toy examples would have helped a lot. I liked the blind-controller example. \n\nI wonder if the authors can provide more explicit forms of the optimal policy if we consider a weaker version of partial observability. For instance, one may consider the case when a single observation comes from a single internal state w.h.p (relaxation of cardinality based measures). Another easier partially observability might be the case where the only partial observability is decided at the start of episode and non-changing or slowly-changing.",
            "summary_of_the_review": "The paper considers an important and challenging problem, with a set of new interesting theoretical discoveries. I think this is a right step to move forward understanding POMDPs, and could be a nice addition to literature, and thus I recommend acceptance. ",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        }
    ]
}