{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Accept (Poster)",
        "comment": "A deep Bayesian generative model is presented for multi-omics\nintegration, using fused Gromov-Wasserstein regularization between\nlatent representations of the data views. The method removes several\nnon-trivial and practically important restrictions from an earlier\nmethod BayRel, enabling application in new setups, while still\nperforming well.\n\nReviewers discussed the paper with the authors, resolving\nmisunderstandings of the differences from earlier work\n(esp. BayReL). The authors reported more extensive experiments in the\nrebuttal, though not comparisons. The main remaining weakness is that\nthe contributions are in a very narrow field, or at least aplications\nhave only been demonstrated in the narrow field of multi-omics data\nanalysis. And even within that field, only in a narrow subfield. In a\nmachine learning venue that is restrictive. Another issue is\ncomputational efficiency. The final decision then depends on how much\nweight we place on the novel contributions vs these weaknesses."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "The paper proposed a deep Bayesian model for heterogeneous multi-omics data integration. The Gromov-Wasserstein (FGW) regularization between latent representations of heterogeneous views is used to align nodes/features in every pair of views. The experimental results have demonstrated improvement in inferring meaningful relations.",
            "main_review": "The proposed model allows to integrate of both structured and unstructured heterogeneous views which often happens in the context of omics data. In order to align nodes/features in every pair of views, the Gromov-Wasserstein (FGW) has been used. The experimental results show a significant improvement of the proposed model to the baselines in several downstream tasks. However, the paper can be improved in the following aspects:\n  - It is not clear what is the key difference between BayReL and the proposed besides the FGW regularization term. \n  - Can we apply BayReL and FGW into a pipeline to learn heterogeneous views? And how is it compared to the proposed models if possible?\n  - What is the square node FGW in the graphical model in Figure 1. It is difficult to follow the generative process of the proposed models.",
            "summary_of_the_review": " In short, the paper is trying to solve an important challenge of heterogeneous multi-omics data integration by proposing an advanced model compared with BayReL. However, what is the key difference and improvements compared with BayReL should be discussed in detail.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "The authors propose a hierarchical Bayesian generative model for multiview learning aimed at application to integration of multiple modalities of omics data.\n",
            "main_review": "The paper is dense and terse making it difficult to follow in order to pick out the novelty of the proposed approach. The definition of the experiments and the data used in the Experiments section is not self-sufficient. Without consulting the Appendix it is hard to know what are the problems being solved, the preprocessing and representation of the data to be used as input to the method. Although the approach is aimed at multiomic integration, there is no real connection to the domain of application. The evaluation is focused on the comparison to BayReL a related approach mentioned throughout the paper but not described in the related work.\n\nMulti-omics integration is of interest in computational biomedicine. However, focusing on BayReL only, in the related work the authors miss a large body of work, old and new. To name some: SNF, iCluster, LIGER, embedding propagation. They also miss out on a large amount of data being generated with increasing pace within the field.\n\nJudging from the results, MoReL seems to offer some performance improvement over BayReL on structured problems. The authors demonstrate the ability of MoReL to learn from unpaired data and in a setting with missing data. It all comes at a cost of 4.5 fold increase in computational time. \n",
            "summary_of_the_review": "While there is a limited novelty and demonstrated improvement in performance over a single related approach, from the application and result interpretation point of view, the advantages of using MoReL are not clear.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "The authors propose a Bayesian framework to learn relations among multi-omic datasets. The main unique advantage over existing methods is the proposed method is able to learn without a priori dependency structure and it allows a certain degree of missingness and mismatching. Experiments on two biomedical multi-omics data sets partially demonstrate the effectiveness of the proposed method.",
            "main_review": "Strengths:\n\nI generally find the paper quite well written. The paper may be interesting to a much broader community rather than just the biomedical use cases the experiments have shown, as the methodology is presented for any multi-omic data in a very general way. \n\nThe overall methodology is similar to BayRel. Both papers formulate the problem of multi-omics data integration by modeling it as multi-view link prediction. However, this paper does have several nontrivial improvements over BayRel: it could handle scenarios that have no known structure information, and the samples could be unpaired across views. \n\nWeaknesses:\nMy main concern is with the experimental part. \nThe experiments are not extensive and cannot fully demonstrate the advantages of the proposed approach. First, the datasets are restrictive. Microbiome-metabolite interactions in CF may not be the most commonly used benchmark datasets in the biomedical multi-omic datasets, with many other more usual datasets not considered. Second, many of the advantages the proposed method claims cannot be fully demonstrated by the two datasets in experiment, though the authors do manipulate the structure of datasets manually to show that the method still works when some key assumptions of BayRel do not hold. It should be more telling if the authors could conduct a more comprehensive experimental studies, including more common datasets and datasets that are naturally with missingness and pairing issues. Also as the computational overhead compared to BayRel, knowing whether the methods could handle large-scale data with heterogeneous dependency structures would be helpful.\n",
            "summary_of_the_review": "The proposed method is convincing with respect to an important problem. The paper has nontrivial improvement over existing methods. Though it lacks comprehensive experimental validation, it is overall a good complement to existing literature.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "The authors propose a Bayesian model to infer relations across heterogeneous views of data, which can be of structured and unstructured type. ",
            "main_review": "On the positive side: the approach deals with problems that could not be previously easily tackled, such as 1) having access to a graph of dependencies between features for each view; 2) dealing with missing instances on some of the views; 3) having pairing information across each view. \nOn the negative side: a more thorough empirical investigation of how well the approach can deal with those cases is lacking. Specifically, 1) a study of the robustness when the graph of dependencies between features is noisy is missing (one should expect that some edges are wrong and study the dependency of the performance w.r.t. the number of wrong edges); 2) the authors show a single example where 10% of data is removed, however a study that reports the performance w.r.t. the fraction of removed data is needed to substantiate the claim that the approach is indeed successful in dealing with missing data; moreover the fraction of missing instances should be different for different views; 3) the authors report a single example of lack of alignment (reversing the order for one view but not the other), while a more systematic analysis with several random permutations is what should be reported.\nThe computational complexity is reported for a single dataset, while it should be possible to give a sense of the time dependency of the proposed approach  w.r.t. the training set and test set size (does it scale linearly?).\nSome comments would be appreciated to clarify how the model deals with the case of several structured or unstructured views: arguably the  graph of dependencies between features would form disconnected components when multiple structured views are considered and hence the shortest path distance cannot be computed in that case. \nWith regards to the case with multiple views, it would be of interest to study the sample complexity as a function of the number of available views, since, as the authors have stated in the introduction, leveraging the information from multiple sources should improve the performance on tasks with a limited number of training samples.  \n",
            "summary_of_the_review": "The approach deals with problems that could not be previously easily tackled, however  a more thorough empirical investigation of how well the approach can deal with those cases is lacking. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        }
    ]
}