{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Accept (Poster)",
        "comment": "This work tackles an important clinical application. It is experimentally solid and investigates\nnovel deep learning methodologies in a convincing way.\n\nFor these reasons, this work is endorsed for publication at ICLR 2022."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "The paper proposes a method to combine modeling based on graphs mapping electrode geometry and self-supervised pre-training for EEG-based seizure detection and classification. It also proposes an interpretation method using occlusion maps to the demonstrate the model's ability to localize seizure.",
            "main_review": "Strengths:\n- The paper is very well written with the 3 goals clearly stated and how they were addressed.\n- The paper proposes two graph structures to model natural geometry of EEG sensors and dynamic brain connectivity. It compares the two results and shows that correlation based structure (dynamic brain connectivity) performed better than the one based on distance (natural geometry) for a rare seizure type\n- The value of pre-training was shown is very clear from experimental results.\n- The accuracy of occlusion based seizure localization was quantified and visualized in a very comprehensible way. It shows the value of pre-training. It was great to see two goals of the paper (interpretability and effect of pre-training) demonstrated in one set of results.\n\nWeaknesses:\n- The paper does not include a lot of comparison with other methods but since it builds on multiple approaches (pre-training and two graph structures) there are 4 models resulting from these.\n- The individual methods are built upon exising work",
            "summary_of_the_review": "The paper proposes and  two graph structures to model EEG sensors and brain connectivity and a pre-training method to improve model performance. Both of these are well demonstrated and the results demonstrate how one structure is superior to another for a a particular type of rare seizure. It also includes an occlusion map based seizure localization method. Overall, the paper clearly states its goal and does a good job of reaching those goals using well demonstrated experimental results.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "The paper presents a method for seizure detection and classification. In particular, the method is self supervised, based on graph neural network and use EEG signals. The authors report significant performance in detection and classification, as well as provide methods for qualitative evaluation of model interpretability. ",
            "main_review": "The details of the self supervised training must be added in more detail for clarity and reproducibility. \n\nSelf supervised methods are mostly suited for applications where labels are scarce, the authors should add more justification as to why they have targeted such a method when sufficient labels are available \n\nAn occlusion based method is used for analysis of the interpretability, the authors should comment if the graph structure can be used to interpret the significance of various brain regions (coming from the electrodes) in terms of the seizure. \n\nAlthough the some classes are combined, it would be interesting to see the performance when all eight class labels present in the data are used for classification. ",
            "summary_of_the_review": "The authors present a graph neural network method for seizure detection and classification. The results are shown to improve current state-of-the-art. However some of the design choices and interpretability analysis needs more background and motivation. In particular, the details of the self supervised implementation needs more elaboration. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "The authors propose a graph-based representation from thresholded  Gaussian and linear (correlation) kernels (undirected connectivity) coupled with a diffusion convolutional recurrent network. Besides, a Fourier-based preprocessing is carried out with self-supervised (autoencoders) to initialize the network weights.  Experiments are performed on an EEG-based seizure detection and localization task. The seizure localization is conducted using occlusion and dropping approaches on EEG channels. Obtained results elucidate an interesting strategy for seizure analysis on a well-known public database.",
            "main_review": "Pros.\n-The paper combines well-founded strategies for representing EEG data on non-euclidean spaces preserving spatial and temporal patterns.\n-The algorithm can predict and localize seizures.\n-The mathematical background is limited but enough to clarify the main paper insights.\n-The experiments are explained in detail and include ablation procedures.\n-Code is available.\n\nCons. and comments\n-Though the autoencoder-based strategy seems helpful, It could be used as a regularization strategy within an end-to-end training. However, using the autoencoder just for initializing the network weights sounds limited; maybe other initialization and transfer learning strategies could obtain better results.\n-It is not clear to me how a simple correlation can enhance a nonlinear Gaussian kernel. I think the authors need to discuss better how they fix the kernel hyperparameters. For example, you are working on a log-spectral space, and you set the Gaussian bandwidth as the standard deviation of the Euclidean distances. Still, you then impose a manifold-based affinity by thresholding.\n-Authors claim that the non-Euclidean representation (affinity matrix thresholding) favors the EEG analysis. Nonetheless, if you use a Gaussian kernel with a proper bandwidth, you can obtain similar results compared to the thresholding approach without the need to fix such a hyperparameter. So then, is the \"non-Euclidean\" representation needed? Maybe, a good bandwidth with a good network will be enough.\n-Notations in section 2.2.2, Graph neural network, use the EEG trial X as input; however, according to fig 1, the DCRNNs are applied to the affinity matrix. Can you clarify, please?",
            "summary_of_the_review": "Overall, the paper covers a research field of interest from theoretical (Spatio-temporal coding of time series using graph and DCRNN) and practical (EEG-based seizure detection and localization) perspectives. The experiments are exhaustive and convincing.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        }
    ]
}