{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Accept (Poster)",
        "comment": "This paper proposes to leverage topological structure between domains, expressed as a graph, towards solving the domain adaptation problem.\n\nReviewer n4Lk thought the ideas were interesting, appreciated the theoretical analysis and indicated that the experiments were “well thought out”. The reviewer asked for more detail on Lemma 4.1 and suggested that a proof be provided for Proposition 4.1. They asked for more justification on why the change of task for the discriminator from classification to generation would improve performance. The authors responded to these comments, clarifying the proof of Lemma 4.1 in the appendix. They clarified that proposition 4.1 can be derived from Corollary 4.3 or Corollary 4.4. On the point of classical vs. enhanced discriminator the authors provided additional experiments. \n\nReviewer rNQp commented that the method was easy to follow and noted the theoretical and empirical analysis. They expressed some concern that previous work on graph-based domain adaptation was inadequately addressed. Like reviewer n4Lk they seemed unconvinced that the proposed graph discriminator was an improvement over past SOTA and questioned its novelty. In terms of claims about novelty and competitiveness relative to previous works I would have liked to see the reviewer make specific references rather than criticize in general terms. The authors’ responded to the reviewer, adding a recent entropy-based method (SENTRY) to the experiments and showed that their method outperformed this ICCV 2021 work by a large margin. They responded to the reviewer’s remarks about the original discriminator and variants, pointing out that this was already established in the paper. They used the other reviews to dispute the claim of lack of novelty. \n\nReviewer uDYW felt that the work was novel and interesting. Like rNQp they thought the paper was clear. They questioned the practical advantage over baselines. The authors responded to the reviewer’s question about using a data graph. They responded to the question about parameter tuning and computational cost. They addressed the question about limited improvements in real-world datasets.\n\nI had some difficulty motivating the reviewers to engage in the discussion and acknowledge the authors’ response. The authors also politely attempted to nudge the reviewers to consider their updated results. In my opinion, the author responses have addressed most of the reviewer concerns  and I don’t see any critical issues remaining. Therefore I think that this paper should be accepted as a poster."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "This paper proposes a new model called GRDA to relax the uniform alignment which ignores topological structures among different domains. GRDA uses a domain graph to encode domain adjacency. The authors also generalize the existing adversarial learning framework with a novel graph discriminator using encoding conditioned graph embeddings. Detailed math inductions and proofs are given. Empirical results on both synthetic and real-world datasets demonstrate the superiority of this method.",
            "main_review": "Some specific comments are as follows:\n\nPros:\n- Paper presents interesting ideas on how to utilize the original topological structures among different domains to benefit the domain adaptation results. The idea of using a discriminator to reconstruct rather than classify is novel.\n- Very detailed theoretical analysis is provided which makes the result be persuasive.\n- Experiments are well thought out and highlight the parameter study which makes the results of the work reproducible.\n\nCons:\n- Lemma 4.1 “Optimal Discriminator for GRDA”. This lemma is intuitively correct. However, the authors don’t show the strict analysis to this basic assumption, that is, the optimal discriminator will output the conditional expectation of A_ij over all possible combinations of domain pairs (i, j) sampled from p(u|e) and p(u|e’). Maybe giving an example would help readers understand this better.\n- Proposition 4.1 “Chain of Three Nodes”. This is a very interesting idea. However, there is no strict proof provided. \n- The authors didn’t analyze why the change of the task of discriminator from classification to generation would help the model’s performance in domain adaptation. Some intuitive analysis would not be enough.\n",
            "summary_of_the_review": "Overall, being among the few papers that venture into the domain adaptation of graph, the paper introduces a number of new concepts and mechanisms. This framework is promising.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "details_of_ethics_concerns": "None",
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This work optimizes the adversarial domain adaption model by generalizing the uniform domain alignment with a domain encoding graph. The proposed method is simple and easy to follow, and the overall idea is clearly described. Some experiments show the effectiveness of the proposed method on both synthetic and real-world datasets. ",
            "main_review": "This work includes some advantages:\n1. The authors generalize the adversarial learning framework by replacing the domain discriminator with a graph discriminator.\n2. Some theoretical analyses support their claims on such a replacement.\n3. Experimental results validate the usefulness of the proposed method on domain adaption.\n\nSome concerns are listed as follows.\n1. Domain alignment has been intensively studied and graph-based domain adaptation also has been well discussed in the existing works.  There are lots of variants on the adversarial discriminator or entropy-based or distribution alignment theories. The authors fail to convince the reviewer the proposed graph discriminator is better than the original adversarial discriminator or its variants, although they present a series of theorems and corollaries in the support section. To me, adversarial discriminators are more general than the given graph discriminator.\n2. Graph-based discriminator has appeared in the existing works. The authors should give the reviewer a full explanation of your contributions.\n3. For experiments, there are many advanced SOTA works, while the authors mainly compared some conventional methods, which are not the SOTA domain adaption works.\n4. If the proposed method can replace the original adversarial works, this paper could be rated a high score for acceptance. The authors should pay more attention to the advantages of the proposed methods, and how could you make your work outperform these popular works, which is also the goal of ICLR.",
            "summary_of_the_review": "This paper proposes a new graph discriminator to replace the conventional adversarial discriminator in adversarial domain adaptation. Some theoretical and experimental analyses validate their claims, while some concerns should be clarified and improved.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "details_of_ethics_concerns": "See Main Review.",
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        },
        {
            "summary_of_the_paper": "This paper explore multi-target domain adaptation by graph.  For this setting, It is not suitable to treat equally every domain, and align them all perfectly.  To remedy this problem, In this paper authors propose the graph-based method to learn the adjacency between domains.  In this paper, authors propose adversarial learning method, which refers the encoder and the discriminator. What is more,  authors show the theoretical analysis for this problem. The reported results shows that the proposed method successfully generalizes uniform alignment.",
            "main_review": "\nStrengths:\n1.\tThis paper propose novel method multi-target domain adaptation. Authors introduce the adversarial learning method for this issue, which looks interesting.\n2.\tThe paper gives clear description about this problem, and the proposed method, which is easy to follow.\n3.\tUsing varying kinds of datasets to test the provided method, which is solid.\n4.\tI like the shown figure in this paper, which is great for me to depict how the proposed method works.\n\nWeaknesses:\n1.\tDo this proposed method for traditional domain adaptation with two domain. What I mean is to learn the graph for data instead of domain.\n2.\tThe reported results looks has little advantage compared to baselines. Do authors pay more energy and parameters ?\n\n\n--------------------After rebuttal----------------------\n\nThanks for authors' response. Authors have addresses my concerns excepting for the further experiment for two domain, which does not influence my score. After reading other reviewers' comments (e.g., on one mention the less novelty), it think the proposed method still keep advantages compared existing methods.  I would like  keep my score.",
            "summary_of_the_review": "It looks the proposed method is new, since it built an adversarial learning for this question. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        }
    ]
}