{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Accept (Poster)",
        "comment": "The authors proposed a new loss function for end-to-end edge detection to overcome the label imbalance and edge thickness problems. Overall, the proposed VT appears to be a useful representation for boundary detection. Though similar to DT, VT outperforms DT by a large margin and is more robust to noise. One reviewer recommends acceptance, two others recommend marginal acceptance. The main issues have been adequately addressed in the rebuttal."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "The paper proposes a method to detect boundaries in an image by interpreting boundaries as 1-D surfaces and formulating a one-to-one vector transformation function. The paper provides theoretical justification of the vector transformation representation. Experimental results show the effectiveness on publicly available datasets.",
            "main_review": "Strengths\n1. Novelty\nThe paper proposes a novel idea of the surface representation of boundaries\n\n2. Theoretical justification/discussions\nThe paper shows theoretical justification and discussions.\n\n3. Experiments\nExperimental results support the effectiveness of the proposed method\n\nWeakness\n1. The paper does not show the limitation of the proposed method.\n",
            "summary_of_the_review": "The paper proposes a new method with careful theoretical justification. Experimental results support the effectiveness. The paper is well-organized. The paper is beneficial to the readers.\n",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "details_of_ethics_concerns": "No concern for ethical problems.",
            "recommendation": "8: accept, good paper",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "This paper is about learning-based edge detection. The authors proposed a new loss function for end-to-end edge detection to overcome the label imbalance and edge thickness problems. The loss function is based on the vector transform field, which is closely related to distance transform. The final edge map can be easily obtained by thresholding the divergence of the predicted vector transform field. The authors compared the proposed VT loss with the dice loss, the combination of dice loss and cross entropy loss, weighted cross entropy, and the distance transform based loss, on Cityscapes, Mapillary Vistas, Synthia, and BSDS500 datasets. The experiment results show the promising performance of the proposed VT loss on the edge detection task.",
            "main_review": "The writing is clear and easy to follow. The whole idea is simple and the result looks quite promising. The experiments seem sufficient.\n \nI have some concerns regarding the details:\n \n1 The authors proposed a \"simpler\" solution in inference. However, the implementation confused me somehow: The authors defined \\tilde{I} in eq. 6 as a support image. But I did not see how $\\tilde{I}$ was involved in the following computation. $\\tilde{I}$ disappeared in eq. 7 and 8. What is the input image to the network? $I$ or $\\tilde{I}$?\nI did not see the benefit of using this new approach to obtain the boundary image either. In fact, as the authors mentioned, we can simply use a 2x2 kernel, which is also very simple and clear.\n \n2 The authors discussed the drawbacks of the ODS and OIS metrics and proposed using asd series metrics in addiction. However, the authors did not mention the potential drawback of asd metrics: I think asd is very sensitive to prediction noise, especially in asd_P. Think about the predicted boundary map containing an outlier that is far from any groundtruth edge point. This simple noise point can contribute a lot to the final asd_P score.\n \n3 Using Dice Loss as a baseline is fine. The authors might also want to include more recent development on dice loss, for example, clDice loss:\n \nShit, Suprosanna, Johannes C. Paetzold, Anjany Sekuboyina, Ivan Ezhov, Alexander Unger, Andrey Zhylka, Josien PW Pluim, Ulrich Bauer, and Bjoern H. Menze. \"clDice-a Novel Topology-Preserving Loss Function for Tubular Structure Segmentation.\" CVPR. 2021.\n \nThe above method also claims the robustness against data imbalance and efficacy on topology preserving.\n \n4 I am a little surprised to see that DT performs much worse than the proposed VT method. I think they are pretty similar. I wonder how the authors determined the threshold for DT, which will determine the thickness of the edge? Why did the authors use L2 loss in VT while L1 in DT? Is L1 better for DT?\n \n5 I appreciate that the authors experimented on the BSDS500 dataset, a widely used dataset for edge detection evaluation. Though the proposed method did not achieve the top performance on this dataset, it would be great if the authors could have more insight into why WCL performs relatively better in this scenario. I also suggest moving this experiment from the supplementary material to the main script.",
            "summary_of_the_review": "Overall I think this is an OK paper. The VT representation of an edge map seems novel to me. I like the simple idea which works pretty well on several datasets. The implementation is straightforward without bells and whistles. However, I still have some concerns about the details including the support image, DT performance, etc.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This paper proposes treating boundaries as 1D surfaces using vector transformations in Equation (1). \nThe paper then proves a 1-to-1 relationship between the vector field representation and a binary boundary map. \nThe paper further learns the vector representation into an NN by using a variant of HR-Net that outputs a dense two-channel image with x and y component of the vector field and train it with Mean Sqaured Error loss. \nSince the predicted boundaries using this method can be infinitely thin, so the paper proposes using average surface distances to evalute the performance, and shows improved results of their method comparing against three other losses using the same NN architecture.",
            "main_review": "+ novel representation of boundaries inspired by classical implicit functions and combining it to a modern NN\n\n+ achieves thin boundaries which can be useful in many applications\n\n- The neural network architecture and training details are not very clear. The paper mentions HRNet is used with some skip connections and conv layers added, but in my opinion it is very difficult to reproduce the authors' experiments given the current manuscript. \n\n- Only one backbone architecture is tested for all losses, and Vector Transform only outperforms others in some but not all metrics as shown in Tables 3 and 4. It is not convincing that the vector transform representation can be useful and outperform the binary representation in practice",
            "summary_of_the_review": "The paper takes a first-principles approach to thin boundary estimation. The novelty outweighs the concerns mentioned. The paper is worth known to the community.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        }
    ]
}