{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Accept (Poster)",
        "comment": "All reviewers agree that the presented ADA-Nets approach is very interesting and sufficiently novel, addressing the degradation problem in face clustering. The reviewers are satisfied with the presented experimental studies in most cases. The rebuttal addressed a large majority of additionally raised questions. I disagree with one reviewer’s comment – that the focus of the paper is too narrow – because clustering techniques are of great interest to the ICLR community. I believe that the paper will be of interest to the audience attending ICLR and would recommend a presentation of the work as a poster."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "In order to address the problem that face clustering is often degraded by noise edges in similarity graph, this paper proposes Ada-NETS by constructing clean graphs for GCNs. In Ada-NETS, each face is transformed to a new structure space, obtaining robust features by considering face features of the neighbour images. Then, an adaptive neighbour discovery strategy is proposed to determine a proper number of edges connecting to each face image. Experiments on multiple public clustering datasets show that Ada-NETS significantly outperforms current state-of-the-art methods.",
            "main_review": "strengths:\n1. The paper is easy to follow;\n2. Experimental results are good.\nweaknesses:\n1. The novelty of the proposed method is limited. Both of the Eq. (2), Eq. (3) and the GCN structure are previously proposed, this paper just combines them to obtain better results;\n2. Since the task of this paper is clustering, which is an unsupervised task. However, but in Eq. (3), sample labels are used to calculate quality criterion Q, which is not clear.\n3. The adaptive neighbour discovery and GCN are two seperated processes in current propose method. Therefore, any other graph optimization method can be used before the GCN process. The authors should conduct experiments to validate the efficacy of the proposed adaptive graph construction.",
            "summary_of_the_review": "Novelty is limited and some motivations are not clear.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "Yes, Privacy, security and safety"
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        },
        {
            "summary_of_the_paper": "This paper proposes a new face clustering algorithm that significantly improves the past state-of-the-art GCN, which generates many noise edges that are harmful to clustering performance. The paper focuses on the noise edges in face clustering fields and proposes Adaptive Neighbour discovEry in the strucTure Space (Ada-NETS). In Ada-NETS, a 'structure space' is presented to obtain robust face features by encoding more texture information reflecting the data distribution. Then, a candidate neighbor quality criterion is presented to build less-noisy edges, along with a learnable adaptive filter to learn this criterion. Finally, the algorithm's effectiveness is validated by measuring the performance on various data domains: face, person, and clothes, with a large margin.\n\nTechnically, \n\n(1) The paper strengthens the credibility of the edge between vertices by applying the Jaccard similarity of the two vertices proposed by Zhong et al., 2017, with widely used cosine similarity. \n\n(2) To design adaptive neighbor discovery, they first define a quality criterion reflecting the two quality factors: cleanness and information abundance (rich) of the graph.\n\n(3)  Using top-k quality criterion vertices as gt, adaptive filter defined by bidirectional lstm and fully connected layers is trained to predict a future quality estimate to remove or add the neighbors.",
            "main_review": "**StrongPoints**\n\n(1) In the reviewer's perspective, the proposed design is well organized to enhance the clustering performance.\n\n(2) The datasets, MS1M, deep-fashion, and MSMT17, used in the experiments are large and realistic. \n\n(3) The experimental results in Table 1 show the method's superiority compared to current state-of-the-art methods.\n\n(4) Table three to six provides analyses on each proposion of the paper, which is well organized.\n\n\n**WeakPoints**\n\nFirst, note that the reviewer is positive about this work, and this section is much like questions rather than criticism.\n\n(1) It seems that the results in Table 1 would be governed by the expression power of the face feature v. The reviewer might miss and thank the author in advance for the clarification of the feature extraction process for the experiment. Similar to the other datasets in the experiment.\n\n(2) Also, since it is possible to access face features with various representation powers, the reviewer wants to see the tendency between face recognition performance and face clustering. For example, if the user uses powerful recognition features or vice versa, how does the effect of the proposed contribution change? It would be nice to refer to the webpage here: https://github.com/deepinsight/insightface/tree/master/model_zoo.\n\n(3) Does the author have a plan to open the source code of the paper? It would be helpful for all the researchers in this field.\n\n\n**Overall**\n\nThe reviewer is positive about the paper. Unless some critical issues during the reviewing process occur (such as missing very important s-o-t-a methods), and if detailed comments of the authors are provided, the reviewer thinks the paper is worth publishing in this stage.\n\n\n**Post Rebuttal**\nThank you for the rebuttal. The reviewer is satisfied with the feature extraction process and experiments on features with various recognition performances. It seems that the numbers in the Tables show the feature robustness of the proposed Ada-NETS. Overall the reviewer is positive for the usefulness of the method and will keep the current rating (accept. Good paper).\n",
            "summary_of_the_review": "See the section above.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This paper proposes a new way of constructing a graph for Graph Convolutional Networks (GCNs) for face clustering that is claimed to alleviate the problem of having a significant amount of noisy edges in the graph as in previous methods for face clustering. Their method consists of two innovations: firstly, facial features are transformed to a structured space which improevs the accuracy of facial similarity metrics. Secondly, an method which finds the neighbours of each face is proposed based on a heuristic quality criterion. Once the graph is built the authors apply existing algorithms for GCNs.",
            "main_review": "There a two main issues with the paper: The first one is the limited amount of technical contribution for a high quality venue like ICLR. The authors put a lot of existing techniques together to build their algorithm but overall the proposed combination as a whole does not constitute a significant and widely applicable contribution to the field that might be of interest to the ICLR community. Secondly, the application domain is primarily limited to faces which is very specific application domain. On the positive side the experiments show promising performance and ablation studies present interesting results. I believe that CVPR is a much better fit for this paper where the contribution and application domain will be much more appreciated by the corresponding community.\n\n**After Rebuttal:** I would like to thank the reviewers for their response. Unfortunately, I still believe that the paper's focus (face clustering) is too narrow for ICLR and that the novelty is limited as a number of existing techniques are put together to solve a very domain-specific problem.",
            "summary_of_the_review": "A decent paper with good amount of novelty for a computer vision conference where faces are particularly studied but of limited novelty and interest for the ICLR community. ",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This paper proposes a novel algorithm named Ada-NETS to alleviate the noise edges problem when building a graph on face images, thus improve GCNs to boost face clustering performance. \nStrengths:\n1) This is the first paper to address the noise edges problem when building a graph for GCNs on face images.\n2) The proposed Ada-NETS achieves state-of-the-art performances on multiple public datasets. And the experimentation is vert sufficient.\nweaknesses:\nThe author chooses F-beta-score as the candidate neighbors quality criterion, which seems to be a little bit heuristic. It is expected to explain the motivation of this design and demonstrate its superiority over other quality criterions.",
            "main_review": "The paper provides a new perspective to boost the performance of GCN-based face clustering methods.\nIn summary, the novelty is good and experimental result seems promising.\nBut the experimental evaluation needs more explaination and  extension.",
            "summary_of_the_review": "The experimental evaluation is unsatisfatory.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "details_of_ethics_concerns": "None",
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        }
    ]
}