{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Accept (Poster)",
        "comment": "The paper considers model-based RL, and focuses on approaches that benefit from the differentiability of the model in order to compute the policy gradient. It theoretically shows that the error in the gradient of the model w.r.t. its input appears in an upper bound of the error in the policy gradient computing using the learned model. Motivated by this, it suggests a MBRL approach that learns two models, one of them minimizes the next-state prediction error (as commonly done) and the other minimizes a combination of prediction error and the gradient error. \nThe paper empirically studies the method through extensive experiments.\n\nReviewers are generally positive about this work. They believe that the paper is insightful and the method is original. At first, there were some important concerns raised by the reviewers, but the authors revised their paper in the discussion period, and it appears that the reviewers are all satisfied now. I also read the paper during the rebuttal phase, and I should say that I have some concerns myself, especially on the theory part of the paper. Given that the authors did not have an opportunity to answer my questions, I do not put much weight on my concerns (and I believe most of them can be addressed with some clarifications). Considering the positive response of reviewers and promising results, I am going to recommend **acceptance** of this paper.\n\nI strongly encourage the authors to consider the comments by reviewers, as well as the following ones, in the revision of their paper.\n\n\n**Comments**\n\n1) The true dynamics $f$ is defined as a stochastic one, i.e., $s_{t+1} = f(s_t, a_t, \\epsilon_t)$ (just before Eq. 1), and similarly for the learned model. Here $\\epsilon_t$ is the noise causing the stochasticity of the model. But later, when the errors on the model and its gradient are introduced (i.e., $\\epsilon_f$ and $\\epsilon_f^g$), the role of stochasticity becomes unclear.\nFor example, we have\n$\\|| \\tilde{f}(s,a) - f(s,a) \\||  \\leq \\epsilon_f$.\n\nWhat happened to the noise term?\n\nThe same is true for Eq. (5). The next-state s' (either according to the true dynamics or the learned model) is random. In that case, it is not obvious how to interpret Eq. (5). Is it the error of the expected gradient of the next state? Or is it something else?\n\nIn case the dynamics is assumed to be deterministic, this should be clarified early in the paper.\n\n2) The upper bound in Theorem 1 might be vacuous if the Lipschitz constant $L_f$ of the model is larger than 1.\nTo see this, consider Lemma 1. The constant $C_0$ is $\\min [D/\\epsilon_f, (1-L_f^{t+1})/(1 - L_f)]$.\nIf $L_f$ is larger than 1, for large enough t, the term $(1-L_f^{t+1})/(1 - L_f)$ blows up and $C_0$ becomes $D/\\epsilon_f$. Therefore, the upper bound of Lemma 1 becomes $D$. Here $D$ is the diameter of the state space, which is assumed to be bounded.\n\nThis carries to in the next lemmas. In Lemma 4, $C_5$ would be of the same order as $C_0$ (multiplied by an extra $L_1 L_f / (1 - \\gamma) )$, so the upper bound of this lemma becomes proportional to D too.\n\nThe $C_0$'s appearance continues in the proof of Theorem 1, in which $C_8$ is proportional to $C_0$ and $C_5$. So, $C_8$ is also become proportional to $D/\\epsilon_f$. When we have $C_8 \\epsilon_f$ in Eq. (34), we get a constant term $D$.\nA similar dependence appears in the proof of Theorem 2, where B_3 is proportional to $C_8 \\epsilon_f$, which can be as large as $D$. And in Eq. (47), we have $B_3^2$. So the upper bound in Eq. (47), which seems to the be upper bound of Theorem 2, is proportional to $D^2$. This means that if $L_f$ is larger than one, the upper bound does not go to zero, no matter how small the model error $\\epsilon_f$ is (unless it is actually zero). This makes the bound meaningless.\n\nThis might be unavoidable. I am not sure about it at the moment. But it definitely requires a discussion.\n\n3) Assumption 2 has a term in the form of $E[\\frac{s_{t_2}}{ s_{t_1}} ]$ (I have simplified the form). The states $s_{t_2}$ and $s_{t_1}$ are vectors in general. How is the division defined here?\n\n4) Please improve the clarify of the proofs. For example, in Lemma 2 it seems that a negative sign is missing in Eq. (49). Also how do we get Eq. (50) and Eq. (52)? (I couldn't easily verify them).\n\n5) I believe the \"periodicity property\" used in Assumption 1 should be \"ergodicity property\".\n\n6) The paper still has a lot of typos, e.g., \"To optimize the objective, One can ...\" (P3), \"argument data\" (instead of augmented) (p4), \"Superpose\" (p5), \"funcrion\" (p6)."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "This paper considers learning a model for reinforcement learning and proposes to also learn the gradients of the model in addition to just the predictions. They approximate the model gradient using the nearest samples from the replay buffer in (12) to learn the model gradient (13), which they use to replace the model gradients in the value expansion in (14). They evaluate on MuJoCo environments (Fig 1) and show some key ablations (Fig 3) on the number of samples used for the gradient estimates, and the weight term in (12), and combined/separate models.",
            "main_review": "I like the insight that method can use the model's predictions and gradients and thus we should be aware of model gradient errors. However in practice, we do not know the gradients on the trajectories that we attain and equation (12) requires computing the n-nearest points of $x$ in the replay buffer to estimate the model gradient. This seems potentially intractable in practice for large replay buffers, and seems like it will not always coincide with the true model gradient if the buffer is sparsely filled. Is the scalability here the reason why the methods were not run for more timesteps?\n\nThe experimental results in Figure 1 show the sample efficiency and show an improvement over the relevant baselines, using 5 trials. The most relevant baseline here is to MAAC, as Eq 14 is set up very similarly. I especially like the ablation in Figure 3(right)/Figure 4 that ablates against the model not using the separate gradients.\n\nOne slight concern I have here is that **some of the empirical gain may come from modifying the base model-based algorithm rather than adding the gradient information.** I see the value being optimized in Eq 14 as nearly identical to the one optimized in MAAC (S4.1 there), but some of the baseline results (without the gradient loss) in Figure 4 are better than the MAAC baseline in Figure 1 (especially the cheetah/humanoid).\n\nMy largest concern with the paper is that the end of Section 5.1 says that the results of ~5k reward attain \"near-optimal policies in the Humanoid environment\" (for running) despite papers such as the [SAC-SVG](https://arxiv.org/abs/2008.12775) attaining a reward of ~9-10k in the same environment. This paper does not provide a video of the learned policy, and furthermore, it is possible for the humanoid agent to remain stationary (i.e. standing still) the entire episode and attain a reward of 5k (because the [base alive bonus is 5 reward/timestep](https://github.com/openai/gym/blob/bb81e141ea7ae67ce339109095841592e8231185/gym/envs/mujoco/humanoid.py#L34) and the episode runs for a maximum length of 1000 timesteps.) **I think this is extremely misleading and should not be accepted for publication.** I request for the authors to clarify this point and provide a video of the agent learned on this task. I am very willing to further discuss this point and increase my score on this paper if this is properly addressed.",
            "summary_of_the_review": "This is an insightful paper on modeling the gradients that contains an extensive empirical evaluation. My main concern is in the presentation of the humanoid results.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This paper seeks to improve performance of model-based policy optimization methods by taking advantage of the world-model's differentiability. It starts by showing theoretically that error in estimating the model's gradient contributes to bias in the learned policy. The paper then proposes directly optimizing the jacobian of the world model using a sample-based strategy in order to directly control this bias term.",
            "main_review": "I am recommending to accept this paper because its algorithm construction is well-reasoned, the theory appears to be novel and provides appropriate support for the proposed algorithm, and the empirical results provide some minor support for the claims. Overall, I find that this paper contributes an important perspective on the role of using differentiable models, and the need to control the error of first-order information (gradient model) instead of only zeroth-order information (prediction model) when using differentiable models.\n\nI remain on the fence, however, because (W1) the empirical results provide only marginal support for the proposed algorithm and (W2) there is a disconnect between the paper's stated goals and the novelty the paper _actually_ provides, leading to neither being done particularly well.\n\n---\n\n**Details for W1:**\n\n While the proposed algorithm is the only algorithm to consistently perform well across all 6 benchmark domains, the paper does not provide sufficient information about the baselines to understand if this experiment is fair. A couple of immediate concerns come to mind:\n\n1. How are the hyperparameters selected for the baseline algorithms?\n2. Because some baselines are model-based, some are model-free, and many baselines use a different number of models, is the comparison between baselines fair in terms of compute usage and number of free parameters? The proposed algorithm uses an additional model to encode the world model gradient, suggesting that it has more learnable parameters than any other baseline. Do these extra parameters account for the performance difference alone, or is the performance difference actually due to decreased bias in the policy gradient?\n\nThe use of only 5 random seeds is also concerning, especially considering the very high variance exhibited in many of the reported results. Are any of these results statistically significant? Do any statistical significance tests allow for the use of 5 samples? Does this imply that the reported results could simply be due to random chance?\n\n**Details for W2:**\n\nLargely due to the empirical concerns stated above, it seems very challenging to support the claim that the proposed algorithm achieves state-of-the-art results. Consider additionally that only a small subset of the standard Mujoco domains are used significantly limits the scope of the SOTA claims that can be made. Proposing a novel algorithm which uses another NN-worth of free parameters over baselines, then claiming SOTA does beg the question whether SOTA was achieved only through more parameters.\n\nHowever, I think the real value provided by this paper is further insight into the need to control the gradient error when using differentiable models. The paper performs two interesting ablation studies, one showing that the proposed algorithm does successfully control this error term, and the other showing the impact of controlling this error on the overall performance. However, neither of these ablations are complete; especially the second. \n\nFigure 3 shows that adding the gradient loss term to control this bias has negligible impact on the performance of the proposed algorithm across all three manipulations (number of directional derivatives sampled, different weightings for the added loss term, and different methods of controlling the gradient error). Considering further that two of the six domains were cherry-picked for reporting in the main body of the paper, suggests a post-hoc maximization bias occurred while selecting these results as well. In order to well-support the theory proposed in this paper, I believe the most important set of experiments is actually the ablations. These should be significantly expanded and further insights should be drawn about the role of controlling the gradient error term. In order to make room for this expansion, the SOTA experiments can be largely treated as a demonstration that the proposed method scales well and is competitive, with considerably less focus placed on Figure 1.",
            "summary_of_the_review": "**Edit during discussion phase:**\n\nI have increased my overall score from 6 -> 8 based on the ongoing discussion. I have also increased my \"empirical novelty\" score from 2 -> 3 because I believe the new ablations and clarifications yield deeper insight into the impact of using first-order information to constrain transition models in RL.\n\n---\n\n(Copied from above Main Review)\n\nI am recommending to accept this paper because its algorithm construction is well-reasoned, the theory appears to be novel and provides appropriate support for the proposed algorithm, and the empirical results provide some minor support for the claims. Overall, I find that this paper contributes an important perspective on the role of using differentiable models, and the need to control the error of first-order information (gradient model) instead of only zeroth-order information (prediction model) when using differentiable models.\n\nI remain on the fence, however, because (W1) the empirical results provide only marginal support for the proposed algorithm and (W2) there is a disconnect between the paper's stated goals and the novelty the paper _actually_ provides, leading to neither being done particularly well.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "The authors present a new approach for model-based reinforcement learning by training two models and using them separately. One model prioritizes accurate transitions and another has a weighting term for value-gradient, which they combine in a new algorithm directional derivative projection policy optimization.\n",
            "main_review": "## UPDATE DURING REBUTTAL\n\nTo AC & reviewers & authors - I think the authors did make substantial improvements to the paper and it is now easier to understand. Given the prevalence of this problem in MBRL I do think this is a contribution to help the field understand how best to learn dynamics models for control. Though, the empirical questions make my recommendation very borderline. My idea is that it is closer to a weak accept now, but it will be hard to fight for this paper's acceptance without a little more understanding of why it works.\n\n## General Comments\n- **technical merit**: the core idea the authors to improve model-based reinforcement learning are well motivated. The proposed solution is interesting and novel. Though, they seem to not be citing a core paper motivating their work: Lambert, Nathan, et al. \"Objective Mismatch in Model-based Reinforcement Learning.\" Learning for Dynamics and Control. PMLR, 2020. \n- **experimental quality**: the numerical results are impressive, but I don't see enough explanation or intuitions for them. Especially when continuing to browse the ablations in the appendix, I think the experiments need to be presented with more understanding for the results to be reproduced.\n- **writing quality**: the writing of this paper could be substantially improved. The writing has many typos and the structure is not very clear.\n- In a couple reads I never understood the part on the directional derivative as a scalar. Can the authors help me understand this? I acknowledge this may be common background that I am missing, so it may be a useful addition to the appendix.\n- If combining the proofs with DDPPO is too difficult, maybe this should be two separate papers.\n\n## Comments By Section(s)\n\n### 1 Introduction\n- This section was a bit too broad, which made it hard to get the point of the paper across. The author's do not need to describe everything about RL here or the history of MBRL (related works do that, and end up being repetitive)\n- This sentence is crucial, but both worded weirdly and not emphasized enough in the section \"Note that there is a big difference between these methods ... when calculating the policy gradient in these methods\"\n- The paper could do better at clarifying the contributions of the mathematics and the algorithm. The authors discuss a method and then a new algorithm. Maybe this can be combined into one point, but it is hard to follow and see where the authors are going. The contributions help this, but by that point there are more questions than answers.\n- the second half is very repetitive. Trimming this will make the paper easier to follow and add space to other sections that need it. \n\n### 2 Preliminaries\n- The paragraph introducing equation 4 is confusing. If it is a \"preliminary\", which paper should I look at to know more? Please cite that so I can learn it / follow the paper.\n\n### 3 Related Works\n- This paper could be good to include in the related works. Kégl, Balázs, Gabriel Hurtado, and Albert Thomas. \"Model-based micro-data reinforcement learning: what are the crucial model properties and which model to choose?.\" ICLR 2021.\n- the formatting here is really forced and deteriorates the reading experience.\n- The related works seem dismissive of the past work. It is clear this paper is different, but why are past works important?\n\n### 4 Model-based Policy Optimization by Considering the Model Gradient Error\n\n#### 4.1 CONVERGENCE RATE FOR MODEL-BASED POLICY OPTIMIZATION\n- in the intro, this sentence makes me think there will be a general explanation of how this can be used for algorithms, but it seems to be lacking \"for the policy optimization algorithms in what the policy gradient is calculated using the learned environment model\"\n- This section needs substantially more explanation to support the math. Some assumptions can be moved to the appendix unless it is explained in the text why they are crucial and new. \n- Are there related works that hint to these formulations? They are big step and hard for me to follow. Knowing this, the authors should spend more time making them \"land\". \n- I think there is a typo in the remark after theorem 2 -- the learning rate alpha_t should be 1/sqrt(T) rather than sqrt(t)?\n\n#### 4.2 TWO-MODEL-BASED LEARNING POLICY OPTIMIZATION\n- very repetitive. Can remove some here or in intro.\n\n#### 4.3 DIRECTIONAL DERIVATIVE PROJECTION POLICY OPTIMIZATION: A PRACTICAL IMPLEMENTATION\n- I believe fairly strongly the algorithm should be in the main body of the paper, as it is sufficiently different from past. work. \n- Otherwise, a lot of this section is again repetitive. Please separate the repeated parts of the paper to where they should be. Intro is for framing, preliminaries for background / common math, and the new stuff in your method :). For example, training a model with MSE / MLE is described multiple times and can be done with only a citation.\n- this sentence is interesting and potentially crucial to the result \"So in this paper, we sample the nearest n data points of x to calculate n directional derivatives in n different directions and use the finite difference to co\". It would be interesting to hear more intuition on why this works.\n- Figure 1 says \"trials\" - how many each, and how many for other algorithms?\n- A system diagram could make it clearer how the algorithm works.\n\n### 5 Experiments\n- Figure 2 seems to be in too simple of environments to validate the claims totally. The strong performance of humanoid is a big piece of the results, how do these intuitions translate to higher dimensional tasks?\n- What happens if the gradient model is used for state rollouts? This could be an interesting way to address the objective mismatch issue.\n- which implementation is used for the compared algorithms? \n\n- Why were Hopper and Ant chosen for Figure 3? Were these sweeps tried on other environments? Are the results consistent. At least commenting on these lines and or why the trends would break down are important to people considering using the method.\n- Hard to tell if the two model part is needed by the results? The impressive humanoid results are diluted by me when considering it's not the key variables the author's propose contributing to success. Why is there little gain from the gradient-trained model when adding the accuracy model? The labels on figure 4/5 could be more precise. One model is not the most clear.\n\n----\n\n## Grammatical comments / nits\n- abstract \"We\" -> we\n- intro weird phrasings \"decision-making problem is always formulated as\", \"agent uses policy to determine\" -> determines, \"the rollout-based model-based methods that the model gradient is crucial\" -> where the model gradient is..., \"we can see that the transition and reward model gradient matter in\"\n- intro confusing \"Therefore, we propose to separate different requirements for the model into different models\"\n- \"w.r.t\" missing period before eqn. 3\n- \"the expectation is taking over\" -> \"taken over\" after eqn. 3\n- related works \"policy gradient to re-weighted... re-weighted\" weird, also missing period at the end of this sentence ... \"sample Use the learned\"\n- section 4 \"that using the policy gradient\" that are using?\n- should use latex references for section names, referred to \"Preliminary section\" many times with different capitalization. \n- wrong \" in 4.1 \"tilde\" notation, \"hat\"\n- theorem 2 remark: \"gradient method converge to its...\" -> converges \n- in 4.2 \"between collecting samples from the environment, training the model, and optimize the policy\" --> optimizing\n- in 4.3 \"Hence in this paper, we use the error between the estimated directional derivative and the projection value to constraint the learned model’s gradient\" --> constrain\n- \"Model Usage\" section: \"we use the objective function that constructed by following\" --> is constructed, \" , \" space before comma later\n\n----\n## Other comments / ideas (not included in scoring of paper)\n- in the appendix, the authors include hyper parameters. Do you all have an intuition for why the higher dimensional tasks need fewer neighbor points, H, to calculate the derivative? As the density drops, I thought more points may be needed?\n- There is a really interesting correlation in figures 4 and 5 in the appendix that is not explained, but could be a great intuition to support the paper. The environments where the one-model approach fails to perform as well seem like they could have a bigger difference in the model errors? I am looking at the Hopper env in figure 4 and 5. Though, the ant does not back this up as much.\n",
            "summary_of_the_review": "The paper proposes a novel solution to a well known problem in model-based RL. Though, the paper is not well written so it is hard to follow, even for an expert in the area. In its current state, I do not recommend acceptance because of its writing / presentation / lack of conveyed intuition, but these are problems that can be fixed in a moderate revision.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "Many recent model-based reinforcement learning algorithms exploit the differentiability of the learned model by computing gradients through it. Nonetheless, the standard approach for model learning is to minimize a loss on the prediction of the next environment state which, when the underlying dynamics is complex, does not guarantee that also the resulting gradient information will be accurate. The paper proposes a method for model learning which explicitly tries to estimate the Jacobians of the underlying dynamics, by leveraging a loss function on the directional derivative and a nearest neighbour approximation. Additionally, the paper proposes to use a model learned with a combination of this new loss and a prediction loss for backpropagation only, while training a traditional model for the generation of trajectories.",
            "main_review": "**Originality:** The method presented is quite original and well-positioned among existing methods for model learning.\n\n**Significance:** The problem in object is of interest for the RL community.\n\n**Rigour:** The theoretical results are not of particular benefit for the practical algorithm. The theoretical results and experimental protocols seem sound, although the core change proposed by the method does not provide very large improvements over baselines.\n\n**Strengths**\n\n- Directly learning the Jacobians of the dynamics is a very appealing goal, given the resurgence in popularity of value gradient methods (i.e., methods which compute the policy gradient by direct differentiation through a learned model).\n- The presented approach is well-positioned in the literature as a *decision-aware* approach for model learning.\n- The theoretical results presented in Section 4, despite not being novel in essence, are quite interesting.\n- Both the proposed loss function for model learning and the idea of having two models for trajectory generation and gradient computation are, as far as I know, new and simple to implement.\n\n**Major Concerns**\n\n- The loss function in Equation 12 requires to select the nearest neighbours of the current data point. With the usual implementation for the replay buffer, this adds a significant computational burden to the already expensive model-based policy optimization algorithm. Is the method directly facing this issue? What is the actual computational complexity of the algorithm?\n- It seems, especially from Figure 4 in Appendix, that a large part of the additional performance of the proposed method comes from the two-models component and not from the gradient learning one. Moreover, there is the risk that much of the improvement provided by the use of two models actually comes from the additional capacity. A good experiment should control for the number of parameters to check whether the performance boost only comes from the additional parameters, and not the particular architecture in use. Thus, I would have expected to see an experiment in which the number of parameters used by the two models in total is the same as the one used by the baseline with a model alone.\n- To double check more robustly whether the proposed objective for gradient estimation is effective per se, it would be extremely beneficial to have a simple, independent, experiment, in a supervised learning problem.\n- The mechanism used for backpropagating through a model after generating a trajectory from another one is unclear. To the best of my knowledge, the only technique for achieving something similar while using stochastic models is the one used in SVG (Heess et al., 2015) to differentiate through trajectories of real experience via reparameterization. This should be clearly explained in the paper.\n- In Figure 3, a more appropriate baseline to show should be MAAC, which seems to be the core algorithm upon which the approach is based, given its backpropagation through the learned model.\n\n**Minor Concerns**\n\n- I believe it would be more clear to state the assumptions before stating the two theoretical results, e.g., in the background section.\n- It could be beneficial to explain the loss function in Equation 12 in terms of a Taylor approximation: the learned model should have a gradient such that its first-order approximation is consistent with the given data. Is this a valid interpretation?\n- Section 4 should contain an explanation of why the gradient loss in Equation 12 alone would be insufficient for training a model. Are both of them used to avoid degenerate solutions only, or is there a deeper motivation?",
            "summary_of_the_review": "There are some issues in the experimental results and in the justification of some moving parts of the algorithm, but the paper proposes a simple and seemingly sound solution for a very important problem in model-based reinforcement learning. I thus lean towards recommending to accept it.\n\n---\nThe authors addressed my main concerns. Thus, I now recommend acceptance.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        }
    ]
}