{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Accept (Poster)",
        "comment": "This paper studies the problem of how to use 3D molecular geometry information during training to improve performance during prediction time when 3D information is not available. This is a highly interesting problem as obtaining 3D molecular geometry information requires expensive calculations and such information is usually not available in practice during prediction, while there are some training data with both 2D and 3D information. The work proposes to use self-supervised, predictive and generative approaches to make use of such information. The reviewers overall expressed mixed recommendations. One of the reviewers who scored 5 did not provide further feedback after author response even being prompted multiple times. The other reviewer who scored 5 actively participated in discussion and it seems most of the concerns have been addressed. Given the importance of this problem, and this work seems to be among the first to address this problem, I lean toward accept."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "The manuscript proposes a method for molecular graph representation learning by combing graph topological structure with 3D geometric information. ",
            "main_review": "For molecular structure, it is natural and necessary to consider 3D geometry information together with graph structure. This would be a great direction to explore. The proposed method makes sense.\n\n My concern is the experimental part where only molecular property prediction has been discussed. It would be necessary to illustrate the proposed graph and 3D geometry method can indeed improve reconstruction and generation for molecular data by comparing with other state-of-the-art graph-based methods. ",
            "summary_of_the_review": "I like the proposed idea. However, some experiments on reconstitution and generation would better illustrative the improvements using the proposed method. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This paper presents a pre-training method of GNNs for molecular graphs by self-supervised learning (SSL) on not only 2D topologies of graphs but also 3D geometries of molecules.  In particular, the paper develops two SSL pretext tasks learning inter-molecule and intra-molecule associations in 2D and 3D. The \"inter-molecule\" task is a graph classification on whether a 2D, 3D graph pairs come from the same molecule or not, while the \"intra-molecule\" task is a generative task to generate 2D from 3D as well as 3D from 2D information. Empirical evaluations over several datasets demonstrate that jointly learning these two SSL tasks brings nice improvement in prediction accuracies.",
            "main_review": "The paper is well written and easy to follow. The focused problem of taking into account 3D information in GNN pretraining is also very interesting and important. The idea sounds interesting, but at the same time, a big question on how to handle \"conformer ensemble\" seems not well addressed. 3D information is not unique for a single molecule, and this would be the main difficulty why past work didn't take into account it well. For now, it would be a bit unconvincing that this method worked as intended.\n\nSo a big natural question is how this method could handle multiple 3D poses of a molecule. Just all of the possible 3D conformers fed into learning by data augmentation? As the paper also mentioned, \"the molecular properties are a function of the conformer ensembles\", and 3D information is not unique for a given molecule. But it is unclear how to address this ensemble problem. In theory, a molecule has infinitely many 3D shapes in most cases, because any single carbon-carbon bond can be rotated to any degree. We can continuously rotate every C-C bond to produce massive sets of 3D geometries? How to handle them? Or pick up locally energy-stable ones in some ways...? This point seems to remain unclear. Also, the datasets in experiments mainly come from tasks predicting the bioactivities of molecules, and molecules would have a huge degree of such degrees, as well as actual 3D shape in action, might be determined by other interacting molecules (such as target proteins) and also statistical-mechanically fluctuated continuously, and so it would be unconvincing that learning only a few of stable 3D conformations is sufficient.\n\nFor your interest: Bio QSAR tasks would require some handling of the combinatorial multiplicity of 3D conformations of a molecule when we try to include 3D information (typically by docking simulations or something?). I guess that's why (2D) GNNs are sufficient usually. We can ignore complicated problems by continuous/statistical-mechannical 3D confomations and their dynamics and abstract a molecule as a graph (dots and lines) to see statistical trends. This method might be good for a quantum chemical task like QM9 where we are trying to predict the energy (or properties) of a molecule with a specified 3D conformation (an energetically stable structure).\n\n",
            "summary_of_the_review": "The paper is well written and easy to follow. It provides interesting and effective pretraining methods for GNNs. However, it is still not clear how to handle the combinatorial multiplicity of 3D molecular information in a principled way even though we can observe empirical improvement in prediction accuracies by this pretraining in a limited set of datasets.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This work aims to leverage additional 3D geometric information for molecular graph representation learning and proposes a multi-view pre-training framework, GraphMVP. Specifically, in GraphMVP, both 2D and 3D information are used, and a combined loss function (i.e., the combination of contrastive self-supervised learning loss and generative self-supervised learning loss ) is adopted to enhance the quality of representations. To verify the model's effectiveness, they conducted experiments and comparisons on a number of datasets. Ablation studies are also carried out to inspect the inner workings of GraphMVP.",
            "main_review": "The strengths are :\n1. The idea of using 3D information to augment the 2D graph representation learning is interesting and novel. Indeed, 3D geometric information is useful and provides a complementary view of the data, as evidenced in existing works such as protein classification. \n2. Fusing contrastive and generative losses can empirically further improve the performances by providing both inter-data (local) and intra-data (global) viewpoints. \n3. Extensive experiments were conducted (e.g., two tasks, a number of recent baselines, and 14 datasets are involved). Via the experiments, we can see that the proposed method shows promising performances across various datasets. Some useful insights are given in the ablation study.\n4. The paper is well-written and easy to follow.\n\nYet, there are also some weaknesses:\n1. My major concern is the fairness of the comparison. I am afraid that the major improvement is brought by simply incorporating 3D information as additional features, which raises a question:  If other baseline methods have 3D information as additional features, will they perform better (or even better than GraphMVP)? If so, the contribution might be weakened.\n2. It seems that x and y notations are flipped. In preliminary sections, x denotes 2D and y denotes 3D; In the method section, x denotes 3D and y denotes 2D. This is a little bit confusing to readers.\n3. The improvements on some datasets seem to be marginal. More results analyses are required.\n\nMinor comments:\n1. Typo: and are different (page 4).\n2. The appendix can be condensed.\n\n",
            "summary_of_the_review": "This paper proposes integrating 3D geometric information to improve molecule graph representation learning. The idea is interesting and the experiments are comprehensive.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "This paper proposes to leverage 3D information to pretrain graph neural networks for learning molecular representations. To achieve this, contrastive and generative SSL strategies are developed accordingly. The empirical results on several datasets show that the improvements of this method over previous 2D graph pretraining methods are consistent and obvious.",
            "main_review": "\nThis paper proposed GraphMVP to pretrain molecular representations by using 3D information with SSL tasks. Overall, the motivation is strong, and the method is technically sound. My remaining concern is that the experiments could be more convincing by using large datasets and considering tasks that are more dependent on 3D information.\n\n#####Pros#####\n\n1. The intuition of using expensive 3D geometry information to pretrain molecular representation is convincing since (1) 3D geometry is essentially vital for molecular property and (2) it is usually unavailable for downstream tasks. Therefore, the motivation of this work is clear and strong.\n\n\n2. To achieve the pretraining with considering 3D information, this paper develops one generative and one contrastive SSL task. Although generative and contrastive SSL are widely studied in graph representation learning, extending them into considering both 2D and 3D inputs is non-trivial and well-tackled by this work. One example is that for the generative SSL task this work proposes to do the reconstruction in the latent space instead of data space, where considering reconstruction is much more complicated. This insight is interesting and novel.\n\n\n3. The ablation studies are extensive and well-presented. The writing and organization of this paper are great.\n\n#####Cons#####\n\n1. The main remaining concern for this paper is that the experiments could be more convincing. The current results are mostly on small datasets (See Table 8 in supplementary) and it is not clear that if the included tasks are highly related to 3D information. I suggest the authors to consider larger datasets and more convincing tasks. The recent OGB KDD Cup task (https://ogb.stanford.edu/kddcup2021/) could be a good candidate. The task is to predict the quantum chemical property, which is highly dependent on the 3D geometry.\n\n\n#####Questions#####\n\n1. In Section 3.1, it is mentioned that the contrastive SSL learns the distribution locally while the generative SSL learns the global distribution. This description is confusing to me. More explanations of this point should be considered.\n",
            "summary_of_the_review": "The current version of this paper is good and above the acceptance threshold. More convincing experiments could improve the quality a lot. Hence, I recommend a weak accept to the current version and will consider improving the score if the experiments could be improved significantly.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        }
    ]
}