{
    "Decision": {
        "decision": "Accept (Poster)",
        "comment": "The paper proposes a Bayesian approach for time-series regression when the explanatory time-series influences the response time-series with a time lag. The time lag is unknown and allowed to be non-stationary process. Reviewers have appreciated the significance of the problem and novelty of the proposed method, and also highlighted the importance of the application domain considered by the paper. ",
        "title": "Paper Decision"
    },
    "Reviews": [
        {
            "rating": "8: Accept",
            "experience_assessment": "I have published one or two papers in this area.",
            "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.",
            "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.",
            "title": "Official Blind Review #4",
            "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.",
            "review": "\nThis paper proposes a bayesian method, Dynamic Time Lag Regression (DTLR), to predict effect-data y from a cause x. \nWhile both, cause and effect, are time series (x = x(t) and y = y(t)), the cause is assumed to have influence on the effect via a time lag, y(x(t), t) = y(phi(t)) = y(t + g(x(t))). The novelity of the problem posed is that the time lag g(x(t)) is allowed to be non-stationary and supposed to be unknown. The authors outlie a a Bayesian approach. The likelihood of the cause-effect data is conidered used to optimize the regressors for a given, finite set of time lags and the probability of these time lags. This discussion is very brief and detailled derivations are given in the appendix. An accompanying stability analysis is performed. In the implementation a neural network-based approach is used, where in turns the parameters of the model are optimised by a typical gradient descent algorithm and afterwards the hyperparemeters are set to values determined by the parameters. The theoretical deviation is accompanied by practical expirements on synthetically generated data and (real) space weather data. The performance of the model is compared to the one of a prediction with a fixed time lag, which it in fact outperforms. On the space weather (solar wind) data the model is shown to outperform several state-of-the-art models. A codebase for an implementation done in the Scala language is given.\n\nThe paper presented provides a meaningful contribution to the field of time series analysis and Bayesian methods. The novelty of the problem imposed as well as the accompanying solution is outlined very clearly. The problem is well justified and the motivation is clearly given.\n\nI recommend to accept it, even though a few details could have been described more precisely.\n\n1. The definition of the time lag g(x(t)) could have been made more clearly, providing a few examples at this point could help to clarify these definitions here.\n2. For the synthetic data generation a justification would be helpfull in order to motivate the choice of the functions f and v. \n3. A chart with sample time series data (y) against the time would be helpful to better visualize the problem.\n "
        },
        {
            "experience_assessment": "I have read many papers in this area.",
            "rating": "6: Weak Accept",
            "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.",
            "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.",
            "title": "Official Blind Review #3",
            "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.",
            "review": "The paper is motivated by a specific application about the prediction of solar wind. It is a major threat to the modern world. Authors propose a new regression model called Dynamic Time-Lag Regression which is a special case for spatio-temporal data. For solving this regression problem, the authors use a standard Bayesian approach to fit the model. The analysis of saddle point in Section 3.2 is quite impressive and meaningful. Correspondingly, the practical DTLR algorithm iteratively updates the parameters and hyper-parameters. In experiments, it reveals that the proposed method improves the performance for this particular problem significantly. The application solved by authors is very important, and it is improved by the proposed method. However, the novelty of the work is not presented clearly.\n\nMain argument\n1.\tIt is not clear about the difference between the proposed regression model and others. In my knowledge, it is a quite normal model for spatio-temporal data.\n2.\tThe Bayesian approach and its practical algorithm are very common solutions. What is the highlighted content besides the linear stability analysis?\n\nFor the experiments, the following should be addressed.\n1.\tRMSE in Section 5usually stands for root mean square error. What does relative MSE mean?\n2.\tAuthors said, “After domain knowledge, the time-lag ranges from 2 to 5 days, segmented in six-hour segments.” Does the setting of segmentation have a significant effect?\n3.\tIt would be beneficial to empirically demonstrate the evidence for supporting the theory of avoiding saddle point by synthetic regression.\n\n"
        },
        {
            "experience_assessment": "I do not know much about this area.",
            "rating": "6: Weak Accept",
            "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.",
            "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.",
            "title": "Official Blind Review #1",
            "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.",
            "review": "The paper presents a new sequence to sequence regression problem in which every element of the input sequence contributes to the output sequence after an unknown delay. The setup is motivated by a problem in space weather that seeks to predict the solar wind from solar observations. \nA mixture of Gaussian-based model is proposed and a closed-form update for the maximum likelihood problem is derived in the paper. After providing extensive analysis for the alternating optimization of the parameters, the proposed model is tested in synthetic and real-world experiments, where it achieves state-of-the-art in solar wind prediction.\n\nThe approach of the paper to the problem is principled and it provides extensive theoretical and experimental results for further insight. Unfortunately, one of the main equations (equation 3) is difficult to parse due to its unclear notation and moving forward from that early point, I could not trust my interpretation of the presented model (to be more precise, use of subscript “t” for both x and y on the LHS, the summation index, and the probability space of p all use notations that I found confusing and problematic.)\n\nAs a separate note, early on, the paper argues against existing sequences to sequence models for this task due to their limitation in working with individual sentences. However, the paper proceeds to make a modeling assumption of the same sort which bounds the time lag. In light of this, I do think that transformer type models can be adapted to this setting, and in fact, an input dependent attention mechanism is ideal for combining the prediction of time-lag and the raw response in the output sequence. The expectation is for this type of model to perform well in the proposed setting. Could you please comment?  \n"
        },
        {
            "rating": "6: Weak Accept",
            "experience_assessment": "I do not know much about this area.",
            "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.",
            "review_assessment:_checking_correctness_of_experiments": "I did not assess the experiments.",
            "title": "Official Blind Review #2",
            "review_assessment:_thoroughness_in_paper_reading": "N/A",
            "review": "The topic is out of my scope. I talked to the PC about it, and the PC asked me to continue reviewing this paper. So I tried to understand this paper, and I found it is difficult for me. I am not sure if the writing is not good or for some other reasons. I read Section 2.1, and I thought the following description would discuss how to solve \\phi(t). Unfortunately, I did not find where \\phi(t) is mentioned in Section 2.2. Maybe, I misunderstood Section 2.2. \n\nI do not know how to rate this paper. To avoid killing a good paper, I rated this paper as Weak Accept, and leave the decision to other reviewers and the AC."
        }
    ]
}