{
    "Decision": {
        "metareview": "The paper proposes a discriminator dependent rejection sampling scheme for improving the quality of samples from a trained GAN. The paper is clearly written, presents an interesting idea and the authors extended and improved the experimental analyses as suggested by the reviewers.",
        "confidence": "4: The area chair is confident but not absolutely certain",
        "recommendation": "Accept (Poster)",
        "title": "Improving GANs by rejection sampling "
    },
    "Reviews": [
        {
            "title": "Good paper!",
            "review": "This paper proposes a rejection sampling algorithm for sampling from the GAN generator. Authors establish a very clear connection between the optimal GAN discriminator and the rejection sampling acceptance probability. Then they explain very clearly that in practice the connection is not exact, and propose a practical algorithm. \n\nExperimental results suggest that the proposed algorithm helps the increase the accuracy of the generator, measured in terms of inception score and Frechet inception distance. \n\nIt would be interesting though to see if the proposed algorithm buys anything over a trivial rejection scheme such as looking at the discriminator values and rejecting the samples if they fall below a certain threshold. This being said, I do understand that the proposed practical acceptance ratio in equation (8) is 'close' to the theoretically justified acceptance ratio. Since in practice the learnt discriminator is not exactly the ideal discriminator D*(x), I think it is super okay to add a constant and optimize it on a validation set. (Equation (7) is off anyways since in practice the things (e.g. the discriminator) are not ideal). But again, I do think it would make the paper much stronger to compare equation (8) with some other heuristic based rejection schemes.\n\n ",
            "rating": "7: Good paper, accept",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "Very well written paper, with excellent results, but experiments may be unfair, and a much simpler rejection scheme may work equally well.",
            "review": "his paper assumes that, in a GAN, the generator is not perfect and some information is left in the discriminator, so that it can be used to 'reject' some of the 'fake' examples produced by the generator.\n\nThe introduction, problem statement and justification for rejection sampling are excellent, with a level of clarity that makes it understandable by non expert readers, and a wittiness that makes the paper fun to read. I assume this work is novel: the reviewer is more an expert in rejection than in GANs, and is aware how few publications rely on rejection.\n\nHowever, the authors fail to compare their algorithm to a much simpler rejection scheme, and a revised version should discuss this issue.\nLet's jump to equation (8): compared to a simple use of the dicriminator for rejection, it adds the term under the log.\nThe basic rejection equation would read F(x) = D*(x) - gamma and one would adjust the threshold gamma to obtain the desired operating point. I am wondering why no comparison is provided with basic rejection? \n\nLet me try to understand the Gaussian mixture experiment, as the description is ambiguous:\n- GAN setting: 10K examples are generated and reported in figure 3?\n- DRS setting: 10K examples are generated, and submitted to algorithm in figure 1. For each batch, a line search sets gamma so that 95% of the examples are accepted. Thus only 9.5K are reported in figure 3.\n- What about basic rejection using F(x) = D*(x) - gamma: how does it compare to DRS at the same 95% accept?\n\nIf this is my understanding, then the comparison in Figure 3 in unfair, as DRS is allowed to pick and choose.\nFor completeness, basic rejection should also be added.\n\nGoing back to Eq.(8), one realizes that the difference between DRS rejection and basic rejection may be negligible.\nFirst order Taylor expansion of log(1-x) that would apply to the case where the rejection probability is small yields:\nF(x) = (D*(x) - D*_M) + exp(D*(x) - D*_M) \n\nx+ exp(x) is monotonous, so thresholding over it is the same as thresholding over x: back to basic rejection!",
            "rating": "6: Marginally above acceptance threshold",
            "confidence": "3: The reviewer is fairly confident that the evaluation is correct"
        },
        {
            "title": "A post-processing method to filter ‘good’ generated samples for GANs ",
            "review": "This paper proposed a post-processing rejection sampling scheme for GANs, named Discriminator Rejection Sampling (DRS), to help filter ‘good’ samples from GANs’ generator. More specifically, after training GANs’ generator and discriminator are fixed; GANs’ discriminator is further exploited to design a rejection sampler, which is used to reject the ‘bad’ samples generated from the fixed generator; accordingly, the accepted generated samples have good quality (better IS and FID results). Experiments of SAGAN model on GMM toys and ImageNet dataset show that DRS helps further increases the IS and reduces the FID.\n\nThe paper is easy to follow, and the experimental results are convincing. However, I am curious about the follow questions.\n\n(1)\tBesides helping generate better samples, could you list several other applications where the proposed technique is useful? \n\n(2)\tIn the last paragraph of Page 4, I don’t think the presented Discriminator Rejection Sampling “addresses” the issues in Sec 3.2, especially the first paragraph of Page 5.\n\n(3)\tThe hyperparameter gamma in Eq. (8) is of vital importance for the proposed DRS. Actually, it is believed the key to determining whether DRS works or not. Detailed analysis/experiments about hyperparameter gamma are considered missing. \n",
            "rating": "6: Marginally above acceptance threshold",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        }
    ]
}