{
    "Decision": {
        "metareview": "The authors propose an algorithm for enhancing noisy speech by also accounting for the phase information. This is done by adapting UNets to handle features defined in the complex space, and by adapting the loss function to improve an appropriate evaluation metric.\n\nStrengths\n- Modifies existing techniques well to better suit the domain for which the algorithm is being proposed. Modifications like extending UNet to complex Unet to deal with phase, redefining the mask and loss are all interesting improvements.\n- Extensive results and analysis.\n\nWeaknesses\n- The work is centered around speech enhancement, and hence has limited focus. \n\nEven though the paper is limited to speech enhancement, the reviewers agreed that the contributions made by the paper are significant and can help improve related applications like ASR. The paper is well written with interesting results and analysis. Therefore, it is recommended that the paper be accepted.\n",
        "confidence": "5: The area chair is absolutely certain",
        "recommendation": "Accept (Poster)",
        "title": "Application specific paper, but well written with interesting evaluations and analysis"
    },
    "Reviews": [
        {
            "title": "well written & rather experimental paper -- for the experts mostly",
            "review": "The paper is written, provides good description of the state-of-the-art and comprehensive experimental results.\nThe methological contribution is mild, essentially changing a buiding block in a state-of-the-art neural architecture.\nThe paper is for the expert audience mostly and is difficult to grasp without a good background on deep learning for speech enhancement.\n",
            "rating": "6: Marginally above acceptance threshold",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "review of \"Phase-Aware Speech Enhancement with Deep Complex U-Net\"",
            "review": "This paper tackles one of important speech enhancement issues of how to predict phase information. The authors work on this problem based on three novel techniques, one is to use complex U-net, second is to propose a new complex mask representation, which is well bounded and well model complex mask distribution, and the last is an objective function motivated by SDR. The paper is well written, and also shows the experimental effectiveness of the proposed method by analyzing these three novel techniques and also by comparing the method with other speech enhancement methods. My major concern about this paper is that this paper is a little bit too specific to the speech enhancement applications, which will not be accepted with so many researches in the major ICLR community. My suggestion is to describe some potential applications of this method to the other (speech) applications including speech separation, noise-robust front-end for ASR, TTS, or other speech analysis, and also discuss the possibility of extending this method for multichannel input. I’m more interested in the multichannel enhancement because the phase (difference) is critical in this scenario. \n\nComments:\n- Introduction: It’s better to cite and discuss the paper of “E. Hakan et al, “Phase-sensitive and recognition-boosted speech separation using deep recurrent neural networks,” Proc. ICASSP’15, pp. 708--712 (2015). This paper is one of the first studies tries to incorporate the phase information to DNN based speech enhancement.\n- Several researchers prefer to use LSTM based enhancement method. Please discuss wether this method (objective function and complex masks) can be applied to complex extensions of LSTMs instead of complex U-net.\n- Page 2, the first paragraph: You may also refer https://arxiv.org/abs/1810.01395\n- Page 3, it’s better to explicitly mention that h = x + i y\n- Section 3.3: discuss how we treat STFT/iSTFT operations under a computational graph representation. It is not so obvious.\n- Section 3.3: again it’s better to mention E. Hakan’s method here.\n- Page 6 footnote: I cannot access to the URL. Please check it.\n- Experiments: I think it would be more interesting to add SDR (using speech and noise as a source) to the experimental measure. Some people use SDR as a speech enhancement measure, and I’m expecting that this method can have more reasonable performance since it is optimized based on wSDR.\n",
            "rating": "7: Good paper, accept",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "generally good paper on speech enhancement using complex operations",
            "review": "This paper used a complex-valued network to learn the modified complex ratio mask with a weighted SDR loss for the speech enhancement task. It can get good enhancement performance.\n\nFor me, the complex-valued network is already there and weighted SDR loss is not difficult to think. The modified complex ratio mask is a bit interesting. However, I think it better to compare with [Donald S Williamson et al] where the hyperbolic tangent compression is used.\n\nApart from the objective metrics, a human listening test using MOS or preference score should be conducted.\n\nOn Fig 3, the unbounded complex mask might suffer from the infinity problem leading to training failure. However, on table 2, the performance of the unbounded mask is quite close to your method. It is a bit strange for me.\n\nThe total idea is good, but the novelty is not much.\n\n",
            "rating": "7: Good paper, accept",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        }
    ]
}