{
    "Decision": {
        "title": "Final Decision",
        "decision": "Accept (Poster)",
        "comment": "The paper introduces a new method for encoding dynamics of temporal networks.  The approach, while not ground-breaking, is interesting and the results are fairly convincing.\n\nThe submission raised a number of concerns from the reviewers. They questioned the complexity of the proposed approach (R3 and R4), the clarity/readability (R2 and R1), and appropriateness of the link sampling strategy (R2), as well as raised several more minor (from my perspective) issues. I believe that the authors adequately addressed most of these concerns in their rebuttal and the revision.  R2 has confirmed that they read the rebuttal and raised their score to strong accept. Unfortunately, the other reviewers have not engaged during the discussion period, and it is unclear if they are satisfied with the clarifications and changes. Nevertheless, after reading the authors' responses and skimming through the manuscript, I believe that most concerns have been addressed, and this is a good paper that deserves to be accepted. That being said, the issue of readability has been raised by the reviewers, and, while I do not think the paper is unreadable, I do agree that there is much room for improvement. I would encourage the authors to polish the manuscript for the camera-ready version, as well as try to address the remaining concerns raised by the reviewers. \n\n"
    },
    "Reviews": [
        {
            "title": "INDUCTIVE REPRESENTATION LEARNING IN TEMPO- RAL NETWORKS VIA CAUSAL ANONYMOUS WALKS",
            "review": "This paper proposes Causal Anonymous Walks (CAWs) that are extracted by temporal random walks and work as automatic retrieval of temporal network motifs to represent network dynamics while avoiding the time-consuming selection and counting of those motifs. CAWs adopt an anonymization strategy that replaces node identities with the hitting counts of the nodes based on a set of sampled walks to keep the method inductive, and simultaneously establish the correlation between motifs. CAW-N to encode CAWs with a neural network model. CAW-N was evaluated to predict links over 6 real temporal showed better AUC gain compared to baselines. \nPros: \n-\tPromising evaluation results which shows average 15% AUC gain compared to 6 baselines over 6 real world datasets. \n-\tNovel idea of avoiding the selection and counting of network motifs instead leveraging anonymization and encoding.  \nCons:\n-\tNo conclusion or future work that discusses about next steps for research community. \n-\tHyperparameter study shows the AUC is very sensitive to sampling strategy (time bias or sampling length). \n-\tSet-based anonymization seems to require a computational complexity of counting the number of nodes in different positions. For example in Figure 2, it counts the number of “b” in different positions. There is no computational complexity comparison between counting this vs. motif counting. \n",
            "rating": "5: Marginally below acceptance threshold",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "Official Blind Review #4",
            "review": "Summary:\nThe paper provides an interesting way to inductively represent a temporal network with the proposed Causal Anonymous Walks (CAWs) which work as temporal motifs to represent the network dynamics. The CAWs can be further encoded by the proposed CAW-N which supports online training. \n\nPros:\nOverall, I like the idea to represent the temporal network with the proposed causal anonymous walks. Experimental results also show significant improvements over the existing baselines.\n- Representation learning for dynamic graphs is very practical and important. This paper proposed an effective solution to this problem.\n- The proposed CAW is novel for capturing the temporal dynamics in temporal networks. The description of the method is easy to follow.\n- This paper provides sufficient experimental results which show the effectiveness of the proposed CAW-N model on the link prediction task, including a wide variety of baselines and datasets.\n\nCons: \n- This paper has been listed on the author's homepage (https://scholar.google.com/citations?user=Ch3YUgsAAAAJ&hl=en), potentially violate the double blind review rules.\n- Some figures, e.g. figure 4, are not very useful in explaining the corner cases. Simple sentences are enough for clarification.\n- It would be better to include the training/inference time comparisons as the introduction claims \"the model scalability\". \n- It would be more convincing if the authors can provide representation visualization comparisons in the rebuttal period. \n \nMinors: \n- missing conclusion section\n- Eq.2, I_AW(w; P), definition of P\n\n\n",
            "rating": "6: Marginally above acceptance threshold",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "Proposing an anonymous walk methodology to support link prediction in temporal networks ",
            "review": "The proposed causal anonymous walks (CAW) is the key contribution of the paper where the set-based anonymization is adopted to allow temporal and structure information in a temporal network can be retained in the CAWs. The sampled CAWs are then used to learn RNN for the link prediction.\n\nPros:\n- The proposed design of CAW (set-based anonymization in particular) is a simple and reasonable one. The empirical results show that it is a good input representation to be fed to the RNN for training.\n- The consideration of the underlying motifs is captured by the RNN so that the scalability issue caused by identifying the motifs can be alleviated.\n- The empirical results based on six different datasets show that it outperforms a number of existing methods.\n- The experiments were well designed with ablation study to figure out the effectiveness of different components introduced in the proposed methods.\n\nCons: \n- In terms of methodology, it is an improved method upon some previously proposed anonymous walk for handling temporal networks. There is some novelty but it is hard to be considered as a breakthrough as claimed by the authors.\n- Figures 1 and 2 are included to help explain the concepts. They are good in general but a bit compact with a lot of details packed making the presentation not hard to comprehend.\n- Readability could be improved. My impression is that it requires the readers to have some background on temporal motifs and anonymous walks or it could be hard for the reader to follow.\n- Entanglement of structural and temporal information is mentioned as one of the challenges. It is not clear how this is addressed in the proposed method.\n\nQns\n- Is the structural and temporal information being addressed disentangled in some way? It seems that it just replies on the use of RNN to take care of all the information as a black box.\n- Can the optimality of the adopted encoding steps be discussed? It seems that they are determined by making references to different existing works.\n",
            "rating": "6: Marginally above acceptance threshold",
            "confidence": "3: The reviewer is fairly confident that the evaluation is correct"
        },
        {
            "title": "Confusion about the notion of inductiveness",
            "review": "The authors provide in-depth analysis on the critical topic of capturing dynamic laws for the inductive representation learning of temporal graphs. The authors leverage the causal anonymous walk to capture the topological laws of the dynamic graph, while not requiring to memorize node identities such that inductive learning is still feasible. Compared with the previous work, the paper emphasizes on scenarios where node/edge attributes are less informative of the inductive reasoning. Some workaround methods are also proposed to deal with the edge features and to enable the efficient computation and sampling procedure. \n\nThe paper is overall well-written, and the motivations are justified clearly. The most relevant work of TGAT from Xu, et al. 2020 does not explicitly account for the dynamic laws of evolving graphs, and the way they construct and sample the local neighborhood is infeasible when processing large graphs in a streaming fashion. The authors leverage the causal anonymous walks to:\n\n1. capture the signals of topological structures which \"reflect\" the identities of the nodes;\n\n2. avoid the costly computations to recover the network structural features during both the training and inference.\n\nThe contribution is solid as it complements the TGAT when the node/edges features are less important. It also solves the computation issues of the TGAT. The numerical results also compare favorably to the baselines. \n\nMy concerns with the paper include:\n\n1. Using random walks and local aggregation methods (such as GCN, GAT, TGAT) have their different emphasis on the network topological laws & node/edge features. The authors should discuss and make it more clear regarding the pros and cons. \n\n2. It appears TGAT adopts the same inductive representation learning setting from GraphSAGE and GAT, which are widely accepted in this domain. The claim and key arguments made by the authors raise a major confusion about being inductive in graph representation learning, and I believe the criticisms here are equally applicable to GraphSAGE and GAT that leverage node features as well. Therefore, I think the notion of inductiveness studied by the authors is at most in parallel to that of TGAT (and GraphSAGE & GAT). If the authors believe their notion of inductiveness is more proper, they should discuss the similar issues for GraphSAGE and GAT since they are more well-known to the readers and will raise less confusion.\n\n3. the link sampling strategy that ensures the overall efficiency of the computation lacks support and is not principled. To some extent, neighborhood/walk construction in dynamic graphs are still open challenges in this domain, so I think using heuristics is fine, but the consequence should be made more clear.\n\nThe authors make the novel contribution of combining the causal anonymous walk with inductive representation on temporal graphs. However, their arguments on the notion of inductiveness can raise a major confusion if not directly discussed for GraphSAGE and GAT. Therefore, I vote for a weak acceptance of this version of the paper.\n\n============================================\nThe authors address most of my questions and concerns in the response, and update the manuscript. I decide to increase my score.",
            "rating": "7: Good paper, accept",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        }
    ]
}