{
    "Decision": {
        "title": "Final Decision",
        "decision": "Accept (Poster)",
        "comment": "The paper combines bi-level optimization and reverse mode-differentiation for flow estimation on networks. Most reviewers think the idea of incorporating physical constraints is interesting and novel, and the experiments convincing."
    },
    "Reviews": [
        {
            "title": "Interesting idea of incorporating the flow-preservation with promising results.",
            "review": "This paper investigates the very important problem of incorporating physics into machine learning model with special focus on the missing flow estimation problem. It proposes the a flow-estimation model that combines the reverse-model differentiation and neural network considering the edge features. Empirical results on two real-world datasets show very promising results with interpretable physical properties.\n\nClean presentation and easy to follow.\n\nStrength:\n- The investigated problem of incorporating physics into machine learning model is very important.\n- The idea is combining reverse-mode differentiation into the modeling is intuitive and also shown to be effective.\n- The proposed algorithm achieves improved results and also show intuitive interpretation.  \n- The paper provides detailed information implementation about experiments, which make the result more convincing and easier to reproduce. \n\nHere are some minor concerns:\n- The proposed algorithm applies to problems on the flow graphs. Yet, for many applications on flow graphs, e.g., traffic speed (instead of flow) prediction, it may not be straight-forward to apply the proposed algorithm.\n- It is will be interesting to see if the flow preservation can be incorporated directly in the model forward path of training instead of using a regularizer.",
            "rating": "7: Good paper, accept",
            "confidence": "3: The reviewer is fairly confident that the evaluation is correct"
        },
        {
            "title": "somewhat not fitting the conference title ",
            "review": "authors study the problem of learning flows form partially observed flow networks. The estimationg of unobserved flows is based on flow conservation and edge features. \n\nonly little theorerical analysis is offered: \n- does the proposed method converge?\n- is the learning problem (bi-level optimization problem) intriniscally hard (non-convex)? \n\nim also missing a discussion of how the proposed method relates to min-cost flow problems which are quite well-studiedl see the textbook Network Optimization: Continuous and Discrete Models  by Bertsekas. \nA recent line of work connects min-cost flow problems with non-smooth convex optimization: \n\nA. Jung, \"On the Duality Between Network Flows and Network Lasso,\" in IEEE Signal Processing Letters, vol. 27, pp. 940-944, 2020, doi: 10.1109/LSP.2020.2998400.\n\nthe numerical experiments are not very convincing. Also, it is unclear how the edge features are obtained precisely for the traffice network example. It is mentioned that we know in-degree, out-degree and number of lanes. How is the in-degree of an edge defined?",
            "rating": "6: Marginally above acceptance threshold",
            "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"
        },
        {
            "title": "Interesting topic with limited novelty",
            "review": "In this paper, the authors introduce a method for missing flow estimation. These method has potential to address some important applications in transportation, power systems and water management. One major difference compared with the previous work is that edge features are incorporated into the optimization process so that the model has a better chance at learning edge-specific patterns. The experimental results have shown some success of the proposed method in traffic and power datasets.\n\nThere are several major issues with the paper:\n1. The model is based on the assumption of flow conservation. However, this is not always true in real-world scenarios. The power can be generated or consumed while water flow can also be affected by precipitation. \n\n2. The novelty is limited as most parts are based on existing work. The authors claim that this method combines physics and ML but I did not see physics being used anywhere in designing the model (except for the conservation). The use of matrix Q (and edge features) may not necessarily learn patterns that are consistent to underlying physics (since it is still learned automatically).\n\n3. Notation used in the paper is confusing, even if people can still get most of it after reading through the entire paper. For example, authors may want to include the definition of x (missing flows) in Section 2. In Eq. 1, do you need the operator \\sum_vi?\n\n4. An alternative way to think about this problem is to train a predictive model that predicts x from edge features (maybe using a graph neural net) and then enforce the flow conservation. What is the difference between this predictive framework and the proposed bilevel optimization framework? It would be great to compare with other predictive method. \n",
            "rating": "4: Ok but not good enough - rejection",
            "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"
        },
        {
            "title": "A decent illustration of PIML in the vein of UDE. ",
            "review": "The authors propose a parametric regularizer for estimating unobserved flows in networks, incorporating edge features and other side information. The parameters of the regularizer are learned by means of minimizing the empirical cross-validated MSE. Regularization is necessary because the basic problem, while convex, typically is under-constrained; resulting in a infinite space of solutions which match the observed data.  \n\nThe paper is clearly written and easy to follow. It conceptually follows the universal-differential-equation (UDE) framework for integrating physics and machine learning, in which certain elements of a physical model are replaced by a parametric model which can be trained from data. This connection makes the work topical, and a small step forward in physics-informed machine learning.\n\nFor this particular problem, it seems that (i) the prior is indispensable, some prior (perhaps implicit) will be contained in any regularization, and (ii) the learned parameters may depend implicitly on the prior. This brings up two difficulties. Where does one obtain a (good) prior if one does not have one already? And, how can we hope the parameterized regularizer will generalize for new priors? Perhaps by virtue of it's simplicity?\n\nOther potential issues I should like to have seen addressed are: \n\nThe model is well suited for instantaneous flows. For the traffic problem, it seems it is predicting current flow from current flow. Yet, it takes time for cars to move about. It would be nice to see temporal dynamics included.\n\nOnly diagonal regularizers are considered. Can the authors comment on learning more general regularizing matrices? \n\nCan the proposed learning algorithm (or similar) be used to inform which edges ought to be measured to maximize one's ability to impute the missing flows? If so, how? If not, why?\n\nFinally, and not least, the cross-validation routine appears to equally weight each edge. Yet, some edges may be more constrained than others. Certainly, each fold will have it's own, potentially different, infinite subspace of solutions to the unregularized problem. Failing to account for this may bias the learning algorithm. One may see undue performance degradation when applying a trained model to a different pattern of observed flows for the same network.\n",
            "rating": "7: Good paper, accept",
            "confidence": "3: The reviewer is fairly confident that the evaluation is correct"
        }
    ]
}