{
    "Decision": {
        "metareview": "The manuscript proposes to analyze the learning dynamics of deep networks with separable data. A variety of results are provided under various assumptions.\n\nThe reviewers and AC note the assumptions required for the analysis are quite strong, and perhaps too strong to provide useful insight into real problems. Reviewers also cite issues with writing and the breadth of the title (this was much improved after rebuttal).",
        "confidence": "4: The area chair is confident but not absolutely certain",
        "recommendation": "Reject",
        "title": "Metareview"
    },
    "Reviews": [
        {
            "title": "Nice insights with too strong assumptions",
            "review": "The authors study the learning dynamics of deep neural networks, which is of fundamental importance but lacks understanding. The authors study several dynamics like activation independence, gradient starvation, which gives new insights. However, the assumption is too strong.\n\nThere are two main results in the paper:\n1) Through learning, the neurons activates of one class. \n2) The classification error, with respect to the number of iterations of gradient descent, exhibits a sigmoidal shape.\n\nHowever, there are two strong assumptions: 1. the two data are perfectly separable by linear classifier. 2.  H2 assumes \"at the beginning of training data points from different classes do not activate the same neurons\". This is a very strong initial assumption, I am not sure how likely this assumption would be satisfied. It sounds to me this assumption implicitly suggests that the algorithm is already ALMOST CONVERGENT. \n\nIf this assumption cannot be weakened, I don't think the paper can be accepted.\n",
            "rating": "5: Marginally below acceptance threshold",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "Good starting point to analyze learning of non-linear deep nets, but assumptions are too strong",
            "review": "The authors study properties of the learning behavior of non-linear (ReLu) neural networks. In particular, their main focus is on binary classification for the linear-separable case, when optimization is done using gradient descent minimizing either binary entropy or hinge loss.\n\nThere are 3 main results in the paper:\n1) During learning, each neuron only activates on data points of one class: hence (due to ReLu), each neuron only updates its weights when seeing data points from that class. The authors refer to this property as \"Independent modes of learning\", suggesting that the learning of parameters of the network is decoupled between the two classes.\n2) The classification error, with respect to the number of iterations of gradient descent, exhibits a sigmoidal shape: slow improvement at the beginning, followed by a period of fast improvement, followed by another plateau.\n3) Most frequent features, if discriminative, can prevent learning of other, less frequent, features.\n\nApart from the assumption H1 of linear separability of the data (which I don't mind), the results require very strong assumptions, in particular hypothesis H2 stating \"at the beginning of training data points from different classes do not activate the same neurons\". \n\nEven for a shallow net, the authors are essentially assuming that the first layer of weights W is such that each row w is already a hyperplane separating the two classes after initialization (wx > 0 for all x belonging to one class and wx' < 0 for x' in the other class). In other words, at initialization, the first layer is already correctly classifying all data points. This is of course an extremely stringent assumption that doesn't hold in practice (eg, the probability of such an initialization shrinks to zero exponentially in the number of dimensions and in the number of neurons).\n\nBecause of this concern, I believe the results in the paper can only really characterize the learning close to convergence, since the network is already able to provide correct classification.\n\nPros:\n - Authors consider a non-linear (ReLu) neural network, as opposed to the analysis of Save et al which only considers linear nets.\n - The fundamentally different behavior between Hinge and binary entropy loss is interesting, and worth analyzing further.\n - Sigmoidal shape of classification error as a function of number of iterations is inline with what is seen in practice. However, I believe the assumptions needed to show this point force the analysis to only characterize learning close to convergence.\n\nMinor Cons (apart from major concern above):\n - Theorem 3.2: \"[...] converges at a speed proportional to [...]\". Isn't \\bar{u}_t logarithmic (non-linear) in t? \n - Theorem 3.2: Even if strong, I don't mind the assumption on a dataset merely consisting of two (weighted) data points. I would suggest to simulate this case without putting any condition on the initialization of the weights (ie, without assumptions H1-H2), and compare the empirical shape of the classification error with the one you obtain analytically in Figure 2 Right.\n- Theorem 3.2 Interpretation: unfinished sentence \"We can characterize the convergence speeds more quantitatively with the\"\n- Theorem 4.1: Can you give an intuition or lower/upper bounds for u(t) for the Hinge case, to make evident its difference from the binary entropy case (where u(t) ~ log(t))\n- Gradient starvation, Kaggle experiment: I'm not too convinced about the novelty/usefulness of this result. In the end, even a decision tree stump would stop growing after learning the dark/light feature as a discriminator. What I'm trying to say is that \"gradient starvation\" is a more general problem that really doesn't have to do with gradient descent. Also, the fact that the accuracy on the Kaggle non-doctored test set is low is simply because the test set is not coming from the same distribution of the training set.\n\n",
            "rating": "5: Marginally below acceptance threshold",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "The paper is concerned with a special case of deep learning (binary classification subject to strong assumptions) and tries to establish a mixed bag of results related to what is called \"learning dynamics\" of deep learning. ",
            "review": "The underlying motivation for the paper is really interesting and cuts straight to the heart of Deep Learning and strives to unravel the key understanding that we are still to a large extent missing.\n\nWhen it comes to clarity and organization I find the paper a bit \"messy\" in that it is a collection of quite a few findings on the very specific topic of binary classification with quite strong assumptions. Especially given the very specific nature of the topic I miss a strong and clear path through the paper. Unfortunately the paper leaves me with the distinct feeling that there are still a lot of work needed to be able to tell the story about the problem under study. Having said that the paper does contain several individual findings. Having said that I find the ideas leading up to what the authors refers to as \"gradient starvation\" to be really interesting and that would be a great clear idea to focus on.\n\nA few concrete questions/comments:\nCan you explain somewhere exactly what you mean when you say \"learning dynamics of deep learning\"? Given the specific nature of the results presented in the paper it would be nice to be precise also when it comes to the overall topic under study.\n\nGiven the very specific nature of the topic treated in the paper I find the title of the paper largely misleading. The title claims way more than what is actually delivered in the paper, despite the fact that the authors have put in an \"On\" in the beginning of the title.\n\nIn Corollary 3.3. you characterize the convergence speed in a nice way, but I am missing the link to the behaviors observed empirically in e.g. Fig. 2. What am I missing?\n\nThe final sentence in Section 2 is highly speculative and I find this hard to believe without solid backing. The sentence reads \"... and helps develop intuitions about behaviors observed in more general settings.\" Given the restrictive nature of your set-up I find it very hard to believe that this extends to more general settings.\n\nTiny detail: The axes of several of the plots given in the paper mis the lables which makes it hard to read. Straightforward to fix, but worth mentioning nevertheless.",
            "rating": "5: Marginally below acceptance threshold",
            "confidence": "3: The reviewer is fairly confident that the evaluation is correct"
        }
    ]
}