{
    "Decision": "",
    "Reviews": [
        {
            "title": "The submission suggests a methodology compressing the parameters of neural network (NN) architectures but the novelty of the method is limited.",
            "review": "The submission suggests a methodology compressing the parameters of neural network (NN) architectures, by first converting them to higher-order tensors and then factorizing them with various tensor decompositions. The main assumption of this work is that there may be structure in lower-order tensors (e.g., matrices or low-order tensors) contained as parameters of a NN such as: periodicity (e.g., the vector [1,2,3,1,2,3,1,2,3]) or modularity (e.g., the vector [1,1,1,2,2,2,3,3,3]). The main argument of this work is that such invariant structures in lower-order objects often go unexploited in previous low-rank approximation techniques tackling the problem of compressing the parameters of a deep neural network. The authors argue that such structures may be revealed by reshaping lower-order tensors into higher-order ones and factorizing the resulting tensors.\nDespite the fact that the results seem promising, the paper suffers from the following issues:\n1. Tensorizing to a higher-order tensor with lower mode sizes and factorizing through tensor network approaches is not a new approach, as suggested in the main contributions. The authors should more clearly position this part of the work with respect to existing literature. I provide more details on this point below.\n2. There is no experiment or discussion to back up the assumption that: 1) the invariant structures suggested by the authors do appear within the parameters of a neural network architecture; 2) such invariant structures are captured by the higher-order tensor decomposition proposed. As such, it seems that there is no solid intuition presented to justify why the approach works. Even if the authors stress out in the experiments that: \"These results confirm the existence of extra invariant structure in the parameter space of deep neural networks\", this is really not clear/well-justified.\n3. The experiment setup is missing crucial discussions on the hyper-parameter search. For example, as the tensor order increases, there are many more potential choices for setting the low rank parameters of a tensor train decomposition, as well as the corresponding mode sizes of the input tensor to be decomposed. How does this increased space of hyper-parameters to search for affects performance seems a crucial performance factor, but it is not discussed at all.\n4. The description of the sequential fine-tuning procedure seems really hand-waving. Despite the lengthy appendix, there is not even a pointer from the sequential fine-tuning section so that the reader can go over this process in more detail with precise notation. The lack of any detailed description of this step raises doubts regarding this step's novelty/methodological significance.\nAdditional comments w.r.t. first issue: The idea of reshaping a lower-order object into a higher-order tensor with low mode sizes and then factorize it does exist in the literature. Especially, in combination with tensor train decomposition, the framework has been called as the Quantized-Tensor Train (QTT). For example, the authors could check Section 2.9 of the survey: Grasedyck, Lars, Daniel Kressner, and Christine Tobler. \"A literature survey of low‐rank tensor approximation techniques.\" GAMM‐Mitteilungen 36.1 (2013): 53-78. and references therein. \nI think the authors should mention the connections existing with this line of work and argue about how their approach differs. Admittedly, it seems that this is the first effort of applying those ideas in the context of compressing neural network (NN) parameters, as well as deriving the update rules w.r.t. a NN; still, appropriate credit should be given to the QTT line of work.\nAnother issue w.r.t. comparing with related work is that the authors should definitely try to include the comparison and discussions with other low-rank approximation-based NN compression in the main text, rather than the appendix. \nMinor comments: Tensor partial outer product should be more clearly defined in the main text. Currently, it is really not clear to the reader what this operation signifies.\nAlso, it is not clear on how to interpret CP tensor network diagrams as they are presented by the authors. It seems that the current presentation does not take into account the diagonal core tensor that is present in CP.",
            "rating": "4: Ok but not good enough - rejection",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "The contribution looks rather incremental and is not motivated enough neither in theory nor in experiments.",
            "review": "The authors address the neural networks compression problem and propose to amend the previously known approximations based on different tensor decompositions (CP, Tucker, or tensor train) with a reshaping step, where a tensor is preliminary reshaped to a higher order tensor. However, I do not see why would such modification be beneficial compared to the previously known approximations; this is also not clarified by the experiments. \n\nThe paper contains detailed overview of the related literature. However, I think it would be more interesting to see a detailed elaboration of the proposed idea. Most importantly, the description of the proposed approach -- reshaped tensor decomposition -- looks rather superficial. In particular, I can not see where the improvement (compared with similar approximations without the reshaping) in memory and/or runtime would come from. Let me clarify with an example. Given a matrix A of size N x M and assume that this matrix is actually rank-1, i.e. there exist vectors a and b such that A = a’b. Let's reshape this matrix into, say, an order-4 tensor T with dimensions n x m x k x p. Assume that this tensor T is also rank-1 and there exist vectors x1, x2, x3, x4 such that T is equal to their outer product. Since N+M = n+m+k+p, why would vectors x1, x2, x3, x4 need less memory than vectors a and b? Moreover, would such reshaping transformation preserve the structure of the original tensor, e.g., its low-rank representation? That is, if A is a rank-1 matrix, is the tensor T guaranteed to still be rank-1? Isn't it more difficult to factorize a tensor of higher order?\n\nI am also confused by the author's choice of the baseline for their experiments. First of all, wouldn't it be more informative to compare with the other known compression methods based on tensor decompositions (Lebedev, et al, 2015; Jaderberg, et al, 2014; Kim, et al, 2016)? Although indeed these approaches can be seen as particular cases of the proposed reshaped decomposition, such comparison would demonstrate whether this newer approach (RTD) is better than already existing methods. In particular, Kim et al experimentally demonstrate that their approximation, based on Tucker decomposition, leads to nearly lossless compression (they perform their experiments with publicly available pre-trained networks which shouldn't be difficult to compare to). Why the experimental results presented in this paper are so different? Does the loss of accuracy result from the compression with the Tucker decomposition or is it due to the reshaping step or are there other reasons? I am also not sure what does plain tensor decomposition stand for and why is it considered to be state-of-the-art (references?)? \n\nMinor comments: \nfigure 2: b is a particular case of a\nfigure 2: d - shouldn’t the outer product of two 3-dimensional tensors result in a 6-dimensional tensor?\nmight want to use \\citep to add brackets around citations\ntypo: element-wisely -> element-wise",
            "rating": "4: Ok but not good enough - rejection",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "Three critical problems",
            "review": "In this paper, a compressive representation of convolutional neural networks is proposed. The main idea is reshaping the kernel of a convolutional layer into a higher order tensor (e.g. 9x9x9 => 3x3x3x3x3x3) and applying tensor decomposition to reduce the number of parameters. Experiments with standard data sets (CIFAR10, MNIST, ImageNet) are conducted. \n\nThe upside of this paper is that the technical details such as the gradient formulations are sufficiently covered in Appendix. This is nice in terms of self-contentedness. \n\nHowever, I found this paper contains three critical problems. \n\n1. Prior work is not explicitly referred. The core idea of reshaping & tensor decomposition was originally proposed by Novikov et al. (2015). However, this fact is only mentioned in Appendix and in the main paper, there is no reference. This is unfair because some reader can misunderstand that the main idea is purely invented in this paper. \n\n2. Contributions are not enough. In Appendix A, it is claimed that Novikov et al. (2015) proposed the core idea for fully connected layers and the authors of this paper (and Wang et al. (2018)) extends for convolutional layers. However, it seems Garipov et al. (2016) already addressed this direction. What is the difference from their approach? Furthermore, even if the extension for convolutional layers is new, I feel the technical contribution is incremental (just changing the decomposing tensor from a fully-connected weight to convolution kernel) and not enough as an ICLR publication.\n\n3. The experiments are not exhaustive & results are not particularly good. Only tensor decomposition methods are used as baselines and no other compression method is compared. ",
            "rating": "4: Ok but not good enough - rejection",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        }
    ]
}