{
    "Decision": "",
    "Reviews": [
        {
            "title": "Paper was submitted to an inapproprate venue",
            "review": "It appears the paper has been submitted to the wrong venue. While it adresses features and uses machine learning, most of the paper is about a very technical way of handcrafting features for a specific problem. On the other hand, representation learning is about leaving the domain knowledge as much as possible to the machine, and building systems end-to-end. This approach is not reflected in the work at hand.\n\nWhile I cannot judge the significance and the validity of the approach, I am quite certain that the submission is not within the scope of ICLR and should be rejected.",
            "rating": "2: Strong rejection",
            "confidence": "1: The reviewer's evaluation is an educated guess"
        },
        {
            "title": "Some practical experiments, but not enough novelty or rigour",
            "review": "While the authors claim \"The problem of concept drift in WiFi-based localization systems, was first mentioned in (Ghourchian\net al., 2017),\". the need for robustness of localisations to changes in the environment has been well known since the earliest implementations.\n\nWhat value is the reader supposed to get from Figure 5?\n\nMost of the machine learning techniques used in the paper are quite dated.\n\nI'm confused about \"Although the proposed feature space is almost resistant to concept\ndrifts, we incorporate incremental learning so that the model can adapt to new data without forgetting\nits existing knowledge, \" - if the system has changed the existing knowledge may be wrong and need to be forgotten?!\n\nThe paper needs a thorough proof-reading by a native English speaker.\n\nIn summary, while having run real experiments, the paper does not make a concrete conceptual contribution, and most of the practical elements are fairly basic, and the experimental aspects are not particularly rigorous.",
            "rating": "3: Clear rejection",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "An application paper. No novelty. Very application (WiFi based localization) specific, so no generalizability.",
            "review": "This paper proposes a feature augmentation based approach for detecting concept drift. The particular application it deals with is WiFi-based indoor localization. Much of the paper is used to define the context and describe details of indoor WiFi based localization. A lot of space is also devoted to explaining Wifi data acquisition and other nitty-gritty details of data. The actual method for correcting concept drift is a trivial feature augmentation.\n\n I'd recommend the authors consider submitting this paper to an applied electronic communications conference where the topic and the scope of this paper might be more relevant. \n",
            "rating": "4: Ok but not good enough - rejection",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        }
    ]
}