{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Reject",
        "comment": "The paper proposes a GAN based method for synthesizing various types of defects as foreground on different product images (background). The method builds upon StarGANv2, and adds the cycle/content consistency loss and classification loss between foreground and background. While the paper considers an important problem/application, the reviewers found it lacking sufficient novelty for publication. The paper will be more suited for publication at an application oriented venue."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "This paper describes a StarGAN-based approach to generating synthetic images of various defects based on the underlying training data. The proposed method considers two different types of domains, e.g., the foreground domain as defect types and the background domain as product types, and the derived synthetic images are included in the training data to improve the performance of defect classification.",
            "main_review": "Detailed comments are as follows.\n\n1. The proposed method is reasonable, but the technical novelty is only moderate. The GAN formulation described in the paper heavily relies on StarGAN v2, with additional addition of the content transfer strategy introduced in Mokady et al., 2020.  \n\n2. The presentation needs significant improvements. For example, the contents/writing of Section 3 are way too similar to StarGAN v2. This could negatively affect the evaluation of the technical contributions of this work.\n\n3. The experimental results are not convincing. The experiment is tested on only the SDI dataset, and the comparisons do not include existing SOTA techniques for defect classification. It is not clear whether the claimed main advantage of increasing the diversity of defects on each specific target product would still be valid for the case that defects of different products vary significantly. Also, it would be more insightful to include the experiment of defect localization (say, over the MVTec AD dataset) to further justify the usefulness of the proposed approach.\n\n4. The ablation study on page 7 should be made more comprehensive (e.g., with explicit quantitative results), rather than with qualitative examples as in Figure 5.\n\n5. The paragraph of cross-domain effect (with respect to Table 4) needs to be discussed in more detail. Is the defect transferring still effective for the case that defects of different products vary significantly?\n",
            "summary_of_the_review": "The technical novelty of the proposed method can be improved, and the experiments lack comparisons with SOTA techniques for defect classification. This work is not ready for publication yet.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": " This paper introduces Defect Transfer GAN to transfer or generate different types of defects such as stretches or spots (foreground) and apply them onto different product images (background). The method builds upon StarGANv2 and add the cycle/content consistency loss and classification loss between foreground and background. Experiments were reported on the Surface Defect Inspection dataset. Results show that the proposed method achieved better FID and KID scores. The paper shows that training on the synthesized dataset performs better than traditional data augmentation.",
            "main_review": "Strength: \n+ The paper addresses an interesting and important application. \n\n+ The technical implementation details are well documented. The appendix provides great details on the experimental protocol and additional results. The authors promise to publish the code and dataset so this could be a nice contribution to the community. \n\n+ The classification accuracy was higher when using the proposed data synthesis approach. \n\nWeakness: \n-\tI have a hard time to find anything that is technically novel. All the training losses are inherent from StartGANv2 or CycleGAN. The main difference lies in the foreground/background separation, but there was not ablation study to validate this. \n\n-\tOnly results on a *closed* dataset is reported. I feel that this paper would be a lot more better suited for conferences with a focus on applications. I am not sure what’s the take-away lesson on the technical components from this paper.  ",
            "summary_of_the_review": "I think this paper tackles an interesting applications. The results are thorough and solid. My main concern of this paper is that the technical novelty is limited. I am thus leaning negative about this paper.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "Authors proposed the GAN method that can translate the defect between images. The obtained results from the proposed GAN is able to disentangle the defect-specific content from the background images in the weakly-supervised manner. By using the proposed GAN method, authors augmented the training data. The accuracy gain obtained using the data augmentation shows consistent and significant gap to the conventional method without the data augmentation.",
            "main_review": "> It is hard to understand what is the style and what is the content in the targeted application. Even though the method is proposed to tackle the defect recognition problem; while style and content are not clearly defined in such a context. This confuses the concept of style and content throughout the draft.\n\n> The technical novelty looks weak: Most of components are similar to the StarGAN v2. While authors insist that they added few more modules such as background/foreground classifier, however this extension is rather trivial. Method-wise it is hard to find the improvement. In the application-side there could be, however it was not clearly explained why such style/content separation and bg/fg classification are important for the targeted application.\n\n> Experiments are somehow limited: Only 1 dataset is involved for the experiment. Furthermore, the presentation for the results is rather weak. Figures 3 through 6 are not clearly explained. They are not the natural images and it is hard to empathize that the images obtained is operating well for the given scenario. I think authors need to better explain such a subtle improvement.",
            "summary_of_the_review": "Due to the limited presentation, experiments and technical novelty, I am on the borderline for this draft yet. However, I could go towards the accept, if authors could made effective rebuttal to my comments.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This work applies GAN for data augmentation to enhance defect classification. Concretely, based on StarGAN v2 structure, the proposed framework is able to encode the foreground and the background separately, enabling diverse defect synthesis by either transferring the defect from a reference sample or synthesizing from randomly sampled noises.",
            "main_review": "**Strengths**\n\n- Applying GANs to defect synthesis is interesting.\n\n- The results of reference-guided defect transfer are promising.\n\n**Weaknesses**\n\n- My main concern is the technical novelty. From the task perspective, using GANs for data augmentation is not new, and using GANs for style/content transfer is also not new. This paper just applies it to a new area. From the technique perspective, most of the architectures are borrowed from StarGAN v2. Some loss terms are added to improve the performance, but all losses seem to be trivial. Despite the good results, I cannot see many insights from this work (*e.g.*, how can this work guide other researchers?)\n\n- The proposed approach is only evaluated on the Surface Defect Inspection (SDI) dataset. The superiority cannot be fully verified.",
            "summary_of_the_review": "To be honest, I do not think this work is suitable for ICLR as most audiences may not get interested. I strongly recommend the authors submit this work to a conference/journal in the industry field.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "\nThe paper prposes a StarGAN based model to distangle the defect foreground, background, transfer the style of foreground and then synthesize the defected image for different products. The quality of the synthesized defect images are evaluated using FID, KID. The approach is also appled to augment defect images to improve the performance of defect classification.",
            "main_review": "Strength:\nThe paper is well writen and easy to follow, the proposed methods seems to mitigate the data collection and labelling costs of the defect inspection problem widely available in production industry.\n\nWeakness:\nFrom technical part, the model is basically a tailored StarGAN v2 tuned for the defect generation task, the novelty and contribution of methodology is limited, particularly for ICLR 2022.\n\nThe employed SDI dataset is not publicly available and it's difficult for researchers to evaluate and compare the performances.\n\nWhile StyleGAN v2 and BigGAN are involved for comparison, how do you train them for the synthesis? By fintuning? or training from scratch?\n\nOnly scratch and spots are involved, the number of categories for defects are too limited and it's not convincing to support the claim. Much more defects and products need to be tested and evaluated.\n",
            "summary_of_the_review": "\nThe work presented in the paper can be regarded as an application of StarGAN v2, while the paper is well writen and easy to follow, the novelty and contribution of methodology is limited, particularly for ICLR 2022.\n\nAs only scratch and spots are involved, the number of categories for defects are too limited and it's not convincing to support the claim. Much more defects and products need to be tested and evaluated.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        }
    ]
}