{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Reject",
        "comment": "This paper investigates a semi-supervised label refining approach to searching for similar voices for voice-dubbing.  The apporach is based on generating refined labels using a clustering algorithm on the initial labels.  Therefore, better voice characteristics can be extracted and used to select a new voice in the target language that closely matches the voice characteristics of the source language.  Experiments are carried out on MassEffect as the main dataset and Skyrim as the second dataset and results show that the proposed approach slightly outperforms state of the art.  While the topic under investigation is interesting and has its value to the applications such as voice casting,  there are strong concerns raised by the reviewers.  Reviewers find the paper difficult to follow.  Some important pieces of information are either missing or only vaguely explained (e.g. non-expert initial labels,  clear interpretation of p-vectors, etc.), which greatly hinders a deep understanding of the work.  Some technical details such as network architecture and its training should be elaborated.  This paper needs some good improvement in order to get accepted.  No rebuttal is provided by the authors so all these concerns still stand."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "The paper proposes a label refinement approach. Starting from an initial set of labels, k-means clustering is used to refine the labels. The approach is described in the context of dubbing/voice casting. The method tries to obtain voice characteristics which can be further used for dubbing/voice-casting. Experiments are shown on video game datasets MassEffect and Skyrim and they primarily investigate how different parameters of k-means (# of clusters) and distance measure affect the label refinement. ",
            "main_review": "1. The paper proposes to start with initial labels and then use k-means clustering to refine labels. Overall, I do not find the approach to be novel. Its also not clear what it is really trying to achieve by this one step of refinement. \n\n2. The paper talks about voice similarity, dubbing/voice-casting etc. but this label refinement is never really used for these tasks in the experiments. The paper merely studies the clustering through different measures and its not clear to me what the end goal here is ? The analysis of clustering offers very limited insights. In the case of the MassEffect dataset, the clustering ends up highlighting initial labels  (expected) but when another dataset is used it ends up highlighting refined labels. These seem kind of obvious conclusions ?? \nThe paper does not offer any interesting insights on the methods as well as on the empirical end. \n\n3. Is it possible to do this refinement in an iterative manner ? You started with some initial labels and try to iteratively refine the labels. \n\n4. There are some recent self-supervised speech representation learning approaches such as Hubert [R1]. Authors should take a look at this paper and see if they might benefit from it as it appears to be related to it. \n\n5. Is it possible to do experiments on how this approach can improve voice casting ? \n\n6. There are quite a few typos and writing errors. Please proof-read the paper. Overall, the paper is quite difficult to read. \n\nR1: HuBERT: Self-Supervised Speech Representation Learning by Masked Prediction of Hidden Units",
            "summary_of_the_review": "Overall, I do not find the paper interesting. The approach is not particularly novel and it is not clear how it benefits the end goal. The experiments are very shallow and do not provide very interesting insights. The paper lacks strength on both methodology as well as experiments. \n",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "In this paper authors proposed a semi-supervised learning method named Label Refining, which leveraged a clustering algorithm for computing refined labels from initial ones, for training representation extractors. The proposed approach was applied to improve characteristics extraction from actors' voices.",
            "main_review": "This Labeling Refining described in this paper could be generally applicable in different areas. Overall this paper clearly presents the proposed approach.\n\nI find some experimental results require further clarification. E.g. \n1. For results in Table 2-4, is it possible to add standard deviation to show if improvements are significant? \n2. In the last paragraph on page 7, it's said best results are not for k=4 (test set has 4 characters though). Then how to validate the trained model is robust to unseen cases? \n3. I'm not very clear with what patterns could be identified for distance vs. k values vs. measures for results shown in Table 4? \n4. English written could be further improved, e.g. \"We therefore p-vector features\", \"In Table 2, we plot the observed metrics\" etc. Also in the first line below equation (1), should it be \"o\" instead of \"e\"?",
            "summary_of_the_review": "Overall, I think this paper needs to further improve its experimental section, with more explanation for the results. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "This paper addresses the task of finding similar-sound voices with application to voice-dubbing (e.g. finding an actor to record dialog in English, translated from original French dialog, such that the English speaker sounds similar to the original French speaker). The paper proposes a method called \"label refining\". This method is based on p-vectors, a prior representation found to model similarity between characters. The method uses 1) non-expert \"initial labels\" to train a p-vector system 2) use k-means to cluster the resulting p-vectors and 3) use the groups learned by k-means to re-group the labels (the \"refined labels\"). To evaluate the method, English-French pairs of voice data from the video games Mass-Effect 3 and Skyrim are used. Performance is measured using clustering measures v-measure and purity-K, as well as accuracy on the test set (which it seems the ground-truth labels are mapping to the correct dubbing speaker). The method achieves a higher accuracy of 0.70 over a state-of-the-art system that achieves 0.69. A second experiment is performed using Skyrim data as a subsidiary corpus used to cluster, with the goal of \"bringing out vocal characteristics\" from the initial labels, which shifts the optimal K towards 2, which the paper claims is because the new representations start to model gender.",
            "main_review": "### Strengths:\n\nS1) The approach is simple, and seems to improve accuracy a bit over state of the art.\n\n\n### Weaknesses:\n\nW1) Overall I found the paper rather difficult to read. Besides some typos and opportunities for English usage improvement (see my comments below), I think the description of the type of information that the p-vectors carry is rather vague. In the introduction, the method is motivated by \"[Voice Casting operators] do not trust the computed recommendations and need a more complete interface to interact with the system.\" But I don't really see how the provided approach solves this problem, because the proposed approach is still just extracting vectors and are fed to a machine learning classifier, and are thus not really any more interpretable.\n\nW2) I'm still a little unclear what the \"non-expert initial labels\" are here. Are these some suggested pairs of speakers that are judged to be compatible in terms of sounding similar? This needs to be made more clear. Also, if it's indeed the \"unique French-English couple\" that provides these initial labels, isn't this quite subjective, since it's a decision the voice casting directors made, and doesn't necessarily imply that the voices are actually similar?\n\nW3) I'm not quite sure what conclusion is being drawn from the second experiment where Skyrim data is used in the clustering. It seems to be that the preference towards K=2 suggests a separation in terms of gender? \n\nW4) I think this paper would be improved by actually measuring the outcome of the task of interest by doing an evaluation with human subjects. E.g. if humans are presented with a suggested dubbing actor for an original utterance, does this method actually improve over prior approaches in terms of presenting similar voices that are suitable for dubbing?\n\n\n### Minor comments\n\nM1) \"to describe comedian voices\": comedian? Do you mean actor?\n\nM2) \"Vocal Casting\": don't capitalize.\n\nM3) \"It stats\" -> \"It starts\"\n\nM4) \"We therefore p-vector features\": missing words?\n\nM5) \"a voice color (e.g. white, red)\": this seems a little insensitive, if referring to race\n\nM6) \"fictives examples\": maybe \"illustrative examples\"?\n\nM7) \"f : e → l and g : e → r\": should this be \"f : o → l and g: o → r\"?\n\nM8) \"A resume of the protocol\" -> \"A summary of the protocol\"\n\nM9) \"We propose a breaking down protocol\": probably a better word choice than \"breaking down\"\n\nM10) \"Skyrim is also a known video game\": known to whom? Do you mean to say a popular video game?\n\nM11) Capitalize \"English\" and \"French\" everywhere.",
            "summary_of_the_review": "Overall, I recommend rejection. I didn't find the paper very clear, and the conclusions are vague and not well-supported by the experiments. The novelty seems relatively minor, since this is using the p-vectors defined before, and just adding a clustering step to their training.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "The paper presents a \"label-refining\" technique, which helps users pick voices to provide a better user experience in dubbed video games. The idea is that a voice talent's voice in the target language should match the character's voice characteristics in the source language. The method seems to work by attaching labels to data-driven clusters, and refining these using a second corpus, on which the labels' value for discrimination is measured.",
            "main_review": "Strengths\n-------------\nThe paper has an interesting angle on combining data-driven and explainable (accessible by humans) clustering. The application is interesting and novel.\nThe authors indicate they will release source code.\n\nWeaknesses\n----------------\nThe paper does not contain a sufficiently detailed explanation of the underlying algorithm, and how the parameters are learned. Most of the discussion around related work is on determining voice characteristics and measuring the quality of data-driven voice representations, there is little discussion of machine learning algorithms. For ICLR audiences, it would be beneficial to expand the discussion of related work in ML.\nIt would be useful to provide examples of the labels used, and how they get refined during the process. As written, the description of the paper is very abstract, but I have little intuition as to how the procedure works.\nThe paper compares the results to a previous paper (Quillot, 2021b), and states that the proposed method achieves SoTA performance. It would be useful to include an ablation study and discuss in more detail how the approaches taken in these two papers differ, and how the design choices influence performance. The paper presents the main experiments as a series of pragmatic choices, but I am not sure if the proposed architecture has already been applied to other problems, and/ or if other choices would yield better results?\nI am not sure if the data is available, so that the released source code could actually be run and the results could be reproduced?",
            "summary_of_the_review": "The paper presents an interesting and well-justified task, but in the present form it is most suitable to a domain specific (applied) venue, rather than a more general conference such as ICLR. Because of missing comparisons and ablations, there is little information in the paper that I am confident can be generalized to other tasks and/ or problems, so I am not sure the paper will be valuable to someone not working in that field. ",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "The paper tackles a voice similarity system task for voice casting problem. The authors trained voice embedding network using voice character label and cluster the embedding features and used these clusters to train final voice embedding network. The introduction is well-written, however, the proposed method is known or marginal improvements from the existing technical skill in machine learning community (pseudo labeling with embedding feature clustering).",
            "main_review": "Pseudo labeling or iterative training with embedding feature clustering might be of related works.\n\nAlso, the author argues that the explainability of the voice recommendation system is important, however, the proposed model cannot give the controllability to the user.\n\nBackbone network is not well explained.\n\nLoss function of the siamese network used in the paper is not specified.\n\nTraining details are missing.",
            "summary_of_the_review": "The problem definition seems interesting and the application the authors tackling (voice search system for voice casting) sounds interesting (introduction is well-written), however, the proposed method seems not enough novel and some details of the experimental setup is missing.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        }
    ]
}