{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Reject",
        "comment": "The paper uses neural networks for system identification.  The novelty of its contributions seems to be marginal, and the demonstration of its usefulness is not experimentally validated well enough."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "This paper proposes a new system identification and model predictive control method based on neural networks for non-linear dynamical systems. The basic idea behind the proposed method comes from subspace identification for linear systems. In this sense, the proposed method can be regarded as a non-linear extension of subspace identification by deep neural networks.",
            "main_review": "This paper proposes a non-linear extension of subspace identification and model predictive control. The idea of estimating the latent state vector $\\hat{\\boldsymbol{x}}_t$ using the bottleneck structure of estimator and predictor networks seems reasonable. The result of the experiment on a toy problem shows the proposed method works.\n\nI have several comments and questions as follows.\n\n1. While this study focuses on the system identification of non-linear systems based on the subspace identification, other recent works on learning non-linear dynamical systems using deep neural networks such as KVAE and Deep State Space Models should be referred as related works.\n\n2. The authors conducted a case study on cascaded tanks system which is a simple low-dimensional non-linear system. It is illustrative, but I think they should start with some linear systems and linear networks and show that the obtained result is equivalent to that of ordinary subspace identification and MPC. That would justify their claim in a straightforward manner.\n\n3. In the training process, the system is provided with random input sequence in Eq.(24). I wonder if it is possible in general. What if the system becomes unstable due to some inadequate inputs ? Is there a way of \"safe\" training ?\n\n4. In the case study, Levenberg-Marquardt algorithm is used solve the optimization in MPC. Is LM applicable to other systems in general ?\n\n5. In Figure 2, estimated state vector $\\hat{\\boldsymbol{x}}_t$ should be also shown and compared with actual state $\\boldsymbol{x}_t$. I am curious how $\\hat{\\boldsymbol{x}}_t$ looks like and different from $\\boldsymbol{x}_t$ due to the non-linear mapping.\n\n6. Is the proposed method applicable to more high-dimensional non-linear systems ?  For example, can it perform system identification and MPC of a non-linear system using a sequence of images as observation ?\n\n\n",
            "summary_of_the_review": "This paper proposes a non-linear extension of subspace identification and model predictive control. The idea is interesting and theoretically sound. I like this study. The case study using a simple non-linear system is not convincing enough. ",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "The authors are proposing to use DNN to approximate observers and predictors for nonlinear systems. No convergence analysis of the 'said' observers are given. The empirical results are rather weak.",
            "main_review": "The idea of using a DNN to approximate state observers and predictors for general nonlinear systems is re-examined here.\nThe idea is not novel, since it has been used in Masti et al, CDC 2018. The  discussion added here about the linear case is trivial, and hardly counts as a theoretical analysis, as the authors are claiming. As for 'Theorems' 1, 2, they are trivial and cannot be claimed as theorem. I mean the statement ' if the system is observable, then an observer exists', is hardly a Theorem !\n\nI keep wondering how a dynamical system, i.e., and observer and predictor, can be approximated by a static mapping ? ! \nIn other words, can you prove that your observer converges asymptotically (over time beyond your training time span) to the true state, for a set of initial conditions ? this is a very basic property of any observer, in the sense on control theory, and if you do not have this 'robustness' w.r.t. state initial conditions, then this is merely and open loop identification problem, or model reduction, or give it any name you want, but do not call it state estimation problem.\n\nI think this is even clear from your toy example, where there are no tests showing that if you start the simulation from several different initial conditions for the states, you still converge to the true state trajectories.",
            "summary_of_the_review": "It is not technically correct to assume obtaining an observer, i.e., a dynamical system, from a static DNN mapping. The technical point of robustness w.r.t. changes in the state initial conditions is at the core of observers theory and cannot be ignored. \nTheoretically the paper empty, and the empirical validation is too simple.",
            "correctness": "1: The main claims of the paper are incorrect or not at all supported by theory or empirical results.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "details_of_ethics_concerns": "None.",
            "recommendation": "3: reject, not good enough",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        },
        {
            "summary_of_the_paper": "The authors introduce a system identification methodology catered towards the model predictive approach. They claim that the main contribution is that the neural network, which is used, has a bottleneck layer and represents input-output dynamics. They also provide a connection to the subspace state-space system identification method for linear dynamical systems. ",
            "main_review": "Strengths:\nI find the interpretation for the bottleneck layer interesting. I also find the connection to the subspace identification for linear systems interesting and insightful.\n\nWeaknesses:\nI am not convinced, based on what is provided, how efficient the methodology is. Maybe some convergence characterization for a class of simpler nonlinear dynamical systems would help illustrating the efficiency. The paper is not technically deep and in terms of dynamical systems not coherent. The example is only two dimensional and relatively simple.\n",
            "summary_of_the_review": "Overall, the paper has some interesting results yet lacks technical and experimental arguments to justify the benefits of the approach.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "details_of_ethics_concerns": "No concerns.",
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        }
    ]
}