{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Reject",
        "comment": "Four experts reviewed this paper and all recommended rejection. There was no rebuttal. The reviewers raised many concerns regarding the paper, such as missed citations, lack of comparison with related methods, and some presentation issues. Considering the reviewers' concerns, we regret that the paper cannot be recommended for acceptance at this time.  The authors are encouraged to consider the reviewers' comments when revising the paper for submission elsewhere."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "In this paper, the Adaptive Focus Framework (AF2), which adopts a hierarchical segmentation procedure and focuses on adaptively utilizing multiscale representations generated by widely adopted neural network architectures, is proposed. Particularly, a learnable module, called Adaptive Confidence Mechanism (ACM), is proposed to determine which scale of representation should be used for the segmentation of different objects.",
            "main_review": "\nThis paper proposes  Adaptive Focus Framework (AF2) to deal with semantic segmentation task of aerial imagery. The strengths of this paper is that the writing is clear and easy to understand. The structure of this paper is ok. The weakness is that the idea is simple and not novel enough. In addition, the experiments cannot verify the effectiveness of the proposed method.",
            "summary_of_the_review": "The proposed AF2 tries to solve HSR aerial imagery semantic segmentation by making use of multi-scale representations. The whole  Adaptive Focus Framework (AF2) is simple, including Hierarchical features extractor, Preliminary predictor and Adaptive confidence mechanism for prediction selection (ACM).  \nAs the first two modules are popular in semantic segmentation and other related works, the main contribution of this work is the proposed ACM, which judges whether the prediction for each pixel is sufficiently confident or not in each level.  But actually, the proposed ACM is simple lacking novelty. The experiments in this work cannot verify the effectiveness of proposed method solidly. In Table 1, AF2-AFPN brings slightly better performance compared with PointFlow. On Potsdam, its performance is even worse. For general segmentation benchmark, only SFPN method is reported and compared, but in PointFlow, it has mIoU 80.3% on Cityscape. \n\nAll in all, i think this paper is not novel and solid enough to be accepted by ICLR.\n ",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "details_of_ethics_concerns": "No ethics concerns",
            "recommendation": "3: reject, not good enough",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This paper proposes a hierarchical segmentation procedure for aerial imagery semantic segmentation. The proposed method adaptively filters pixels in each scale representation by dynamically adjusting the filtering confidence to decide pixels will be segmented by the next level. Experiments have shown the proposed method can boost existing model architectures' performance to achieve SotA on several datasets.",
            "main_review": "1. To my understanding, this paper essentially proposes a new strategy to merge multi-scale predictions, by choosing the high-confidence output of earlier levels, and passing low-confidence output to downstream levels. Similar strategy could be seen as early as Viola-Jones cascade classifier, but in the domain of semantic segmentation, I do not remember seeing similar design, so in that sense this paper does have some small novelty, though it's incremental.\n\n2. That said, the ideas of merging multi-scale predictions in semantic segmentation have already been studied in many existing work, from the early FCN [1], to more focused studies on this such as [2] and [3]. The proposed AF2 can be considered a hand-crafted strategy to decide which output scale to take, which could be better than naive method like average-pooling, but I'm not convinced it will work better than learnable attention such as in [2].\n\n   2.1. Even comparing to max-pooling, it's possible that AF2 will settle on one class in early scale after passing the threshold, but later scale may reveal an even higher confidence from a different class.\n\n   2.2. The main problem of the paper is it failed to compare to any of these multi-scale merging strategy. For example, [2] claimed the attention method can boost baseline model result by 6%, which is higher than AF2's boost on AFPN (these are not really comparable due to different settings, but I meant the paper should have a fair comparison on this aspect).\n\n   - [1] Fully Convolutional Networks for Semantic Segmentation, CVPR 2015\n\n   - [2] Attention to Scale: Scale-aware Semantic Image Segmentation, CVPR 2016\n\n   - [3] Hierarchical Multi-Scale Attention for Semantic Segmentation, 2020\n\n3. Besides, a few other issues or questions of the paper:\n\n   3.1. The paper highlights the \"adaptive\" threshold and claims top-k won't be effective on aerial images, but there is no experiment designed specifically to validate how much improvements the adaptive mechanism can bring over baselines like fixed threshold or top-k.\n\n   3.2. How is the \"soft update factor\" in Eq.(3) decided?\n\n   3.3. Is r set to a fixed value for experiments on all datasets?\n\n   3.4. In Sec. 4.3, the paper states \"This hierarchical prediction method is independent to the proportion of foreground and background and thus can effectively solve the problems existed in the previous method.\" - I don't understand the logic here. I agree the hierarchical design is independent to the foreground/background ratio, but then how can it also help solving imbalance issue if they're independent?",
            "summary_of_the_review": "The paper proposed a method to selectively merge multi-scale predictions, but failed to compare to any other methods aiming for similar goal (e.g. max-pooling, attention). There is no experiment to validate the \"adaptive\" design of the mechanism either (compared to fixed threshold or top-k). Therefore, I recommend reject.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This paper propose Adaptive Focus Framework (AF2), which adopts a hierarchical segmentation procedure and focuses on adaptively utilizing multiscale representations generated by widely adopted neural network architectures.\nThe main contribution is a learnable module, called Adaptive Confidence Mechanism (ACM) to determine which scale of representation should be used for the segmentation of different objects. The method achieves the state-of-the-art results on two ariel datasets(iSAID, Vaihingen).",
            "main_review": "Strong Points:\n\n1,  The paper is easy to follow and understanding.\n2,  The proposed methods achieve the state-of-the-art results on two ariel datasets(iSAID, Vaihingen).\n\n\nWeakness:\nSorted by the importance.  Here are the details:\n\n1, Several related works are not cited and compared.  These work may decrease the novelty of this paper. \nThe difference of this work and these dynamic network only lies on the prediction source.\nThis work adpot the predictions as route gating which are used in [1][2][3][4].\n\n[1] Learning Dynamic Routing for Semantic Segmentation CVPR-2020\n[2] Fine-Grained Dynamic Head for Object Detection NIPS-2020\n[3] Dynamic Routing Networks arxiv-2019 \n[4] Improving Video Instance Segmentation via Temporal Pyramid Routing arxiv-2021\n\nUsing predictions for further refine is not very novel and may bring extra computation cost.\n\n\n2, Several statements are not true. \n\"e.g. PointFlow, is not available yet\"\nI search for the Github. https://github.com/lxtGH/PFSegNets This work is already opensourced about half year ago.\n\n\n3, Several statements are not necessary which may be decribed in short sentences.\n\nSec.3.1 and Sec.3.4 may be not necessary since these are the common knowledges for segmentation. \n\n4,  Several detailed design are missing. The choices of ASPP should be claimed. \nWhy use ASPP in the head?\nWhat about the GFlops and FPS of proposed methods?\nWhat is the baseline in Tab3?\n\n5, What about the generalization of Adaptive Confidence Mechanism? Will it still work well on other scene understanding tasks or datasets?\nIf not, it may be not suitable for the ICLR submission.\n\n ",
            "summary_of_the_review": "Compared with exsiting methods on scene understanding, the proposed Adaptive Confidence Mechanism is little weak.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        },
        {
            "summary_of_the_paper": "This paper proposes a pipeline for image segmentation. The  approach is validated  experimentally for remote sensing applications.\nA hierarchical segmentation procedure corresponding to a Feature Pyramid Networks (FPN) with Atrous  Spatial Pyramid is used.\n A preliminary detector take advantage of these feature maps for each resolution level (=layer) for computing class prediction to each pixel. In addition a confidence measurement to each pixel level prediction is also computed (Adaptive confidence mechanism).\nThe architecture is optimized using the cross entropy.\nResults show that the proposed pipeline improves the mIoU  scores compared to the state of the art techniques on three standard dataset.\n",
            "main_review": "\nThe strength of the approach is that experimental results show improvement against state of  the art for mIoU score.\nIntuitively a multi-resolution approach (pyramid) to segment objects of various size is sound. \n\nHowever the paper lacks clarity and coherence:\n- foreground/background are mentioned extensively in the paper but these are not defined. How are these relating to the classes defined with the dataset used in the experiments?\n- class imbalance (between foreground/ background )   is mentioned as an issue in the abstract but it is unclear how this method addresses class imbalance.\n- the abstract also indicates that many techniques \"disregard the fact that the semantic meaning of objects with various sizes could be better identified via receptive fields of diverse ranges\" but it is unclear how the presented work addresses this shortcoming:  how semantic meaning of objects and association with size is used in the proposed pipeline? What are the objects segmented ? how are their real sizes translating into number of  pixels in the dataset used (  in aerial images are geolocated and correspond to an area (e.g. pixel == 50cm x 50cm) ) and relation to receptive fields of filters used?   In the results reported what objects correspond to \"small object\" and \"large object\" (e.g. a few objects are mentioned in Tab 1 , and as well in Tab.5)? \n- Several sentences lack clarity e.g.  \"For instance, pixels in complicated images usually have low confidence, while pixels in simple images have relatively higher confidence.\" What is a simple/complicated image?\n- mathematics are difficult to follow e.g. Eq 3\n",
            "summary_of_the_review": "\nThe proposed method looks promising in improving segmentation results in remote sensing application. \nHowever clarity has to be improved.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        }
    ]
}