{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Reject",
        "comment": "This paper received scores of 6,6,6 after the reviewers succeeded in making two authors raise their scores from 5 to 6. However, even after this, none of the reviewers actively argued for the paper. The only positive point raised in the private discussion was that the results are strong. (However, there is still the question of how much of this was due to the different design space used.)\nNegative points raised in the private discussion included that \n- despite the authors clarification on the differences to Zen-NAS, the difference is perceived not to be large.\n- there is no theoretical foundation behind the selection of a critical parameter, and this directly limits the applicability of ZenDet in searching for FPN connections. \n- as a paper focused on detection NAS, a limitation to only search for the backbone may not be novel enough for publication at ICLR. \n\nOverall, I agree with this criticism and weakly recommend rejection."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "Detection backbones usually cost a lot. With a novel zero-shot NAS method proposed in this work, named ZenDet, detection tasks can free from the heavy models, time, and resources to archive SOTA performance.",
            "main_review": "Strengths:\n1. Saving lots of time and memory for searching architecture for a competitive backbone.\n2. Archiving SOTA performance in effective benchmark datasets, especially good performance on COCO 2017 dataset.\n3. Benefit from Multi-Scale Entropy Prior, ZenDet can adapt different sizes of objects, and results of training from scratch.\n4. In segmentation tasks, ZenDet also outperforms well.\n\nWeakness:\n1. No experiments for comparision of SOTA method in Instance Segmentation and results of training from scratch.\n2. Existing some spelling mistakes，such as retianet->retinanet.\n\n\nWhat are the failure modes of the proposed msep method?",
            "summary_of_the_review": "see main review",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This paper proposes a zero-shot neural architecture search approach for backbone design in object detection. The idea is to compute an entropy-based multi-scale Zen-score and use the score as an objective for evolutionary architecture search. The paper achieves better results comparing with previous zero-shot NAS approaches on object detection and greatly reduces the search time of conventional NAS approaches while maintaining similar accuracy.",
            "main_review": "Here are some strengths and weaknesses for this submission:\n\n**Strengths:**\n\n+ This paper is clearly written and easy to follow.\n+ The proposed method should be fairly easy to implement, and it is appreciated that the authors promise to open source their implementation if the paper is eventually accepted.\n+ The paper focuses on a very important aspect in real-world deployment of NAS algorithms: the search cost, and provides an effective solution.\n+ The experiments are done mainly on large-scale datasets.\n\n**Weaknesses:**\n\nI. Methodology\n\n+ The paper seems to be largely based on Zen-NAS. I feel that only Section 4.2 of this paper is novel and it seems that the effectiveness is not well justified:\n    - How do you choose the weights $\\alpha$? \n    - It seems that such choice impact the final performance a lot. A bad set of $\\alpha$ cannot even outperform manually designed R50. What is the theoretical implication / insight of the current parameter choice?\n+ In general the paper mainly justifies their results on accuracy-based ablation studies and comparisons with previous methods. But for me I'm more interested the effectiveness of multi-scale Zen-Score itself.\n    - I did not see any ablation analysis studying the correlation between Zen-Score and accuracy of different networks within the design space. \n    - I'm also curious whether multi-scale Zen-Score can improve the correlation comparing with single-scale Zen-Score.\n    - It will be great if there are some comparisons between ZenDet and one-shot NAS methods in terms of rank preserving.\n+ It is well-known that searching the architecture of FPN can also potentially improve the efficienty-accuracy tradeoff of object detectors. I'm curious whether the Zen-Det approach can also be utilized to search for complex connections in the FPN architecture. \n+ It'll also be great if the authors can have a small discussion on whether Zen-Det can be applied to recent transformer-based detectors.\n+ Removing auxiliary layers such as SE during search and adding them back during training/inference seem to be ad-hoc and not well justified.\n\nII. Experiments\n\n+ The paper is focused on the ResNet design space, which is shown to be efficient on desktop GPUs. However, it seems that results on edge GPUs or CPUs are missing. This makes the experiment part of this paper rather weak comparing with existing work (ZenNAS).\n+ Some comparisons are not quite fair / clear in the experiment section:\n    - Table 4 claims that the Zen-NAS performance is 38.1 mAP, but in Table 5 it seems that the single-scale version of ZenDet (which I think is exactly Zen-NAS) has 38.8 mAP. This makes me a little bit confused.\n    - The comparison between DetNAS and Zen-Det does not seem to be completely fair. The design space is different. Would it be possible to supplement some results on their design space and justify the effectiveness of ZenDet? \n+ The optimization target for this paper is FLOPs, but I think targeting latency will be better (and I don't think the change of optimization target will significantly influence the current algorithm pipeline).\n    - A natural question related to latency as the optimization target: how well will simpler zero-shot NAS metric work? For example, given a latency budget, if we just randomly select networks whose FLOPs are higher than one certain threshold, will the result be competitive comparing with ZenDet? It will be interesting to present the results on both desktop GPUs and edge devices.",
            "summary_of_the_review": "Overall I think this paper presents promising preliminary results on zero-shot neural architecture search for object detection. However, the novelty seems to be limited (comparing with Zen-NAS) and the experiments don't seem to be thorough enough. These downsides prevent me from recommending acceptance at the current stage. However, I'll be glad to raise my score if my concerns are addressed properly during the author response period.\n\n====\n\nPost-rebuttal update: I decided to raise the score to 6 based on the empirical results presented in this paper. I still think the novelty comparing with Zen-NAS is not that large and the challenges of the current approach (e.g. cannot deal with complex connections in the FPN, basically can only search for relatively simple backbones) prevents me from assigning an even higher score to this paper.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "In this paper, the authors propose a zero-shot NAS to search backbone for detection task. Specifically, this method uses the differential entropy of output features as a metric to measure the performance of architecture on detection task. With the differential entropy , this method does not need training network parameters, reducing the search cost largely. Also, the backbones searched by this method have the state-of-the-art performance on detection task.",
            "main_review": "Strengths\n- The proposed method is simple and efficient. This method reduces the search cost largely and speeds up searching. \n- This paper is well written and readable.\n\nWeaknesses\n- In the experiments, the authors valid the effectiveness of the proposed method on the ResNet Block search space. Could you provide some experiments on other search spaces to validate the generalization of this method?\n- During the search stage, residual link, BN and SE are all removed. To my knowledge, these components have some effects on feature variance. Thus, the entropy score based on feature variance can not reflect the performance of networks accurately when removing these components. Further, the network searched by this method may be suboptimal. Could you explain why removing these components?\n- In this paper, the smallest backbones searched by this method is ZenDet-S. Due to the limit of edge devices, the detectors with ZenDet-S can not run fast. This raise a question: can this method search some networks for edge devices?\n- From Table 5, comparing the row1 and row2, the metric with single-scale score does not outperform the metric with multi-scale score largely. This demonstrates the proposed method does not deeply entangle with detection task. Thus, could you provide an experiment on NAS-Bench-201?\n- In Figure 2, there are little details about the search space. Could you provide more details about the search space?",
            "summary_of_the_review": "I appreciate the contribution of this paper, but I prefer to reject this paper for the above weaknesses. If the authors solve my concerns, I would like to raise my rate.\n\n==Final Decision==\\\nThe author's feedback has resolved my concerns except the ranking. Though the author did not resolve ranking concern, I decide to raise score to 6. I hope the authors would provide the results about how the multi-scale weight ratio affect the correlation for more heads in the final paper.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        }
    ]
}