{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Reject",
        "comment": "In spite of some slightly mixed scores (with one borderline positive review), scores are ultimately lukewarm and tend toward negative (and furthermore, reviews are broadly in agreement as to the issues they raise). Main issues center around low significance of the results, and issues with the presentation that need to be addressed."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "The paper studies how to use location information (geographical location) of images to help with image classification tasks. The paper studies use of spherical based location over GPS lat long and argues that the euclidean space does not preserve distances and has distortions whereas a spherical coordinate approach would not have the inherent problem. The approach demonstrates a framework to train the location encoding in an unsupervised way to with losses based on representation learning approaches. The paper studies multiple ways of expanding the spherical coordinates and evaluates their performance and empirically demonstrate the strength in their performance. ",
            "main_review": "Strengths:\n1) The approach is demonstrated to be better than the previous method both qualitatively and quantitatively. \n2) Description of the losses and algorithms were fairly complete with minor errors.\n3) Good references on topics beyond CV/DL papers.\n\n\nWeaknesses:\n1) Paper was slightly harder read and some useful information such as the definition of the studied approaches were left in the appendices. Reordering the information in the text would help here.\n2) Most of the gains come from the framework over the spherical coordinate approach. This seems reasonable as using spherical coordinates over euclidean coordinates doesn't seem to be something a few layers of networks can't learn easily. 3\n3) Some errors in the text:    \n    a) In practice it help with --> helps with\n    b) Eq. 6: second term in the second line seems to have errors\n    c) Supervised Fine-Turning --> Fine-tuning\n    d) \\delta MRR was not defined in the text\n \n",
            "summary_of_the_review": "Paper proposes a framework and uses spherical coordinates over encoding method to help with geo-aware image classification. The paper propose the title of sphere2vec for novelty but the main improvements to the method is not with the encoding but with the framework itself. For readers, it would be a slightly disappointing results if the reader is reviewing spherical coordinate as an approach. As a paper, the results does show improvements through the framework, in the form of representation learning. Thus, the recommendation is a marginally below acceptance threshold.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "details_of_ethics_concerns": "None",
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "This paper proposes a strategy for learning a location embedding (i.e., translating lat/lon into a useful high-dimensional vector). The idea is to first encode the location into the double Fourier sphere basis (or a subset) and then pass this through a multilayer perceptron. Several alternatives to the first stage are evaluated.\n\nTwo stages of training are proposed:\n1) Weakly Supervised Pre-Training: use a contrastive loss to train the embedding by comparing it to features extracted from geotagged images. The idea is that a good location embedding should be sufficient to recognize whether a given image was captured in that location.\n2) Supervised Fine-Tuning: given a geotagged image, extract image and location features, combine them to predict the image classification label.\n\nThe approach is demonstrated on several geo-aware image classification applications. The idea with these applications is that combining image features with the location embedding is sometimes enough to resolve ambiguity from the image alone.",
            "main_review": "Positives:\n\n- I think the problem setting, geo-aware image classification, is interesting and I haven't seen a lot of work exploring the issue of encoding geographic location, which has some clear challenges.\n- There are quite a few datasets and baselines used in the comparison.\n\nNegatives:\n\n- Table 1 shows that the effect size is relatively small. The proposed approach isn't clearly worse than others, but it doesn't seem to make a major difference. \n\n- The core method is composed of several components (the initial encoding, the MLP, and self-supervised pre-training). However, the only thing that is varied is the initial encoding. This leaves open the question of how changes to the other components would impact the metrics. It could be that a slightly deeper or shallower MLP would change which method is the best. The paper claims that many aspects were fixed to provide a fair evaluation, but this often hides the fact that the proposed contribution is only superior given the particular settings, and not that significant overall.\n\n- It is claimed that \"grid ... performs poorly at a global scale due to its inability to preserve spherical distances\" and provides a proof. However, the quantitative metrics show that grid performs about as well as the proposed method. \n\n- The presentation needs significant improvement. Some figures are too small (Fig 4) or have labels that are too small (Fig 5). Also, see below for grammar issues. There are important details that aren't described well, for example, what exactly is the MLP? How sensitive are the results to the hyperparameters of the MLP?\n\n- Section 5.1: it is argued that \"wrap and grid have over generalization issue in data sparse area\" and that the proposed method provides better results. It's unclear why this is the case. Much of the theoretical justification relies on the fact that the proposed approach preserves spherical distances, but the connection between that preservation and the differences between the methods isn't made strongly enough.\n\nMinor Comments:\n\n- I would have liked to have seen a comparison to the conversion of lat/lon into x,y,z coordinates using something like earth-centered, earth fixed coordinates.\n\n- There are numerous small grammatical errors. They didn't distract from clarity, but it needs significant improvement. Here are a few from the paper (but there are others and quite a few in the supplemental as well):\n   - \"may provide clue to their real classes\" -> \"may provide a clue to their real classes\"\n   - \"data parse areas\" -> \"data sparse areas\"\n   - \"Despite of its effectiveness\" -> \"Despite its effectiveness\"\n   - \"distance reserving\" -> \"distance preserving\"\n   - \"identities base on their\" -> \"identities based on their\"\n   - \"are public available\" -> \"are publicly available\"\n   - There are many more in the supplemental.\n\n- It seems like there are too many important details left to the appendix, including defining a key loss component \"simcse\", which isn't defined until 9.11.\n\n- It might be worth including a reference to http://bmvc2018.org/contents/papers/0586.pdf (Section 3.1), which proposes an approach to learning a location embedding in conjunction with geo-tagged ground-level images. This is like the first stage of training in the proposed method but requires a known timestamp.\n",
            "summary_of_the_review": "I don't think this paper is suitable in its current state. The experimental results show a small effect size and it's unclear how stable the results are to changes in the MLP, and other components. There is also a weak connection between some of the stated benefits (preserving spherical distances) and the actual benefits. It's entirely possible that the proposed methods are better in some settings for some other reason.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This paper explores developing location encodings for spherical\nsurfaces and their application to tasks in geo-aware image\nclassification. The authors propose a method for encoding spherical\nlocations into a higher dimensional space (based on Double Fourier\nSphere) that preserves distances. The proposed method, referred to as\nSphere2Vec, is demonstrated for three tasks and evaluated using seven\ndatasets. In addition, a self-supervised method is proposed for using\nunlabeled data to pretrain the location encoder.  This self-supervised\npretraining stage is shown to improve performance, especially when\navailable labeled data is limited.",
            "main_review": "Positives\n\n  - how to integrate contextual information, e.g., location, as part\n    of vision pipelines is an interesting and challenging problem, with\n    demonstrated performance improvements on various tasks (e.g., fine-grained\n    species classification)\n\n  - the authors propose a novel multi-scale method for encoding\n    spherical coordinates (several variants) based on Double Fourier\n    Sphere, including an analysis of the distance preserving quality in\n    the supplemental\n\n  - results show consistent improvements over baselines on seven different\n    datasets\n\n  - extensive experiments, including ablation studies of various\n    components in the supplemental material\n\n  - the self-supervised component, for pretraining the location\n    encoder using unlabeled data, is shown to be useful in scenarios\n    where there is limited labeled data\n\n\nNegatives\n\n  -  grammatical errors throughout\n\n    For example, I believe the first contribution in Section 1 should be \"distance preserving\" instead of \"distant reserving\".\n\n  - missing details\n\n    Section 3.2 has some elements whose description could be expanded\n    on. For example, the notation for omitting terms of the loss\n    function. Another example would be the linear projection layer\n    that is mentioned only once in passing (and shown in Figure 1).\n    Further, implementation details (optimizer, learning rate schedule,\n    hardware, etc.) seem to be missing or relegated to the supplemental.\n\n  - though the results are impressive, it is not clear from the\n    results which version of Sphere2Vec (from the proposed variants)\n    should be used in which scenario (in other words, there is no\n    consistent winner)\n\n  - the self-supervised component of the proposed approach\n    appears to be limited to a pretraining strategy, with results\n    showing it useful only when there is limited labeled data",
            "summary_of_the_review": "  This paper explores two important problems: 1) given a geotagged\n  image, how to encode location information and incorporate it as\n  context in existing image processing pipelines, and 2) how to take\n  advantage of a large corpus of images with known geolocation, that\n  are not annotated (unlabeled) for the primary task. Specifically,\n  this paper explores how to encode geospatial information in the form\n  of spherical coordinates.\n\n  For several tasks in geo-aware image classification, the\n  proposed multi-scale spherical location encoder outperforms\n  baselines. However, the proposed self-supervised method for\n  incorporating unlabeled geotagged imagery is limited to a pretraining\n  strategy when there is limited labeled data. Additionally, several\n  variants of the method are proposed, and it is not clear what variant\n  to use when.\n\n  Ultimately, I think this paper tackles an important problem and\n  demonstrates the general applicability of the method. While the\n  manuscript has minor errors throughout and some missing details, I\n  lean towards accept for my initial rating.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This paper proposes a positional embedding method for GPS coordinates, which lie on a sphere.\n\nBased on the Double Fourier Sphere, this paper proposes a family of encoding methods and show their effectiveness.\n\nThis paper also gives a family of loss functions to enable self-supervised training.",
            "main_review": "Strengths:\n\nIt's interesting to have a positional encoding method for spherical coordinates, which could have potentials for many other tasks.\n\nWeaknesses:\n\n1) Though the idea is interesting,  I would propose an alternative for embedding GPS coordinates. Would you please discuss it or add it as a baseline?\n\nGiven GPS coordinates, we can first transform them to an Earth-centered, Earth-fixed coordinate system, which is a Cartesian coordinate system. Using a simple MLP or (sin/cos) to encode these Cartesian coordinates to the network and check the performance.\n\n2) From Table 1, it seems the proposed method marginally improves previous methods. \n\n3) From the introduction section and Figure 2, it seems the assumption of \"assume I and x are conditionally independent given y\" does not hold since I and x co-exist.\n\n4) Equation 1. Why do we need to enforce that \"multi-scale representation of x preserves the spherical surface distance\"? Would you please add some motivations? From the tasks (Figure 2) listed in this paper, I would assume the GPS coordinates are distributed sparsely. Pairwise spherical surface distance may vary on a large scale and is noisy. Do we really need this constraint?",
            "summary_of_the_review": "While I like this work and it proposes an interesting positional encoding method for spherical coordinates, I would like to see the authors' reply for the weaknesses to make further decisions.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        }
    ]
}