{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Reject",
        "comment": "Reviewers agree that the paper is well-motivated and the proposed method is somewhat interesting and well-experimented. However, reviewers feel that the paper relies on many existing methods and does not appear to be novel enough."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "The paper presents a new way of molecular optimization that is based on chemical fragments. The authors employ VQ-VAE to encode a fragment library in a coherent latent space. They argue that this method produces more diverse rationales than a Gaussian VAE. The proposed generative method uses reinforcement learning (PPO) to select modifications of the chemical structure: a fragment decoded by VQ-VAE is added at a chosen attachment point, or a part of the compound is removed. The model retains only modifications that fulfill initial constraints regarding the novelty, diversity, and chemical properties of a generated molecule measured by formerly trained predictive models. The experiments show significantly better performance of the proposed FaST model compared to a diverse set of baseline models.",
            "main_review": "Pros:\n- VQ-VAE is a natural model for encoding discrete objects and produces more diverse structures, which is confirmed by t-SNE plots.\n- The authors use Upper Confidence Bound (UCB) to sample compounds effectively and accelerate the search of compounds with optimized properties.\n- There is an interesting discussion on the usability of logP optimization and the flaws of measuring compound similarity using molecular fingerprints.\n\nCons:\n- The text structure is very similar to the MARS paper, and there is an apparent similarity between these two methods, although there are some significant changes.\n- One of the similarities is the main results table, which includes metrics that do not correctly emphasize the superiority of one method above others. The success rate (SR), which should be the main objective, is equal (almost) 1 for many models, so it is difficult to say if one method is significantly better than others.\n- Besides SR, other metrics describe the novelty and diversity of the generated compounds. These metrics are directly optimized by the proposed model. Are other methods in the comparison trained so that these metrics are maximized? If not, then it is not surprising that FaST wins in this competition. Also, the last metric, PM, is the product of all the other metrics, so suboptimal diversity or novelty scores of other models negatively impact the scoring.\n- To confirm the usefulness of the model, a different comparison should be proposed, or more biological targets should be added. One idea would be to create a benchmark that uses uncertainty prediction models. This way, the novel compounds that cannot be reliably predicted by the activity models would be discarded.\n- In Section 4, some claims are not supported experimentally in the paper: \n  - \"we find that using a VQ-VAE with a categorical prior instead of the typical Gaussian prior makes RL training stable and provides good performance gains\" - the FaST variant with the Gaussian prior should be included in the results table,\n  - \"we find the SELFIES decoder works well empirically\" - this could be further discussed in the ablation studies.\n- More examples of generated compounds would be welcome.\n\nOther comments:\n- In the paragraph about VQ-VAE in Section 3, should it not be $k^d$ instead of $d^k$ distinct fragments?\n- typos: \"specify the the molecule to keep\"",
            "summary_of_the_review": "Based on the above comments, I currently recommend rejecting this paper. The novelty of the work lies in incremental changes to existing methods, and I think the modifications are substantial. However, the experiments, in my opinion, do not demonstrate well the impact of these changes.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This paper proposes a new reinforcement learning method for molecular optimization. They train VQ-VAE to learn the vocabulary of molecular fragments which enables the optimizer to efficiently search the chemical space. The optimizer consisted of general reinforcement learning and MPNN, and devised sampling schemes to improve performance. By integrating evaluation criteria as a reward function, the proposed model can additionally improve the performance in terms of those criteria. The experiments show not only its superior performance but shorter optimization time.\n",
            "main_review": "Strength:\n1. The proposed model outperforms other baselines in the multi-objective molecules optimization benchmark. \n2. Applying VQ-VAE into molecular fragment vocab learning is a properly motivated hypothesis and empirically well-validated. \n3. MolDQN[1] and CMG[2] are other multi-objective optimization models. Better to include them at least in the related work.\n\n[1] Zhou, Zhenpeng, et al. \"Optimization of molecules via deep reinforcement learning.\" Scientific Reports 9.1 (2019): 1-10.\n[2] Shin, Bonggun, et al. \"Controlled molecule generator for optimizing multiple chemical properties.\" Proceedings of the Conference on Health, Inference, and Learning. 2021.\n\n\nWeakness:\n1. In the Encoder/Decoder section on page 4, the authors claimed as \"we ﬁnd the SELFIES decoder works well empirically\". It's not convincing why they choose to use the SELFIES decoder. It'd be good if it's well-motivated and empirically shown. \n2. Minor typo: In eq (6), the outer parenthesis of the diversity may be before the \"<\" sign?\n3. The overall framework is novel, however, it relies on many known methods.",
            "summary_of_the_review": " Overall it is a well-written paper with good motivation, appropriate method, and supportive experiments. The overall framework is novel, however, it relies on many existing methods.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This paper proposes to perform molecular optimization by sequential translation. A reinforcement learning policy is employed to increase the diversity of the generated molecules. The proposed method is shown to be able to generate high-quality molecules on single-property and multi-property optimization tasks. The paper is well written and easy to follow.",
            "main_review": "Combing variational auto-encoders and RL policy for fragment-based molecular optimization gives a good practical performance, but the novelty contribution is marginal. Their method of encoding fragments into latent space is not particularly novel and has been applied in other works for similar tasks (e.g. [1][2][3]). Fragment-based drug design is also a very common approach that has been widely explored for a long while from the cheminformatics community, and there is nothing unique about the fragmentation or the definition of molecular editing action in this work (For example, there are three editing actions defined in [4] and seven in [5] ). The diversity-aware reinforcement learning methods are also common in NLP community [6]. FaST introduces a similarity regularization in the reward function to increase the diversity, which makes a little sense but makes it easy for the model to fool your defined metrics (the difference between AP-based and Morgan-based similarity calculations isn't that great). Such a high level of Nov. and SR. is not proof that your model really works, but rather more like some leakage has occurred, as you did with Table 2 in Appendix B (this experiment actually makes a lot of sense, as the logP task has always been considered less suitable for evaluating molecular optimization). \n\nMinor\n1.\tIt would be better if the authors provide a more intuitive and clear illustration of the motivation of introducing each module in the model (e.g. the VQ-VAE).\n2.\tFigure 1 is confusing, why does the arrow at the bottom point to a blank space?\n\n\n\n[1] Bradshaw, John, et al. \"Barking up the right tree: an approach to search over molecule synthesis dags.\" arXiv preprint arXiv:2012.11522 (2020).\n\n[2] Bradshaw, John, et al. \"A model to search for synthesizable molecules.\" arXiv preprint arXiv:1906.05221 (2019).\n\n[3] Fu, Tianfan, Cao Xiao, and Jimeng Sun. \"Core: Automatic molecule optimization using copy & refine strategy.\" Proceedings of the AAAI Conference on Artificial Intelligence. 2020.\n\n[4] Fu, Tianfan, et al. \"MIMOSA: Multi-constraint Molecule Sampling for Molecule Optimization.\" arXiv preprint arXiv:2010.02318 (2020).\n\n[5] Leguy, Jules, et al. \"EvoMol: a flexible and interpretable evolutionary algorithm for unbiased de novo molecular generation.\" Journal of cheminformatics 12.1 (2020): 1-19.\n\n[6] Shi, Zhan, et al. \"Toward diverse text generation with inverse reinforcement learning.\" arXiv preprint arXiv:1804.11258 (2018).\n",
            "summary_of_the_review": "In general, I do not see too much theoretical or technical contribution. I would request the authors to carefully position their work with the related work mentioned above. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "The present paper aims to discover novel molecules with desirable properties. One of the main contributions is to compose a molecule fragment-by-fragment, where each fragment is drawn not from a fixed fragment dictionary but from a NN-based pre-trained fragment generator. Other contributions are related to the optimization module using RL techniques; introducing fragment deletion as an action, sequential translation, novelty- and similarity-aware reward design, and initial state distribution.\nThe proposed method is evaluated by ligand generation tasks, where generated molecules are evaluated in terms of success rate, novelty, and diversity. ",
            "main_review": "## Strengths\n\n### Fragment generation model\n Fragment-based generation with a fragment generation model is novel and seems to be a reasonable generative model of molecules. It successfully inherits the benefit of the existing fragment-based generative model while avoiding from the limited generative capability due to the fixed fragment dictionary. I also like the authors validate this approach empirically in Section 6.\n\n### Realistic benchmark task\n I like the authors working on a realistic benchmark task, in addition to the traditional penalized logP optimization task.\n\n## Weaknesses\nI have concerns on the reinforcement learning module and experiments.\n\n### Non-stationary environment\nAs the authors state in the \"implementation details\" paragraph, the environment is non-stationary, i.e., both the initial state distribution and the reward function change during training. This non-stationarity is generally not favorable, and should be avoided if possible, because I don't think RL on non-stationary environments is not well understood. I would avoid the non-stationarity by devising the definition of the environment.\n\n### No theoretical justification\nThe authors employ the UCB score to define the initial state distribution, but I don't see any theoretical background to justify it.\n\n### Reward design\nThe reward is designed so that the agent can discover molecules with desirable properties, while being novel and diverse enough. On the other hand, the agent aims to maximize the cumulative reward. I don't see a reasonable interpretation of the cumulative reward, and I would like the authors to discuss it.\n\n### Potentially unfair experimental design?\nAs the authors state in \"optimize for different novelty/diversity metrics\" paragraph, the baseline models are not novelty/diversity-aware during training. I am not very sure this is a fair comparison, because the existing RL-based method can be novelty/diversity-aware by introducing the proposed reward design (Eq. 7). In my opinion, the main contribution of this paper is the generative model of fragments, and it would be more valuable (to me) if the experiment is designed so that it highlights the benefit of the generative model of fragments by for example using the same RL component across different methods.",
            "summary_of_the_review": "My recommendation is weak accept.\n\nI like the idea of a generative model of fragments, and the analysis on its benefit in Section 6. However, I am not very convinced by the RL component, because of three concerns raised above. Therefore, I can't aggressively recommend to accept this paper.\n\nMy humble suggestion is to set the generative model of fragments as the main contribution and the RL components as minor ones (or even re-using the existing RL component), because the generative model of fragments itself seems to be novel enough (at least to me) to be presented to the community.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        }
    ]
}