{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Reject",
        "comment": "The authors propose a graph multi-domain splitting framework, called GMDS, to detect anomalies in datasets with temporal information. The reviewers agree that the paper studies an important and interesting problem but they think that the paper should be improved significantly before being accepted.\n\nIn particular, the reviewers feel that the authors should provide more technical details and insights on the design of the solution proposed and the proposed method should be compared with other(even simple) baselines for the same problem."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "This paper proposes a multi-domain splitting framework for the time varying graph structures, in applications such as traffics in urban areas. The problem is interesting but the paper lacks of some important discussions, and has several limitations. ",
            "main_review": "The strengths of the paper lie in the 1) formulating an important research problem; 2) proposing a workable solution; 3) demonstrating its effectiveness. \n\nHowever, the paper has a number of weakness: \n1) the motivation of the paper is not very clear: in all the cases mentioned in the introduction, the graph/network structures are all relatively stable, only some edges will change. For instance, in the traffic application, the road network is stable; only some roads may change direction or availability due to slow traffic. How much impacts will lead to network structure change? Or even some roads are very jammed, they tend to be repeatable, should they really been modeled as time-varying graph structures? (There are some studied in KDD and other venues regarding time-varying graphs/networks; a thorough review may have establishing the problem and formulation) .\n\n2) The current solution is reasonable and easy to follow. But what are the research issues being addressed? If the problem is new, a baseline can be beneficial to help readers to understand the difficulty and challenges of this problem. And how these problems are addressed. The current presentation and discussion lacks of technical depth and insights. \n",
            "summary_of_the_review": "The motivation/problem formulation as well as technical discussion are not convincing. ",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "Yes, Other reasons (please specify below)"
            ],
            "details_of_ethics_concerns": "Anonymity requirement seems to be violated. ",
            "recommendation": "3: reject, not good enough",
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "This manuscript does not obey the blind review rule, and should be desk-rejected. The code is available here \nhttps://github.com/Zehua-Yu/TVF-anomaly-detection/commits?author=Zehua-Yu\nand the author is not anonymised.",
            "main_review": "NA",
            "summary_of_the_review": "NA",
            "correctness": "1: The main claims of the paper are incorrect or not at all supported by theory or empirical results.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "1: strong reject",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        },
        {
            "summary_of_the_paper": "Please read below.",
            "main_review": "This manuscript should be desk-rejected because it breaks the blind review rule. In the Introduction, the authors said, \"the implementations of our framework without training part are accessible at https://github.com/Zehua-Yu/TVF-anomaly-detection \"; by following the link, we can identify the author of the code.",
            "summary_of_the_review": "This manuscript should be desk-rejected because it breaks the blind review rule.",
            "correctness": "1: The main claims of the paper are incorrect or not at all supported by theory or empirical results.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "1: strong reject",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        },
        {
            "summary_of_the_paper": "In this paper, the authors considered the problem of time-varying graph structure anomaly detection. A graph multi-domain splitting framework was proposed by integrating the time, vertex, and frequency features to locate the anomalies. The authors designed a splitting approach for separating the graph sequences into several sub-sequences adaptively, which is based on the discrete wavelet transform. The experiments showed that the proposed method has a better performance than the baselines.",
            "main_review": "This paper proposed a graph multi-domain splitting framework for the problem of time-varying graph structure anomaly detection. However, the writting of this paper is to be improved. The authors should provide more technical details and insights on the design of the proposed approach in Section 4. The comparisons in the experimental section are limited, and more numerical results should be included to make the proposed approach more convincing.",
            "summary_of_the_review": "The authors should improve the writting of this paper, and provide more technical details and insights on the design of the proposed approach in Section 4. Moreover, the authors should include more numerical simulations and comparisons to demonstrate the effectiveness of the proposed approach.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "The authors propose a multi-domain graph splitting framework for detecting anomalies on dynamic graphs. ",
            "main_review": "Strength: \nThe paper overall is easy to follow. None of the applied modules contains sophisticated implementation details. Still, the designed method outperforms the baselines in the paper. \n\nWeakness:\n1. The justification of the model design is somehow incomplete. For example, why ARIMA is chosen against other regression (or even more advanced methods) for processing time-series Data? For graph wavelet transforms, while there are actually many wavelet transforms designed for graph convolution, I wonder why the authors follow the work from 2011? \n2. Some details of the proposed method are not clearly explained. For example, what are \"invalid vertices (unqualified vertices)\" in Algorithm 1? How the \"most fitted graph\" in Algorithm 3 is defined? \n3. The in-text references should have been correctly inserted with \\cite{} and \\citep{}. For example, \"Following the definition of Graph Fourier Transform Hammond et al. (2011), ...\" in Section 3.4 should be \"Following the definition of Graph Fourier Transform (Hammond et al., 2011), ...\".\n4. Many descriptions should be carefully polished to make them readable. The grammatical issues should be avoided as much as possible.\n5. Considering there are many other works of anomaly detection on graphs, it is desirable to review and compare the proposed method on them. ",
            "summary_of_the_review": "The designed model for this paper takes several simple classic modules, such as wavelet transforms and ARIMA regression. However, the authors should have paid more attention to recent developments in the field, for graph anomaly detection, graph wavelet transforms, and time series forecasting. Unless providing solid justification, the outdated designs are not suitable for publishing at a top-tier conference in 2021 (2022). The same issue exists in the experiment, where the proposed method could have been compared against many more advanced models.\n\nIn addition, the paper was not anonymized properly. Aside from the acknowledgment part where the authors reveal their grants at the review phrase, at the end of the introduction section the provided GitHub link includes an author's name as \"Zehua Yu\".",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        }
    ]
}