{
    "Decision": {
        "decision": "Reject",
        "comment": "There is a consensus among reviewers that the paper should not be accepted. No rebuttal was provided, so the paper is rejected. ",
        "title": "Paper Decision"
    },
    "Reviews": [
        {
            "experience_assessment": "I have read many papers in this area.",
            "rating": "3: Weak Reject",
            "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.",
            "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.",
            "title": "Official Blind Review #3",
            "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.",
            "review": "[Contribution summary]\nAuthors propose MODiR, a dimensionality reduction approach that utilizes both semantic and structural features. Authors report quantitative (metric: precision of k-means++ clustering & AtEdge-length) and qualitative analysis (visualization). \n\n[Comments]\nExperimental analysis could improve e.g. by including more baselines (e.g. other baselines the authors cite in the paper), or by providing more quantitative analysis - e.g. performance at varying degree of completeness / artificial perturbation of the graph. In the current manuscript, the quantitative analysis does not immediately show the benefit or the characteristics of the proposed approaches. In the main section of the manuscript, the analysis is limited to citation networks. \n\nWhile the idea of leveraging both semantic and structural information for the purpose of dimensionality reduction seems to be new and interesting, similar approaches have been explored for text classification tasks (e.g. via graph convolutional networks). "
        },
        {
            "experience_assessment": "I have published one or two papers in this area.",
            "rating": "1: Reject",
            "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.",
            "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.",
            "title": "Official Blind Review #1",
            "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.",
            "review": "Authors introduce a novel algorithm based on multi-objective optimization to jointly position embedded documents and graph nodes in a 2-d landscape. \n\nFirst, the multi-objective optimization used in this paper is quite confusing. Since the overall error defined in (5) is a weighted summation of three objectives, it is not a real multi-objective optimization where multiple objectives are optimized simultaneously. \n\nAuthors define a hypergraph to jointly model documents and entities. However, there lacks the novelty on the objectives defined in this paper. The optimization using gradient descent is also trivial. \n\nIt is hard to understand why equations (2) and (3) share the same objectives but the two sets of samples have totally different meanings. Moreover, both objectives are summed uniformly as shown in the experimental setting. Please explain it in details.\n\nFor the quantitative evaluation, Table 1 shows the percentage of papers for each community per cluster. There are many numbers for a single clustering problem. It might be preferred to use a single measurement such as normalized mutual information or accuracy for clustering evaluation. In this way, it is easy to judge the compared methods.\n"
        }
    ]
}