{
    "Decision": {
        "decision": "Reject",
        "comment": "The reviewers have issues with novelty and quality of exposition. I recommend rejection.",
        "title": "Paper Decision"
    },
    "Reviews": [
        {
            "experience_assessment": "I have read many papers in this area.",
            "rating": "1: Reject",
            "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.",
            "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.",
            "title": "Official Blind Review #1",
            "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A",
            "review": "The paper presents an extensions to the CutOut and SamplePairing techniques for image augmentation, CopyOut and CopyPairing. CutOut itself consists of randomly masking out a rectangular region of an image. In CopyOut one chooses a source and target images, and a rectangular region from the source image is copied into target image.\n\n\nThough the extensions seem to provide an improvement in performance, we feel there are a few improvements that prevent the paper from being accepted:\n - more thorough experimental verification with various CNN architectures and larger variety of datasets datasets is needed (the original paper conducted experiments on CIFAR-10, CIFAR-100, SVHN and STL-10).\n- better exposition needed - it would have been helpful to include more examples of the original methods CutOut and Sample pairing. Sample pairing though mentioned is not described. As CopyPairing is largely based on SamplePairing, it would have been helpful to include a diagram or thorough description of it."
        },
        {
            "experience_assessment": "I have read many papers in this area.",
            "rating": "1: Reject",
            "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.",
            "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.",
            "title": "Official Blind Review #2",
            "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.",
            "review": "[Summary]\nThis paper proposes two data augmentation methods that combine cutout [1] and sample paring [2] for training CNNs, Copyout and Copyparing. The authors evaluate their methods on the CIFAR-10 dataset.\n\n[Pros]\n- Data augmentation is an important regularization method for training diverse NN models\n\n[Cons]\n- The main issue is novelty. What are the differences of the proposed methods from CutMix [3] and RICAP [4]?\n- Only CIFAR-10 was used for evaluation. The results on ImageNet-1k are essential.\n- In recent papers, data augmentation methods for training CNN backbones should be validated on various architectures and downstream tasks such as object detection and semantic segmentation.\n- The method description is not specific.\n\n[1] Devries and Taylor.  Improved regularization of convolutional neural networks with cutout, ArXiv 2017.\n[2] Inoue, Data augmentation by pairing samples for images classification, ArXiv 2018.\n[3] Yun et al. CutMix: Regularization Strategy to Train Strong Classifiers with Localizable Features, ArXiv 2019.\n[4] Takahasi et al. Data Augmentation using Random Image Cropping and Patching for Deep CNNs, ACML 2018.\n\n"
        },
        {
            "rating": "1: Reject",
            "experience_assessment": "I have published one or two papers in this area.",
            "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.",
            "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.",
            "title": "Official Blind Review #3",
            "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.",
            "review": "I think this paper is not enough to accept in ICLR because\n- Lack of novelty.\n  - CutMix [1] is very similar to Copyout.\n  - To verify the novelty, a more sophisticated description and experimental supports should be required.\n- Insufficient experiments for supporting the effectiveness of the proposed method.\n  - 6-layer convolutional networks are used, but other architectures, e.g., ResNet, should be demonstrated.\n  - Other datasets, e.g., CIFAR100 and ImageNet, should be demonstrated.\n  - Various settings, e.g., the number of training samples is limited, should be demonstrated.\n  - Need comparison with other augmentation methods, e.g., Mixup, CutMix, AutoAugment.\n- Overall, the paper is awkwardly written.\n\n[1] Sangdoo Yun et al. \"Cutmix: Regularization strategy to train strong classifiers with localizable features.\" ICCV 2019.\n"
        }
    ]
}