{
    "Decision": {
        "decision": "Reject",
        "comment": "The paper has received all negative scores. Furthermore, one of the reviewers identified an anonymity violation. This is a reject.",
        "title": "Paper Decision"
    },
    "Reviews": [
        {
            "experience_assessment": "I do not know much about this area.",
            "rating": "1: Reject",
            "review_assessment:_thoroughness_in_paper_reading": "N/A",
            "review_assessment:_checking_correctness_of_experiments": "N/A",
            "title": "Official Blind Review #1",
            "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A",
            "review": "This paper violates the conference's double-blind reviewing policy by explicitly identifying their research institute and team name. The violations occur in the 4th line of the abstract, the last paragraph of Section 1 (Introduction), and the first paragraph of Section 2 (System Description). For this reason, I am not providing a review of this paper.\n\n........................................................................................................................................................................................................."
        },
        {
            "rating": "1: Reject",
            "experience_assessment": "I have published in this field for several years.",
            "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.",
            "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.",
            "title": "Official Blind Review #2",
            "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.",
            "review": "Main comments:\nQuality: This paper reads like a project report rather than a typical ICLR paper. It describes a direct application of naïve learning tool (random forest and neural network) without sufficient insight.\n\nClarity: In general, the descriptions on data collection and training are clear.\n\nOriginality: The novelty of this work is very limited, if any.\n\nContributions:\nThe contribution are limited. If the main contributions lie it the construction of the device, I suggest a resubmission to a device-related conference.\n\nFrom the machine learning perspective, this work is a simple and direct application of existing machine learning tools.. \n\n\nOther comments:\nThis paper mentions the authors are from a group (Cogniscent) at IBM, which violates the double-blind policy (at least to certain degree).\n"
        },
        {
            "rating": "1: Reject",
            "experience_assessment": "I do not know much about this area.",
            "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.",
            "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.",
            "title": "Official Blind Review #1376",
            "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.",
            "review": "This work designs an electronic nose to classify beers and gets extremely high accuracy through neural network methods. \nHowever, it seems that ICLR is not a proper conference for such a work. \nThe main contribution of this work may be the electronic devices rather than the machine learning methods.\nThe author related the results of random forest but there is no related content in the main body of the paper.\n\nAt last, the paper is short of technical contents and the figures occupy a lot of the space.\n\nOverall, I am afraid that this work should find a better publication site other than ICLR.\n"
        }
    ]
}