{
    "Decision": {
        "decision": "Reject",
        "comment": "This paper presents two new architectures that model latent intermediate utilities and use non-additive utility aggregation to estimate the set utility based on the computed latent utilities. These two extensions are easy to understand and seem like a simple extension to the existing RNN model architectures, so that they can be implemented easily. However, the connection to Choquet integral is not clear and no theory has been provided to make that connection. Hence, it is hard for the reader to understand why the integral is useful here.  The reviewers have also raised objection about the evaluation which does not seem to be fair to existing methods. These comments can be incorporated to make the paper more accessible and the results more appreciable. ",
        "title": "Paper Decision"
    },
    "Reviews": [
        {
            "experience_assessment": "I have read many papers in this area.",
            "rating": "1: Reject",
            "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.",
            "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.",
            "title": "Official Blind Review #1",
            "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A",
            "review": "In this paper, the authors propose two RNN-based models to learn non-additive utility functions for sets of objects. The two architectures are inspired by the discrete Choquet integral. The proposed models are evaluated on visual and textual data against an MLP baseline and deep sets. \n\nOverall, the paper is clearly written and easily understandable. However, the novelty of the paper is limited and the empirical support of the proposed models is insufficient. The motivation of using \"Choquet integral\" seems obscure to me. The author might want to provide a short introduction to Choquet integral and elaborate on the connection with the proposed models. The proposed models seem very basic and do not have much novelty. The tasks in the experimental study seem overly simple. The authors might want to consider other tasks, for example, Point Cloud Classification in [1]. \n\nQuestions:\n* For RCN and DCR, how to decide the ordering of phi_i, given that they are the objects of an unordered set?\n* It would be helpful it the authors can also provide the number of parameters of the baseline models in Tables 1, 2, and 3.\n* To model the interaction among objects in a set, GNN might be a better choice than RNN.\n\n[1] Zaheer, Manzil, et al. \"Deep sets.\" Advances in neural information processing systems. 2017."
        },
        {
            "experience_assessment": "I have read many papers in this area.",
            "rating": "1: Reject",
            "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.",
            "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.",
            "title": "Official Blind Review #2",
            "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A",
            "review": "This paper proposes two new architectures for processing set-structured data: An RNN with an accumulator on its output, and an RNN with gating followed by an accumulator on its output. While sensible, this seems to me to be too minor a contribution to stand alone as a paper.\n\nAdditionally, I believe the experimental tasks are new, and as a result all implementations of competing techniques are by the paper authors. This makes it difficult to have confidence in the higher reported performance of the proposed techniques."
        },
        {
            "experience_assessment": "I have read many papers in this area.",
            "rating": "3: Weak Reject",
            "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.",
            "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.",
            "title": "Official Blind Review #3",
            "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A",
            "review": "This paper studies non-additive utility aggregation for sets. The problem is very interesting. Choquet Integral is used to deal with set input. The authors propose two architectures. The two architectures, though not novel enough, are towards representing “non-additive utility”.\nHowever, the experimental comparison is not fair, the description of the model (e.g. how Choquet is integrated into the model and help to learn “intermediate meaningful results”) is not clear, some claims are not true.\n\nFirst, the authors claim that they are the first to combine Choquet integral with deep learning. However, there are a few, though not many, works in the literature trying to combine Choquet integral with deep learning. For example, “Fuzzy Choquet Integration of Deep Convolutional Neural Networks for Remote Sensing” by Derek T. Anderson et al. \n\nSecond, the authors claim they are using/motivated by Choquet integral, but do not have any (appendix) sections to explain how this mathematical tool is really integrated into their models. How do you guarantee that the representation learned by the neural network still obeys the property of Choquet integral? What is your loss or your algorithm? These need to be further clarified.\n\nThird, the comparison to baseline and “DeepSet” is not fair. According to the illustration, it seems that you first obtain “features/representations”. Then the representations are fed to the four architectures you listed in figure one. RNN-based approaches are with better “complexity” comparing to your sum baseline and “Deepset” approach. So, I have some doubts about the experimental results.\n"
        }
    ]
}