{
    "Decision": {
        "title": "Final Decision",
        "decision": "Reject",
        "comment": "The reviewers agree that the contributions may not be relevant to the ML research community or perhaps are a poor fit for the venue, but otherwise find the work potentially useful and addressing a timely topic. Because the paper focuses on a simulation environment for existing epidemiological models, reviewers comment that the technical and methodological novelty is limited."
    },
    "Reviews": [
        {
            "title": "Well written and easy to read paper. Unfortunately, work lacks novelty and real impact. Still seems premature and could benefit from more environments, agents, analysis and adoption.",
            "review": "**Summary**\nThis paper introduces a library that implements 1 infectious disease model and 3 agents in a gym environment. The authors provide analysis for a covid-19 lock down scenario using their library.\n\n**Strengths**\nThe paper addresses an important and timely topic. The paper is easy to read and follow. The authors have open sourced their library and it seems to be well documented.\n\n**Weaknesses**\nThe main weakness of the paper is the strength of the contributions. The authors’ main contributions are a gym environment for a specific epidemiological model.\n\nUnfortunately, the novelty is somewhat lacking. As the authors mention in the conclusion section this line of work has been heavily researched. There are many infectious disease models and simulation environments already out there. E.g. a gym like interface has even been already open sourced earlier this year https://github.com/google/ml-fairness-gym/blob/master/environments/infectious_disease.py .\n\nIn terms of impact, the number of environments and agents is also quite limited at this stage. It’s also unclear if there is likely to be adoption by serious policy makers. Absent such impact statements it remains as one of many simulation frameworks out there.\n\n**What could make the paper better**\na) Many more environments and agents need to be implemented such that this library has the potential to become the standard for infectious disease simulation.\nb) A lot more analysis comparing agents and disease scenarios that truly unearth interesting scientific observations. \nc) Real world impact statements of adoption by policy makers and governments.\n",
            "rating": "3: Clear rejection",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "Valuable starting point, but not yet sufficient contribution",
            "review": "This paper introduces OpenAI Gym environment for RL optimization of epidemic containment policies. The envirnoment currently contains an example SEIR model parameterized for COVID-19, along with a simple economic model to evaluate the lost productivity due to lockdowns. Some experimental results are shown where different deep learning algorithms are used to optimize intermittent lockdown policies. \n\nOn the positive side, connecting the epidemiological and ML communities is definitely an important goal. Developing open-source tools to make this interaction easier is valuable. \n\nI'm not sure that this is an appropriate paper for ICLR though. It mostly takes a preexisting epidemiological model and exposes it in the OpenAI gym interface, without a strong research contribution. I believe that there are technical issues in the development of a platform for health policy optimization which are likely to result in research contributions, for example dealing with uncertainty in models/parameters, developing more efficient methods for multiobjective optimization, or providing explanations of policies (particularly since experts are unlikely to implement a RL policy verbatim, but rather try to synthesize its recommendations with other considerations/sources of information). I hope that the authors continue to refine this platform and tackle these or other issues in the future. ",
            "rating": "4: Ok but not good enough - rejection",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "Even if the work is interesting from a societal point of view, it is not enough to justify it as an ML study.",
            "review": "The authors provide a python tool able to model epidemics development as optimization problems. This allows easing the work of decision-makers when faced with the problem of deciding new lockdowns. The model has been applied to real-world data to evaluate the consequences, in terms of deaths and per-capita loss, of a new lockdown.\n\nThe paper presents an interesting study on the dynamics of the epidemic. In my opinion, the development of a tool is relevant for medical and decision-making studies but is not enough novel or significant for the ML field. I think that this kind of analysis is better suited for a more applicative venue, while the novelty provided in your work is not enough to justify a publication at ICLR.\n\nThe paper is clear and well written. I appreciate the use of a real case-study and the following analysis. I think that the only problem is that the venue chosen by the authors does not fit its purpose.\n\n\nQuestions:\n- Did you also try your model on different datasets? I think that a more wide experimental campaing might improve the value of what have been proposed here\n- What about other forms of prevention other than lockdowns? For instance, it is possible to model tracing or testing as prevention methods in your modeling? This would instead make the model more flexible and allow decisional organs to act in a more flexible way.\n- Another interesting study might include the use of different methods for contagion prevention and their use in a joint or sequential manner in order to understand what are the policies over time which might be the most promising for a tradeoff healt/GDP.\n\n----------------------------------------------------------------\nAfter rebuttal: the paper seems interesting but, as I already mentioned and as other reviewers pointed out, the main concerns about this paper are novelty and relevance to the ML community.\n",
            "rating": "3: Clear rejection",
            "confidence": "3: The reviewer is fairly confident that the evaluation is correct"
        }
    ]
}