{
    "Decision": "",
    "Reviews": [
        {
            "title": "Marginal contributions and weak justification of approach",
            "review": "The authors propose an active learning approach for object detection, where the output of both classification and localization are aggregated to provide a informativeness measure of an image. The approach uses a mixture density network. Results show a slight improvement over state-of-the-art competitors either in terms of accuracy or computational resources.\n\nI miss a reference to BayesOD: A Bayesian Approach for Uncertainty Estimation in Deep Object Detectors (Ali Harakeh et al.). This work deals with uncertainty (epistemic and aleatoric) in a multi-task setting (bounding box and category). \n\nEven without considering the mentioned work of Harakeh, the novelty of the paper is very marginal. Relying on mixture densities to model uncertainty was explored by Choi. et al. 2018. The choice of NLL loss for bounding box regression (Choi 2019) or the addition of hard-negative mining in the classification task are not novel. The section about the scoring function and the parameter efficiency are minor contributions. \n\nNotation can be a bit confusing, it's not very rigurous and some of the symbols lack explicit explanations. For instance, the parameter l in Eq. 3 seems to be the predicted box, but it's not mentioned anywhere. B is described as an offset while acting as a set in Eq. 3. The sub-index j refers to the input ground-truth box g so it could possibly be removed to declutter the formulation.\n\nThe paper feels like a mixed-bag of ideas from multiple sources with no clear a-priori justification. The results do not seem to strongly back the claims that motivate the design decissions in the first place. For example. the accuracy improvement of multiple gaussians vs single gaussian models seems insignificant, and the combination of Localization+Detection losses seems to also provide little improvement. The active learning results are more promising and a better fit for demonstrating the effect of the uncertainty prediction. I encourage the authors to further explore the active learning task, which is the main interest of the paper.\n\nThe results are somehow inconsistently presented. The authors provide quantitative analysis with table for VOC07, but then a plot  for VOC07+12 and COCO. A better practice would be to show all results in a table (more readable) and add a plot only if some other claim is more clearly represented that way.\n\nI would have liked to see an ablation study in the context of the active learning task, speficically showing the impact of the contributions/decissions about the method design. For instance, what's the impact (mAP%) of scoring with a combination of both types of uncertainty vs only epistemic, or only aleatoric?\n",
            "rating": "3: Clear rejection",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "A novel method for active learning for object detection",
            "review": "The paper proposes a new approach for active learning for object detection. The method relies on mixture density networks to predict a distribution for each parameter in the classification and localization prediction. In this way, the model can output the aleatoric and epistemic uncertainties for the classification and localization heads in a single forward pass. The experimental results outperform the compared baseline and other state-of-the-art ones.",
            "rating": "6: Marginally above acceptance threshold",
            "confidence": "2: The reviewer is willing to defend the evaluation, but it is quite likely that the reviewer did not understand central parts of the paper"
        },
        {
            "title": "This paper deals with active learning for object detection. I like the idea utilizing both the localization uncertainty and classification uncertainty. However, the key contribution is not well demonstrated.",
            "review": "This paper proposed to leverage both the location prediction and the classification prediction for object detection under an active learning task. The approach relies on mixture density networks to provide a distribution for every predicted parameter (location/class confidence). The distributions are modeled by mixture of Gaussian. By aggregating the aleatoric and epistemic uncertainty from all the predictions, the method produces a single score for each image which will be used for active learning. Experiments show that the proposed method achieves better performance on the whole dataset without active learning. It also produces slightly better performance than other active learning methods with an active learning setup.\n\nPros:\n1. The paper is well written, easy to follow.\n2. The idea is nature and simple, I would not be surprised if it works better.\n\nCons:\n1. The good performance training with the entire dataset (non-active learning setup) does not support the key contribution under an active learning setup.\n2. There is no study about how the combined uncertainty modeling outperforms that only uses a single uncertainty modeling with the active learning setup. It is supposed to be the most important contribution of this paper.\n3. The performance improvement is really subtle.\n\nThe quality of this paper could be improved by addressing the above observations.",
            "rating": "5: Marginally below acceptance threshold",
            "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"
        },
        {
            "title": "This paper describes an mixture density estimation based method for active learning of object detection. ",
            "review": "This paper describes a mixture density estimation based method for active learning of object detection. \n\npros:\n\n1. the approach of using GMM for modeling uncertainties of object detection network prediction is new.\n2. the paper has conducted extensive experimental evaluations to validate the method.\n\ncons:\n1. One key novelty of the paper is taking into account two types of uncertainty of bounding box regression and classification tasks, however, there seems no ablation study to show how the choices will affect the performance.\n2. how did the author choose the initial labeled images is not clear, and the compared methods may not have the same initial labeled images, thus the comparison may not be fair.\n3. The paper lacks clear definition/citation of the baselines used for comparison. the author should also add citations in the comparison table for baselines/methods that is compared. The paper also did not give details about how to obtain those baseline results, are they from the corresponding paper or reproduced by the author is not explained.\n4. review/preliminary of active learning in the method section. The paper should add a review or introduction about active learning, with formal mathematical notations before introducing the proposed active learning method for object detection.\n5. active learning for only object detection is a quite narrow direction.\n\nI will change the rating if the author can address my concerns.",
            "rating": "5: Marginally below acceptance threshold",
            "confidence": "3: The reviewer is fairly confident that the evaluation is correct"
        }
    ]
}