{
    "Decision": {
        "title": "Final Decision",
        "decision": "Reject",
        "comment": "This paper proposed a conditional graph generative model closely following the unconditional generative model NetGAN and extending it by adding conditioning on extra information available for graph generation (“shadow” node attributes as the authors call it).  Overall this is an extension over NetGAN and gives this class of models the ability to utilize extra information when generating graphs.\n\nHowever, all reviewers lean toward the reject side and the concerns raised by the reviewers range from limited novelty to the could-be-improved writing.\n\nI want to highlight two issues.  The first is, is the GAN formulation really necessary?  Could you directly learn using a likelihood objective, e.g. treat the sampled random walks as sequence data, and learn an autoregressive sequence generative model on these data (as a language model for example)?  You could then also generate sample walks from your model.  The benefit is training would be much simpler and more stable.  I believe this could also be related to R2’s concern that the model might be learning the distribution from s alone, as that is entirely possible and potentially easier (not with the GAN formulation proposed here, though).\n\nThe second issue is that I encourage the authors to dig deeper into explainability.  The notion of explainability is obviously important but it is not very well defined.  Does controllability equal explainability?  Is a visualization sufficient to demonstrate explainability (and further, is this sufficient to show this method offers more explainability than alternatives)?  Also intuitively random walk models are not very explainable due to the large amount of randomness in the generation process, compared to e.g. autoregressive graph generative models that generate graphs part-by-part (related to R1’s concern).  If explainability is the main motivation, maybe other alternatives can be more competitive.\n\nOverall I would recommend a reject at this time but encourage the authors to improve the paper further."
    },
    "Reviews": [
        {
            "title": "This paper proposes an explainable graph generative model, named SHADOWCAST, by leveraging the conditions as a control vector to control the generative process. This paper is similar to NetGAN, as both generator and discriminator in these two papers share the similar functionalities, and thus the novelty of this paper is somehow limited.",
            "review": "Strengths: \n1. The motivation of this paper that controls the graph generation is interesting.\n2. Most recent papers on graph generation are listed.\n\nWeakness:\n1. In the vanilla GAN, the generator only takes standard normal distribution as the input to generate the synthetic data and it gradually learns the data distribution by back-propagation. However, the generator in this paper takes the shadow information \\hat{S_t} and standard normal distribution as the inputs and generate the synthesized random walks. I am worried that the generator might learn the data distribution directly from the shadow information rather than through the adversarial training. In other word, I am curious whether it is due to the additional information or the shadow information that the generator could generate the synthesized random walks as genuine as the real random walks. \n2. This paper is similar to NetGAN in terms of both generator and discriminator, and thus, the novelty of this paper is limited.\n3. There is a trade-off between the controllability of the graph generation and the quality of the synthesized graph. When we try to control the graph generation to achieve the desired structure, then the quality of the synthesized graph diminishes, because the desired graph might be very different from the original graph. However, it seems that in the experiment, the synthesized graph generated by proposed method is the closest to the statistics of the original graph, which is not well justified.",
            "rating": "4: Ok but not good enough - rejection",
            "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"
        },
        {
            "title": "Novel problem, but lacks some insightful discussion to support the rationality of SHADOWCAST",
            "review": "The paper proposes a novel problem - explainable graph generation,  and proposed a controllable generative model to mimic network structures as well as network properties. In particular, the proposed model, SHADOWCAST, is developed based on the recent proposed graph generative model NetGAN, and exploits the auxiliary information to guide the generation process. Experimental results on a bunch of real-world networks show the performance of the proposed algorithm. In general, I believe the problem is novel, and the paper is well-motivated and well-written.  My major concern is the paper lacks some insightful discussion to support the rationality of the proposed model. Here are the detailed comments: \n\n[Novelty] The studied problem of this paper - explainable graph generation - is novel. However, it seems the proposed algorithm is more about the generation of attributed networks (Please correct me here if I am wrong). If yes, I believe there are a series of attributed graph generators in the literature, ranging from random graph models to deep graph generative models. \n\n[Literature Review] I am not sure whether it is a standard way for ICLR that the paper can be presented without a section of related work. Two of my review paper have the same problem,  but I am not a fan of it. It would largely help reviewers with less background knowledge to appreciate your work and shed light on the connection between your proposed model to the existing methods. \n\n[Algorithm] In general, I feel the architecture of the proposed model is highly similar to NetGAN. Moreover, on Page 5, it seems the box showing the generative process is directly copied from NetGAN, which is not very professional. \n\n[Experiments] According to Tabel 1 in the experiments, the proposed method achieves the best performance across 3 datasets and 6 network properties. It is interesting to me why the proposed method can outperform NetGAN with a large margin. Some insightful discussions shall be provided. \n\nOverall, I still lean positive to this paper for its novel problem and strong results. But, without clear my concerns above. I vote for weak rejection. \n\n",
            "rating": "5: Marginally below acceptance threshold",
            "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"
        },
        {
            "title": "An insufficiently convincing graph generation method",
            "review": "This paper introduces a graph generation method that aims at mimicking the structure of a given graph but meanwhile maintaining the possibility of altering it (\"controllable\" in the authors' wording).\n\nThere appears a strong footprint of NetGAN (Bojchevski et al., 2018) in the proposed method. NetGAN learns a distribution of random walks on the given graph, so that synthetic walks are generated and assembled to form a new graph. This paper differs from NetGAN in that the sampling of the walks is conditioned on certain \"shadow\" information outside the graph structure (e.g., community labels).\n\nOne weakness of this paper is that the presentation is rather verbose but still not to the point. For example, the authors heavily use several concepts that are vague and whose meanings are not clear until deep into the paper. These concepts include \"explaining graph generation\", \"controlling the generative process\", and \"shadow\". As another example, the definition of \"explainable graph generation\" in page 3 is nearly a verbatim copy of the prior sentence, while leaving the reader wondering what \"generate explainable graphs\" actually means. I also doubt if it is worthwhile to state two future works in the problem formulation section.\n\nWhile the authors have done a reasonable job to show that their method generates a realistic graph (which is expected because the core of the method is NetGAN) when the controlled condition comes from the original data, it is concerning what actually happens when the condition is altered (e.g., favoring more links among a certain community). It is challenging to measure the effectiveness and the reader has not been convinced yet the proposed method shows advantage. For example, following Figure 3(b), to generate the effect of \"legal (red) internal surge\", how does the proposed method compare with naively adding random edges to the \"legal\" cluster? What is missing is a convincing account of why the proposed method makes sense and outperforms others.\n\nMinor comments:\n\n- Replace Table 1 by Table 3 in the appendix. Standard errors are important.\n\n- What the proposed method can control appears to be exogenous of the graph structure (e.g., node attributes). Hence, it appears unlikely that one can use the graph structure as the controllable condition. For example, I am skeptical that the proposed method can generate a graph that leans toward a desired degree distribution.",
            "rating": "5: Marginally below acceptance threshold",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "well-motivated work yet with several issues in techniques, experiments, and literature review",
            "review": "The paper is clearly written, ideas are well presented, and it is easy to follow the pipeline of the method. One highlight of the paper is the shadow network, which can carry multi-modal auxiliary information. Not only semantic features but also graph statistics can be considered during the generating process, and explainable graphs are constructed accordingly. As a minor comment, I would suggest the authors giving more details on the proposed Shadow Cast part and fewer details on the generator and discriminator part, as they are quite similar to the NetGAN setting. \n\nHowever, there are three major concerns of the paper:\n1.\tIn the proposed model, synthetic shadow walks are directly translated from real sampled shadow walks. Since both input and output sequences carry the homogeneous information, it could be easy and less challenging for the seq2seq model to mimic the original shadow walk. It would be interesting to see the shadow walk is predicted from some prediction function (e.g., predict from a set of real shadow walks). \n2.\tIn the experiment part, baseline methods are mostly designed for generating graphs unconditionally except for CondGen. These baselines may indeed not be comparable in the conditional generation task. In addition, there are other conditional graph generative methods [1, 2] proposed in recent years. The authors should consider to add them as baseline methods to validate their performance. \n3.\tFollowing the second concern, the survey of the related work is not comprehensive. There are other lines of works trying to generate the node and edge attributes of the target graph conditioning on input graphs. Authors may consider further address the difference of the proposed model.\n\nTo conclude, the contribution of the paper seems to be limited if the shadow network is constructed only on node class. It would be more comprehensive to leverage other node properties to build shadow network and generate graphs.   \n\n[1] Guo, Xiaojie, et al. \"Deep Multi-attributed Graph Translation with Node-Edge Co-evolution.\" 2019 IEEE International Conference on Data Mining (ICDM). IEEE, 2019.\n[2] Jin, Wengong, et al. \"Learning multimodal graph-to-graph translation for molecular optimization.\" arXiv preprint arXiv:1812.01070 (2018).\n",
            "rating": "5: Marginally below acceptance threshold",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        }
    ]
}