{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Accept (Poster)",
        "comment": "This paper proposes a self-exciting temporal point process model with a non-stationary triggering kernel to model complex dependencies in temporal and spatio-temporal event data. The kernel is represented by its finite rank decomposition and a set of neural basis functions (feature functions). The proposed model has superior performance in comparison to other state-of-the-arts methods. All the reviewers recognized that the model is interesting and advances the state of the art in a meaningful way. While they were some concerns regarding the experimental evaluation, particularly in terms of real data, and the presentation, the rebuttal/revision by the authors cleared up these concerns."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "In this paper, the authors introduce a neural network framework modulating the excitation functions within the self and mutually exciting count processes.",
            "main_review": "\nI find that this paper has interesting ideas, and it addresses an important question in learning self-exciting processes in the presence of non-stationarity.\n\nHowever, I think the authors missed an extremely important influential paper by Feng Chen and Peter Hall (2013): https://www.cambridge.org/core/journals/journal-of-applied-probability/article/inference-for-a-nonstationary-selfexciting-point-process-with-an-application-in-ultrahigh-frequency-financial-data-modeling/99E7C55841B746DBD6CE20D657B2CC9D\n\nOf course, the modulation of the excitation function are very different, where the authors used a general function for k(\\cdot, \\cdot). In Chen/Hall's paper, they had the remarkable idea that it MLE estimates be accurately inferred when you have many paths but with T (time to horizon fixed) and not otherwise. In their paper they set T = 1. I would like to see how your framework would subsume theirs (in the most vanilla case), as your k(\\cdot,\\cdot) is that of a much general form.\n\n",
            "summary_of_the_review": "This is an important piece of work, but I would like to see how they contrast their work with Chen/Hall, which I think they missed. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This paper propose a point process with a non-stationary kernel to model complex event data. The kernel represented by its finite rank decomposition and the basis functions (feature functions) are models using a neural network architecture. To learn the model parameters they used stochastic gradient to maximize the resulting likelihood function. Moreover, they give a theoretical guarantee by showing that under some assumptions, true kernel function is identifiable by solving the MLE problem. They also compared their method against state-of-the-art and baseline on synthetic and real datasets.",
            "main_review": "Strengths:\n- Novel method to model complex dependencies in temporal and spatio-temporal event data using the proposed non-stationary kernel, which experimental results shows the superior performance of the method.\n- Theoretical guarantees to find the kernels using MLE (although not fully check the proof).\n\nWeaknesses:\n- In contrast to synthetic data the real data experiment is very brief. Authors compared the proposed method using only likelihood, but it is better to also include some methods to measure the predictive power of various methods to generate events.\n- Unfortunately, there is no details about the structure and size of the neural networks which used to model the kernel functions. Also how the performance of the method is related to the number of parameters of NNs and number of events data that used for training.\n- It is better to include the comparison of the proposed method in terms on training and test/inference time.\n",
            "summary_of_the_review": "In overall the proposed method for modeling the event data is novel enough and seems to have superior performance in comparison to other state-of-the-arts methods. It also can capture more complex behaviors in events data.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "The paper propose to replace the kernel involving in Marked Point Processes (MPP) by the product of two neural networks.",
            "main_review": "The paper is correctly written and claims are well supported by references. However, mathematical proofs are not correctly written, the best example si page 17 where authors stack equations with several unnecessary informations leaving the reader to a rough experience. \n\n\nExperimental part is based on mostly synthetic data set in low dimension and two real-world data set is not enough to show advantages of your approach. Further, it is clearly incomplete: \n\n- What about the possibility of modeling $\\phi$ and $\\psi$ ? You should study several architectures, parameters ... in order to explore your approach.\n- What about computation time ? it seems that NMPP have computational cost much higher than classical Hawkes process where kernel have a closed-form that does not rely on NNs. \n- Why using SGD in order to optimize the MLE rather than widely used adam or rmsprop or others...?\n",
            "summary_of_the_review": "Theoretical results appears to have very few links with empirical results and the behavior of the proposed approach in practice. Furthermore, the experimental part is not properly studied and does not support the advantages of their approach. Limitations of the proposed approach are not investigated. The paper could be a good paper with more complete work.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        }
    ]
}