{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Accept (Poster)",
        "comment": "The authors first consider a mean field two player zero sum game and consider quasistatic Wasserstein gradient flow dynamics for solving the problem. The dynamics is proved to be convergent under some assumptions. Finally, the authors provide a discretization of the gradient flow and using this proposes an algorithm for solving min-max optimization problems. They use this algorithm for GAN's as the main example. Experimental results claim that the algorithm outperforms langevin gradient descent especially in high dimensionas.\n\nThis paper sits right at the border. But subsequent to the author response, one of the reviewers has updated the score and seems more positive about the paper. In view of this, I am leaning towards  an accept."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "This paper focuses on the methodology of finding mixed Nash equilibrium. The authors first introduces the corresponding quasi static Wasserstein gradient flow dynamics for solving the problem, which is a limiting dynamics with $q$ seen as infinitely faster than $p$. Then the continuous dynamics is proved to be convergent under mild assumptions. Furthermore, by discretizing the above gradient flow, the authors proposes a practical algorithm for solving min-max optimization problems with GAN as a special example. Experimental results shows the superiority over the vanilla LGDA algorithm especially with large $\\beta$’s.\n",
            "main_review": "The intuition and novelty of this paper is good, the authors proposes on analyzing a special setting of finding a mixed Nash equilibrium, by first observing the convergent behavior of the limiting dynamics, and then design a new algorithm via a reasonable discretization. However, the presentation and organization of this paper largely hinders the understanding of the primary contributions.\n\nIn the Introductory part of this paper, when the authors argues that the main contribution of their paper includes a convergence result of quasi static Wasserstein gradient flow dynamics under mild assumptions, and a practical discretization of the dynamics, it is insufficient to illustrate the significance of this paper. The readers lack information on whether similar results have already been obtained by previous works. Is this paper the first approach of this kind? How to compare the convergence result of this paper with [Hsieh et al. 2019], [Domingo-Enrich et al.], etc.? What are the main technical difficulties of designing such an algorithm? The related works in this paper also seems incomplete, the connection of the mean-field studies with the theoretical studies in GANs is missing. All these drawbacks have made this work hard to evaluate.\n\nI searched for the proof of Theorems, Propositions and Lemmas in the Appendix, it seems that the proof of Theorem 5, which is the main theorem, is missing? Most of the results in the main text are direct applications of previous results, it might be better to explain the intuition of the derivation, rather than listing every steps as Lemmas, Theorems, Propositions. ",
            "summary_of_the_review": "Overall, this paper provides a novel algorithm towards finding the mixed Nash equilibrium. However, the presentation of this paper does not support their result well. As a result, the paper is not ready for acceptance at this time.\n\n\n----------\nPost Rebuttal Comments:\n\nThe authors have addressed my concerns. Therefore I'm increasing my score from 5 to 6.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "The paper under review studies the QuasiStatic Wasserstein Gradient Flow and its application to solve two-player zero-sum games. The corresponding Langevin SDE is derived for the Fokker-Planck equation, and the discretized algorithm (GD) is proposed in this new setting.  Example of the min-max problem on 1-d torus and spheres are provided. ",
            "main_review": "1. The idea of using the different rate for the two parameter density space is implemented to solve the original min-max problem. Although the idea of having slow and fast rate is not new in the literature, the authors manage to covert the problem into a simplified problem. The reduced problem can be solved nicely. \n\n2. The Wasserstein gradient flow is indeed a powerful tool. It is mentioned that since $F_{p,\\beta}$ is strongly convex and the global convergence is expected.  Indeed, a perturbed Wasserstein Gradient flow on the density manifold is studied in [1]\"Entropy dissipation via Information Gamma calculus: Non-reversible stochastic differential equations, Feng Q, Li W\". It will be interesting to see that if the non-gradient flow on the density space could find its corresponding QuasiStatic Wasserstein flow story. In particular, [1] provides a faster convergence rate with perturbation added on the drift term. Is there a potential acceleration of the convergence in solving the min-max problem here? \n\n3. The main theorem (Theorem 5) provides a weak convergence to the unique Nash equilibrium. Is it possible to achieve a stronger convergence in this QuasiStatic Wasserstein flow case? Note that the convergence of the density to the equilibrium in [1] is proved in $L^1$ norm. Instead of using the Wasserstein distance, the K-L is used instead. Can the author improve the convergence from this perspective? \n\n4. The empirical study is only carried for 1-d torus and d-Sphere. Of course, higher dimension will be challenging. Is there anything potentially applicable or limitation of the proposed algorithms to be used in high dimension problems. \n\n5. The analysis is conducted in compact manifolds/domains. For general global in space problems, is there a way to select the domain and then apply the algorithms in this paper to solve those general problems? ",
            "summary_of_the_review": "The proposed algorithms show its powerfulness in solving the min-max problem. Empirical study is supportive. The theoretical analysis is nicely presented with the QuasiStatic Wasserstein flow. The idea and the theoretical part both show the novelty. ",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "In this paper, the authors study the minimax problem for finding the mixed Nash equilibrium for mean-field two-player zero-sum games. This is an inf-sup problem in the Wasserstein space. In this paper, the authors consider the case where the sup problem is solved and apply the gradient descent flow for the result inf sup functional. Some theoretical analyses are conducted on these dynamics. They show its convergence to the mixed Nash equilibrium under some conditions. Some numerical schemes for the quasistatic Langevin gradient descent method with inner-outer iterations are presented. They show that the method works on training the mixture of GANs. ",
            "main_review": "The paper is overall well written with clear mathematics. \n\nCons: The authors present the gradient flow formulation for zero-sum games. Here they complete the sup step and only consider the inf steps. \n\nWeakness: \n\n1. For the functional  F(p)=max_{q} E(p, q)-beta S(q). Did the author provide some geodesic convexity property of F in Wasserstein space?\n\n2. Some motivations on Energy functional (1) are needed. The method seems to work for a general type of energy or loss function. \n\n3. The authors miss important literature on Wasserstein dynamics in GANs, and mean-field games. I suggest the authors carefully compare them with the results in this paper. \n\nArbel, Gretton, Li, Montufar, Kernelized Wasserstein natural gradient, ICLR, 2019\n\nLin, Li, Montufar, Wasserstein proximal of GANs, GSI 2021. \n\nLin, et.al. Alternating the Population and Control Neural Networks to Solve High-Dimensional Stochastic Mean-Field Games,  arXiv:2002.10113.\n\nWang, Li, Accelerated information gradient flow, arXiv:1909.02102. ",
            "summary_of_the_review": "The authors study a gradient flow of a particular type functional, which comes from an inf-sup problem in zero-sum games. The paper is overall well written. Some key issues on geodesic convexity and relation to literature are missed. \n",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        },
        {
            "summary_of_the_paper": "This paper studies a minimax problem arising from finding the mixed Nash equilibrium for mean-field two player games. A quasi-static Wasserstein gradient flow is proposed to solve such optimization problems. By discretizing this flow, a simple while practical Langevin gradient descent algorithm is proposed.",
            "main_review": "The paper is well-written and have clear objectives. It might be a good idea to add more experiments illustrating the power of the authors' method.",
            "summary_of_the_review": "Good paper. Clear writing. ",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        }
    ]
}