{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Accept (Poster)",
        "comment": "This paper received 4 quality reviews, with the final rating of 8 by 2 reviewers, and 6 by the other 2 reviewers. All reviews recognize the contributions of this work, especially its superior performance. The AC concurs with these contributions and recommends acceptance."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "The author is motivated by two simple but effective methods: 1) Computation Redistribution (CR) which reallocates the computation between the backbone, neck and head calculation; 2) Sample Redistribution (SR) augments training samples for the most needed stages.  The author uses a simplified search space for computation redistribution across different components and designs a searchable zoom-in and zoom-out space for face-specific scale augmentation. The SCRFD-34GF yields state-of-the-art performances in many datasets(e.g. WIDER FACE).",
            "main_review": "* Strength\n  * The paper indicates that most of the faces (78.93%) in WIDER FACE are smaller than 32×32 pixels. Under this specific scale distribution, both network structure and scale augmentation need to be optimized. The experiments show that the SCRFD indeed enhances the\ndetection performance on small faces.\n  * Both of the proposed CR and SR are effective and achieve great improvements on well-known datasets. The author provided a detailed ablation study that showed that they improved the detection accuracy than the baseline. \n\n* Weakness \n  * The search strategies(CR) implemented are rather straightforward and not interesting. \n  * The experiments mainly focus on comparison with some general detectors. There is almost no comparison experiment with some well-known network search methods. So I am not convinced whether the improvements are mainly due to network search or your contribution.\n\n",
            "summary_of_the_review": "* The methods of searching the network structure consider each component to achieve both performance and latency. \n* Comparison with other SOTA network search methods is inadequate but necessary.\n* Although the method is straightforward and not very interesting, it indeed gets great improvements than the baseline. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "The authors proposed face detection algorithm based on the optimized network architecture and data sampling strategy.  Their novelties are two-fold: one is Computation Redistribution (CR) which optimally reallocates the computation between the backbone, neck and head of the model, and another is Sample Redistribution (SR) which automatically redistributes more training samples for shallow stages.  The ablation study showed that both of proposed methods are effective and the comparative study showed that their whole pipeline achieved the highest accuracy among state-of-the-art methods on the public WIDER FACE dataset.",
            "main_review": "strengths:\n+ Both of the proposed CR and SR are effective and the ablation study showed that they definitely improved the detection accuracy.\n\n+ The proposed method is effective especially for detection of small faces and the experimental results support this (the accuracy improves largely on WIDER FACE Hard which includes many small faces).\n\nweaknesses:\n- The proposed methods are effective for detection of objects with wide range of scales, which might have limited applications.",
            "summary_of_the_review": "Though the proposed methods might be fruitful only for object detection of wider range of object scales, the experimental evaluations showed that they successfully improved the detection accuracy for small faces.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "The paper uses a kind of Neural Architecture Search for finding the best computation redistribution on the base network, based on TinaFace, and the best sample redistribution to find the best network for face detection. It performs very well on the wider-face dataset, outperforming most of the state-of-the-art approaches.",
            "main_review": "1. The result on the wider-face dataset is very good, outperforming most of the state-of-the-art approaches.\n2. The paper relied on a \"meticulously designed methodology of search space optimization\". Architectures are randomly sampled to find the likely range of the best architecture. In this sense, will evolutionary approach do the same trick?\n3. Also, this paper is basically a kind of Neural Architecture Search, and would like to see a comparison with at least evolutionary method.\n4. The choice of TinaFace as base network is straightforward. However, is it possible that after NAS, a close runner-up can be better than the champion?",
            "summary_of_the_review": "The paper uses computation redistribution and sample redistribution for searching the best architecture based on TinaFace.  I'll say that there is enough innovation from the paper, and the result is very good. Although I have some questions posted in the main review, I think the paper is acceptable in the conference.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "details_of_ethics_concerns": "Nil",
            "recommendation": "8: accept, good paper",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "This paper presents a face detection method that aims to deal with two challenges in unconstrained face detection: high computation cost and detecting small faces. Specifically, the authors adopted a network structure search method along with a two-step searching strategy for computation redistribution between the backbone, neck and head of the network. Sample redistribution between the scales is achieved using a searchable zoom-in and zoom-out space for face scale augmentation. Experiments were conducted on a benchmark dataset: WIDER FACE.",
            "main_review": "Strength:\n•\tA two-stage searching strategy is helpful to find the optimal structure in the large search space. \n•\tThe proposed computation redistribution method is general and can be adopted by other application.\n•\tThe scale search strategy is helpful to handle scale variations.\n•\tThe proposed method yields the detection performance comparable to the SOTA face with lower computation cost.\n\nWeakness\n•\tIt lacks a figure to illustrate the overview of the whole framework.\n•\tAn algorithm is helpful to describe the proposed computation redistribution method.\n•\tIt needs more details in sample distribution. It is not clear how to “employ random search under the estimation metric of AP … across different computation regimes”. In addition to the purpose of shrinking the scale search space, does the binary probability have other advantage over the other probability model?\n•\tCross dataset evaluation was conducted, and the overall APs were reported for AFW, Pascal, and FDDB datasets, respectively. However, it is not sufficient to claim SCRFD-2.5GF obtains SOTA performance without a comparison with the SOTA. For example, BFBox has a better performance (AP=99.43) on the Pascal dataset; HAMBox has a better performance on all these three datasets: AP=99.9 on AFW, AP=99.5 on Pascal, and 0.991 on FDDB. The authors discussed both BFBox and HAMBox in related work, but only compared with HAMBox on the WIDER FACE. In addition, Figure 5 is shown without an explanation in the text.\n",
            "summary_of_the_review": "The idea of search an optimal structure considering all components to achieve both computational efficiency and performance is novel and the experimental results have supported the claim. However, details are missing in the main contributions -  searching network structure and searching scale. The search strategies implemented are rather straightforward.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        }
    ]
}