{
    "Decision": {
        "title": "ICLR 2018 Conference Acceptance Decision",
        "comment": "All reviewers agree the paper proposes an interesting setup and the main finding that \"prosocial agents are able to learn to ground symbols using RL, but self-interested agents are not\" progresses work in this area. R3 asked a number of detail-oriented questions and while they did not update their review based on the author response, I am satisfied by the answers. ",
        "decision": "Accept (Poster)"
    },
    "Reviews": [
        {
            "title": "Interesting",
            "rating": "7: Good paper, accept",
            "review": "This paper explores how agents can learn to communicate to solve a negotiation task. They explore several settings: grounded vs. ungrounded communication, and self-interested vs. prosocial agents. The main findings are that prosocial agents are able to learn to ground symbols using RL, but self-interested agents are not. The work is interesting and clearly described, and I think this is an interesting setting for studying emergent communication.\n\nMy only major comment is that I’m a bit skeptical about the claim that “self-interested agents cannot ground cheap talk to exchange meaningful information”. Given that the agents’ rewards would be improved if they were able to make agreements, and humans can use ‘cheap talk’ to negotiate, surely the inability to do so here shows a failure of the learning algorithm (rather than a general property of self-interested agents)?\n\nI am also concerned about the dangers posed by robots inventing their own language, perhap the authors should shut this down :-)\n",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "A very interesting paper, it examines problems of how agents can use communication to maximise their rewards in a simple negotiation game. The good results of the paper are muddied by all the other data and aspects of the experiments that didn't work. ",
            "rating": "5: Marginally below acceptance threshold",
            "review": "The experimental setup is clear, although the length of the utterances and the number of symbols in them is not explicitly stated in the text (only the diagrams).\n\nExperiment 1 confirms that agents who seek only to maximise their own rewards fail to coordinate over a non-binding communication channel. The exposition of the experiments, however, is unclear.\nIn Fig 1, it is not clear what Agent 1 and Agent 2 are. Do they correspond to arbitrary labels or the turns that the agent takes in the game?\nWhy is Agent 1 the one who triumphs in the no-communication channel game? Is there any advantage to going first generally? Where are the tests of robustness on the curves demonstrated in Figure 2a?\nHas figure 2b been cherry picked? This should be demonstrated over many different negotiations with error bars.\nIn the discussion of the agents being unable to ground cheap talk, the symbolic nature of the linguistic channel clouds the fact that it is not the symbolic, ungrounded aspect but the non-binding nature of communication on this channel. This would be more clearly demonstrated and parsimonious by using a non-binding version of the proposal channel and saving the linguistic discussion for later.\n\nExperiment 2 shows that by making the agents prosocial, they are able to learn to communicate on the linguistic channel to achieve pretty much optimal rewards, a very nice result.\nThe agents are not able to reach the same levels of cooperation on the proposal channel, in fact performing worse than the no-communication baseline. Protocols could be designed that would allow the agents to communicate their utilities over this channel (within 4 turns), so the fact they don't suggests it is the learning procedure that is not able to find this optimum. Presenting this as a result about the superiority of communication over the linguistic channel is not well supported.\nWhy do they do worse with random termination than 10 turns in the proposal channel? 4 proposals should contain enough information to determine the utilities.\nWhy are the 10 turn games even included in this table? It seems that this was dismissed in the environment setup section, due to the first mover advantage.\nWhy do no-communication baselines change so much between random termination and 10 turns in the prosocial case?\nWhy do self-interested agents for 10 turns on the linguistic channel terminate early?\nTable 1 might be better represented using the median and quartiles, since the data is skewed.\n\nAnalysis of the communication, i.e. what is actually sent, is interesting and the division into speaker and listener suggests that this is a simple protocol that is easy for agents to learn.\n\nExperiment 3 aims to determine whether an agent is able to negotiate against a community of other agents with mixed levels of prosociality. It is shown that if the fixed agent is able to identify who they are playing against they can do better than not knowing, in the case where the fixed agent is self interested.\nThe pca plot of agent id embeddings related is good.\nBoth Figure 4 and Table 3 use Agent 1 and Agent 2 rather than Agent A and Agent B and is not clear whether this is a mistake or Agent 1 is different from Agent A.\nThe no-communication baseline is referred to in the text but the results are not shown in the table.\nThere are no estimates of the uncertainty of the results in table 3, how robust are these results to different initial conditions?\nThis section seems like a bit of an add-on to address criticisms that might arise about the initial experiment being only two agents.\n\nOverall, the paper has some nice results and an interesting ideas but could do with some tightening up of the results to make it really good.\n",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "Review 'Emergent Communication through Negotiation'",
            "rating": "6: Marginally above acceptance threshold",
            "review": "The authors describe a variant of the negotiation game in which agents of different type, selfish or prosocial, and with different preferences. The central feature is the consideration of a secondary communication (linguistic) channel for the purpose of cheap talk, i.e. talk whose semantics are not laid out a priori. \n\nThe essential findings include that prosociality is a prerequisite for effective communication (i.e. formation of meaningful communication on the linguistic channel), and furthermore, that the secondary channel helps improve the negotiation outcomes.\n\nThe paper is well-structured and incrementally introduces the added features and includes staged evaluations for the individual additions, starting with the differentiation of agent characteristics, explored with combination of linguistic and proposal channel. Finally, agent societies are represented by injecting individuals' ID into the input representation.\n\nThe positive:\n- The authors attack the challenging task of given agents a means to develop communication patterns without apriori knowledge.\n- The paper presents the problem in a well-structured manner and sufficient clarity to retrace the essential contribution (minor points for improvement).\n- The quality of the text is very high and error-free.\n- The background and results are well-contextualised with relevant related work. \n\nThe problematic:\n- By the very nature of the employed learning mechanisms, the provided solution provides little insight into what the emerging communication is really about. In my view, the lack of interpretable semantics hardly warrants a reference to 'cheap talk'. As such the expectations set by the well-developed introduction and background sections are moderated over the course of the paper.\n- The goal of providing agents with richer communicative ability without providing prior grounding is challenging, since agents need to learn about communication partners at runtime. But it appears as of the main contribution of the paper can be reduced to the decomposition of the learnable feature space into two communication channels. The implicit relationship of linguistic channel on proposal channel input based on the time information (Page 4, top) provides agents with extended inputs, thus enabling a more nuanced learning based on the relationship of proposal and linguistic channel. As such the well-defined semantics of the proposal channel effectively act as the grounding for the linguistic channel. This, then, could have been equally achieved by providing agents with a richer input structure mediated by a single channel. From this perspective, the solution offers limited surprises. The improvement of accuracy in the context of agent societies based on provided ID follows the same pattern of extending the input features.\n- One of the motivating factors of using cheap talk is the exploitation of lying on the part of the agents. However, apart from this initial statement, this feature is not explicitly picked up. In combination with the previous point, the necessity/value of the additional communication channel is unclear.\n\nConcrete suggestions for improvement:\n\n- Providing exemplified communication traces would help the reader appreciate the complexity of the problem addressed by the paper.\n- Figure 3 is really hard to read/interpret. The same applies to Figure 4 (although less critical in this case).\n- Input parameters could have been made explicit in order to facilitate a more comprehensive understanding of technicalities (e.g. in appendix).\n- Emergent communication is effectively unidirectional, with one agent as listener. Have you observed other outcomes in your evaluation?\n\nIn summary, the paper presents an interesting approach to combine unsupervised learning with multiple communication channels to improve learning of preferences in a well-established negotiation game. The problem is addressed systematically and well-presented, but can leave the reader with the impression that the secondary channel, apart from decomposing the model, does not provide conceptual benefit over introducing a richer feature space that can be exploited by the learning mechanisms. Combined with the lack of specific cheap talk features, the use of actual cheap talk is rather abstract. Those aspects warrant justification.",
            "confidence": "3: The reviewer is fairly confident that the evaluation is correct"
        }
    ]
}