{
    "Decision": {
        "decision": "Reject",
        "title": "ICLR 2018 Conference Acceptance Decision",
        "comment": "This is a nice but very narrow study of domain invariance in a microscopic imaging application.  Since the problem is very general, the paper should include much more substantial context, e.g. discussion of various alternative methods (e.g. the ones cited in Sun et al. 2017).  In order to contribute to the broader ICLR community, ideally the paper would also include application to more than just the one task."
    },
    "Reviews": [
        {
            "title": "The paper discusses a method for adjusting image embeddings in order tease apart technical variation from biological signal.",
            "rating": "5: Marginally below acceptance threshold",
            "review": "The paper discusses a method for adjusting image embeddings in order tease apart technical variation from biological signal. A loss function based on the Wasserstein distance is used. \nThe paper is interesting but could certainly do with more explanations. \n\nComments:\n1. It is difficult for the reader to understand a) why Wasserstein is used and b) how exactly the nuisance variation is reduced.\nA dedicated section on motivation is missing.\n\n2. Does the Deep Metric network always return a '64-dim' vector? \nHave you checked your model using different length vectors?\n\n3. Label the y-axis in Fig 2.\n\n4. The fact that you have early-stopping as opposed to a principled regularizer also requires further substantiation. ",
            "confidence": "3: The reviewer is fairly confident that the evaluation is correct"
        },
        {
            "title": "Review of Correcting Nuisance Variation using Wasserstein Distance",
            "rating": "7: Good paper, accept",
            "review": "This contribution deal with nuisance factors afflicting biological cell images with a domain adaptation approach: the embedding vectors generated from cell images show spurious correlation. The authors define a Wasserstein Distance Network to find  a suitable affine transformation that reduces the nuisance factor. The evaluation on a real dataset yields correct results, this approach is quite general and could be applied to different problems.\n\nThe contribution of this approach could be better highlighted. The early stopping criteria tend to favor suboptimal solution, indeed relying on the Cramer distance is possible improvement.\n\nAs a side note, the k-NN MOA is central to for the evaluation of the proposed approach. A possible improvement is to try other means for the embedding instead of the Euclidean one.\n\n",
            "confidence": "3: The reviewer is fairly confident that the evaluation is correct"
        },
        {
            "title": "Wasserstein distances for eliminating batch effect, not enough novelty and no thorough comparisons to other methods. ",
            "rating": "4: Ok but not good enough - rejection",
            "review": "The authors present a method that aims to remove domain-specific information while preserving the relevant biological information between biological data measured in different experiments or \"batches\". A network is trained to learn the transformations that minimize the Wasserstein distance between distributions. The wasserstein distance is also called the \"earth mover distance\" and is traditionally formulated as the cost it takes for an optimal transport plan to move one distribution to another. In this paper they have a neural network compute the wasserstein distance using a different formulation that was used in Arjovsky et al. 2017, finds a lipschitz function f, which shows the maximal difference when evaluated on samples from the two distributions. Here these functions are formulated as affine transforms of the data with parameters theta that are computed by a neural network. Results are examined mainly by looking at the first two PCA components of the data.  \n\n\nThe paper presents an interesting idea and is fairly well written. However I have a few concerns:\n1. Most of the ideas presented in the paper rely on works by Arjovsky et al. (2017), Gulrajani et al. (2017), and Gulrajani et al. (2017). Some selections, which are presented in the papers are not explained, for example, the gradient penalty, the choice of \\lambda and the choice of points for gradient computation.\n2. The experimental results are not fully convincing, they simply compare the first two PC components on this Broad Bioimage benchmark collection. This section could be improved by demonstrating the approach on more datasets.\n3. There is a lack comparison to other methods such as Shaham et al. (2017). Why is using earth mover distance better than MMD based distance? They only compare it to a method named CORAL and to Typical\nVariation Normalization (TVN). What about comparison to other batch normalization methods in biology such as SEURAT? \n4. Why is the affine transform assumption valid in biology? There can definitely be non-linear effects that are different between batches, such as ion detection efficiency differences. \n5. Only early stopping seems to constrain their model to be near identity. Doesn't this also prevent optimal results ? How does this compare to the near-identity constraints in resnets in Shaham et al. ?\n\n",
            "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"
        }
    ]
}