{
    "Decision": {
        "metareview": "The main criticisms were around novelty: that the analysis is rather standard. Given that all the reviewers agreed the paper is well written, I'm inclined to think the paper will be a useful contribution to the literature. The authors also highlight the analysis of the discretization, which seems to be missed by the most critical reviewer. I would suggest to the reviewers that they use the criticisms to rework the paper's introduction, to better explain which parts of the work are novel and which parts are standard. I would also suggest that standard background be moved to the appendix so that it is there for the nonexpert, while making the body of the work more focused on the novel aspects.",
        "confidence": "3: The area chair is somewhat confident",
        "recommendation": "Accept (Poster)",
        "title": "Interesting contribution, even if the analysis is mostly standard"
    },
    "Reviews": [
        {
            "title": "well written but not weak results",
            "review": "The paper considers 'replica exchange' Langevin dynamics. These methods are very popular among practitioners, and developing some theory backing the empirical successes is an important goal.\nUnfortunately this paper offers only weak results. \n- The first 6 pages set up the general formalism. This is textbook material adapted to the current problem.\n- Page 7 offers a result (expression for the Dirichlet form), which is hardly more than an exercise for anybody familiar with Markov Chains theory. \n- Page 8 gives a Poincare inequality. Again, this follows from known results. More importantly: (1) It does not show any advantage of replica exchange over standard dynamics; (2) It does not provide any quantitative insight for high-dimensional problems.\n- Similar comments hold for the following pages. They are an exercise in applying standard formalism to this problem, without really showing any significative advantage of replica exchange.",
            "rating": "4: Ok but not good enough - rejection",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "Proof that replica exchange accelerates convergence in Langevin dynamics",
            "review": "This paper gives a theoretical analysis of an interesting statistical physics technique known as replica exchange. The basic idea is that Langevin dynamics at low temperature is slow to converge, and that one could potentially boost the convergence by alternating between low and high temperature. At the extreme one could imagine running in parallel a random search and a gradient descent, and ``teleporting\" the gradient descent algorithm whenever the random search algorithm finds a point with better value. This makes a lot of sense and it is nice to see a theoretical analysis of this. The mathematics are sound, but I do not know whether it is an appropriate submission for ICLR.\n\nOne comment from the math side: it would be interesting (albeit probably difficult) to study kappa in (3.10) as a function of a. In particular at face value it looks like one only benefits from taking a larger, so why not study the limiting behavior of a->infty? What is the limiting value of kappa? Can you perform those calculations in the convex case at least?",
            "rating": "7: Good paper, accept",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "well written.",
            "review": "PROS:\n- The text is very well written, with a good balance between mathematical details and intuitions.\n- I really like the high-level description of the algorithms and proof techniques\n\nCONS:\nto be completely honest, I am not sure I have learnt anything new from the paper. \n1) the proof techniques are very standard\n2) although there must be some small innovations, I thought that all the results had more or less been proven by Dupuis and co-authors:\na. large deviation principles\nb. the larger the swapping rate, the better (which motivated Dupuis & al to consider the infinite swapping limit.)\n\nand\nc. Bakri & al methodology to prove convergence relying on the carre du champ is by now very standard and the proofs of the paper are only minor adaptations.\n\nI must probably be missing something, and I encourage the authors to clarify what the main novelties are when compared to the several papers by Dupuis & al. \n\nREMARKS:\n1) I do not really understand the emphasis on optimisation while all the proofs are related to the convergence to the stationary distributions.\n\n",
            "rating": "6: Marginally above acceptance threshold",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        }
    ]
}