{
    "Decision": "",
    "Reviews": [
        {
            "summary_of_the_paper": "This paper presents a novel viewpoint on face restoration, which is traced down to two sub-tasks, i.e. face generation and face reconstruction. Face generation aims to learn the distribution of high quality faces and face reconstruction aims to capture the face characteristic (e.g. shape and texture) from an image regardless of its quality. Specifically, to improve face generation, the authors inject an adaptive conditional noise. To improve reconstruction, the authors quantize the features using a codebook learned from high-quality\nimages and introduce a global feature fusion module for an adaptive combination of the features from the decoder and the skip connections. Besides, a new evaluation metric is proposed which better correlates with the perceptual quality of human. Promising results are achieved both quantitatively and qualitatively.",
            "main_review": "Strengthes:\n+ Clear motivation and novel perspective on deep face restoration.\n+ Well written and easy to follow\n+ Good performance compared to SOTA competitors.\n\n\nWeaknesses:\n- It's better for the authors to compare the efficiency of the proposed method against the competitors.\n- In Figure 12 of Supplementary material, it seems the facial color in the results of the proposed method is quite different from the input, which is somewhat inconsistent against the claim that the proposed method is better on both generation and reconstruction.\n- How to learn the codebook from high-quality images and how we know the codebook is good enough? Details are needed.",
            "summary_of_the_review": "Further response on the efficiency and facial color issue may be helpful.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "details_of_ethics_concerns": "No ethics concerns.",
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This paper proposes a face restoration method based on deep models. It divides the face restoration problem into generation and reconstruction by learning a stochastic model and introducing feature quantization. In addition, it develops an evaluation metric. Experimental results show the effectiveness of the proposed method. ",
            "main_review": "Strengths: \n\nThis paper introduces a stochastic model and feature quantization to improve the performance of the face restoration. A new evaluation metric is proposed to evaluate the performance of the proposed model. Experimental results are better than the evaluated methods.\n\nWeaknesses:\n\nIt is not clear why the face restoration problem can be divided the face restoration problem into generation and reconstruction. Based on the proposed method, it actually introduces a stochastic model and feature quantization to improve the performance of the face restoration. There is no insightful analysis about this claim.\n\nUsing the feature quantization to improve the face restoration is interesting. However, it seems that this strategy is not effective as shown in Table 3. For example, the FID value of using quantization is higher than that without using quantization. \n\nIn Section 3.1.1, the authors mention the degradations of various types and strength. However, it is not clear whether the proposed method is robust to such degradation or not. \n\nFor the results in Table 1, it is not clear whether the authors using the same experimental settings for fair companions. In addition, it would be better to add the proposed metric in the Table 1. \n\nUsing stochastic approach will introduce unstable. Although results in Table 3 shows that using stochastic approach improves the performance, it lacks deeper analysis. \n\nIn Table 2, why the results of the Bicubic are better than other methods? In addition, the results of the Baseline method in Table 3 seem to be better than the evaluated methods. The improvement in Table 3 is not significant compared to the results in Table 1. \n",
            "summary_of_the_review": "Although the results are better, the main contributions and the claims of the paper are not explained clearly. I hope the authors can address my comments detailed above in the rebuttal.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        },
        {
            "summary_of_the_paper": "The authors give a comprehensive analysis of the image restoration problem, which simultaneously emphasizes image reconstruction and generation. They propose to introduce feature quantization and gated fusion modules to enhance face images. In addition, iPrecision and iRecall are introduced to evaluate the identity quality. The experiment shows that the proposed method can perform the desired results. While there are some concerns.",
            "main_review": "1. Authenticity preserving is not a very good motivation. In the past few years, there have been tons of papers discussing this property. The authors need to make it clear what's new from their thinking.\n\n2. The overall novelty is limited. The design combines 3-4 selling points, but none of them hits. The skip connections have nothing new. We all know this preserves facial details. Feature quantization brings something new, but it's not clearly described. Where do the initial values of the codebook come from? Is it from paired training? Sec. 3.2 just describes a conditional GAN. So what's new here?\n\n3. Eq. (3) is wrong. If we don't impose different weights on the two norms, the stop gradient operator will be redundant. Please check the original paper of VQVAE.",
            "summary_of_the_review": "Please refer to the main review.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This paper proposes a new face restoration model that improves both generation and reconstruction for face restoration by learning a stochastic model and enhancing the latent features respectively. Experimental results on CelebA-HQ verified the effectiveness of the proposed method.",
            "main_review": "1. The novelty is limited compared with previous similar efforts, which are not even mentioned in this paper, e.g., Joint Face Image Restoration and Frontalization for Recognition, Cross-Resolution Face Recognition via Prior-Aided Face Hallucination and Residual Knowledge Distillation.\n2. The proposed method is only verfied on CelebA-HQ. More results on more recent challenging benchmarks are needed to convince the reviewers.\n3. I think the task that this paper trying to solve is super-resolution?? Not restoration?? In my opinion, for face restoration, the input may involve many distracting factors, like low resolution, extreme poses/expressions, occlusion, contamination noise... \n4. Some related works are missing for discussion, e.g., Joint Face Image Restoration and Frontalization for Recognition, Cross-Resolution Face Recognition via Prior-Aided Face Hallucination and Residual Knowledge Distillation, Recognizing Profile Faces by Imagining Frontal View, Task Relation Networks",
            "summary_of_the_review": "I like the motivation of this paper. However, I feel that the contributions are not enough for ICLR. Please see Main Review for details. Please convince me in rebuttal. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "Yes, Discrimination / bias / fairness concerns"
            ],
            "details_of_ethics_concerns": "Not quite sure about how this paper handle the discrimination / bias / fairness concerns in face restoration.",
            "recommendation": "3: reject, not good enough",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        }
    ]
}