{
    "Decision": "",
    "Reviews": [
        {
            "summary_of_the_paper": "The paper proposes a method for anomaly segmentation, i.e. the task of identifying anomalous pixels in images. This is relevant for visual defect detection in manufacturing for example. The proposed AnoSeg method first generates synthetic anomalies following CutPaste (Li et al., 2021), which is the idea of cutting and then pasting a random patch (after applying various image transformations) back into the image at a different location, allowing the extraction of a synthetic ground-truth anomaly segmentation map. The so-augmented images are then fed into an encoder and GAN (together with coordinate channels (Liu et al., 2018)) that is trained on (i) reconstructing the normal regions of an image, (ii) segmenting the synthetic ground-truth segmentation masks, and (iii) a discriminator that discerns between the synthetic (CutPaste) anomaly images with segmentation masks and the corresponding images with masks generated by the generator. The anomaly map of a test image is then given by the segmentation map generated from the encoded image.\nThe proposed AnoSeg method is evaluated qualitatively and quantitatively on the MVTec-AD dataset where it shows an improved anomaly segmentation (in terms of pixel-level AUC and IoU) and detection performance (image-level AUC) over previous methods.",
            "main_review": "*Pros*\n+ The proposed method achieves state-of-the-art results on the MVTec-AD dataset, both in terms of anomaly segmentation and detection performance. \n+ Qualitatively, the AnoSeg anomaly maps look more convincing (higher detail) than the maps of previous methods. This also shows in more accurate results in terms of the IoU (Intersection over Union) measure, which is standard in segmentation. \n+ The paper well integrates related work and includes recent state-of-the-art methods (e.g. FCDD, Patch SVDD, CutPaste) in the comparison.\n\n*Cons*\n- The technical and methodological novelty of AnoSeg is rather low, since all individual components have been introduced in previous works. \n- AnoSeg is exclusively evaluated on the MVTec-AD dataset. It would be good to at least include one other dataset (e.g. MNIST-C) to better infer the generality of the proposed approach for anomaly segmentation.\n- The discussion and exploration of the limitations of the proposed AnoSeg method falls a bit short in my view (see questions below).\n\n\n*Questions*\n(1) Could you elaborate on why the IoU curves for \"capsule\", \"screw\", and \"toothbrush\" are worse compared to other methods? Is there a common characteristic to these classes that could explain the difference to the other methods?\n(2) I very much appreciate the qualitative anomaly maps given in the appendix. In addition to showing good/random examples, could you show examples where the methods does not work well? I think this would be important to understand where the method may falls short.\n\n\n*Additional minor points*\n* f in Eq. (5) seems not defined in the text.\n* Overall, the paper is well structured and easy to follow, but the paper should be proofread for grammatical errors (e.g. missing articles) and typos.\n* I would rather avoid non-specific statements such as \"The proposed AnoSeg is a “holistic” approach [...]\". How do you define \"holistic\"?",
            "summary_of_the_review": "Though I think the proposed AnoSeg method has rather low technical and methodological novelty, I find the empirical results to be convincing, both qualitatively and quantitatively, for the relevant problem of anomaly segmentation. Hence, I have a positive tendency towards accepting this work, but I think the empirical evaluation (additional dataset) and analysis (limitations of AnoSeg) should be extended.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        },
        {
            "summary_of_the_paper": "The paper proposes a method to pose the anomaly segmentation problem as a segmentation problem and training it in a self-supervised fashion. Usually, the anomaly segmentation problem is addressed  by thresholding a score matrix to divide the image into anomalous and normal parts. Authors propose three techniques which help, first is hard augmentations to generate synthetic anomalous training data, second is adding an adversarial loss only on the normal parts of the image to help the encoder learn the distribution of normal images better. Thirdly, they propose to add channels with coordinate information as a way to make the network sensitive to location of the anomalies. The qualitative results look impressive and the results on the MvTec AD dataset also seem competitive to SOTA methods.",
            "main_review": "Strengths:\n1. Methods seems simple and effective and the paper describes the main contributions fairly well \n2. Ablation study shows contribution from the three central contributions clearly. Anomaly detection ablation also shows contribution of the main idea\n3. Threshold sensitivity experiments shows robustness of the method\n4. Comparison seems reasonable and fair, for example using the threshold which gives best performance for baselines, base encoder being resnet18 similar to baselines\n\nWeaknesses:\n1. Results on only one dataset are reported. There are other Anomaly Detection datasets used in research, for example BTAD dataset or the modified ShaghaiTech dataset. It would show that the method generalizes to different datasets and increases confidence in the method. \n2. Although the description is good, there are a few places where it could be better. For example the architecture of the network is a little confusing. Appendix B says - “The decoder used for image reconstruction has the same structure as the decoder for generating anomaly maps, and AnoSeg uses two decoders.” In my understanding AnoSeg uses two decoders - image reconstruction decoder and anomaly map generation decoder, but from the quoted statement it seems that there are 4 decoders? Please clarify this line.\n3. It’s not clear if the anomaly detection generator is trained along with AnoSeg or if it is trained after training AnoSeg?\n4. It is mentioned that for quantitative results, the threshold which maximizes the IoU was used for each method [Section 4.1], which means that the best threshold for AnoSeg was also used (threshold for output of sigmoid). It would be good to know what exact thresholds were used for reproducibility even if the method works well on a range of thresholds. \n5. Are the thresholds for PatchSVDD and SPADE used in the threshold sensitivity experiments also the threshold to convert the real valued output to a binary output (anomalous/normal)? This would help in providing context for these experiments.\n",
            "summary_of_the_review": "The results of the paper on MvTec dataset are impressive and would be valuable to the community. But there are a few weaknesses, for example, results on other datasets which would help in improving confidence in the method are missing. The technical formulation of the anomaly segmentation problem is also fairly novel and having results on multiple datasets would make a good case for it.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "This paper aims to solve anomaly segmentation by proposing three technologies, anomaly data generation, self-supervised learning with pixel-wise and adversarial loss, and coordinate channel concatenation. Experiments on the MVTec dataset demonstrate the effectiveness of the proposed method. ",
            "main_review": "1. The proposed contributions seem like normal technologies, which can be referred from other areas. So would you mind clarifying the major contribution of this paper? I think the paper seems like a report, not a formal conference paper because of the limited novelty.",
            "summary_of_the_review": "This paper proposes three common technologies to solve the anomaly segmentation task which gets performance gains. However, due to the limited novelty, I would to see other reviewers' suggestions.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO.",
                "Yes, Discrimination / bias / fairness concerns"
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "The paper propose a AnoSeg network for anomaly segmentation by introducing hard augmentation, self-supervised learning, and coordinate channel concatenation",
            "main_review": "## Strength\n### The topic of anomaly segmentation using self-supervised way is interesting and practically useful.\n\n## Weakness\n### 1. The organization and writing of the paper lacks logic, which makes it hard to understand and follow.\n### 2. The motivation of the proposed three components in AnoSeg is not clearly presented in introduction. For example, in addition to textual explanation, some experimental or theoretical analysis should be given to convince reader that the proposed method is reasonable.\n### 3. The novelty of the proposed hard augmentation, adversarial learning and coordinate channel concatenation is slim. For example, hard augmentation has been proposed in Tack et al. and Li et al. Numerous methods have adopted adversarial learning for anomaly detection.\n\n",
            "summary_of_the_review": "## Overall\n### Due to the apparent weakness, the paper is not ready for publication. ",
            "correctness": "1: The main claims of the paper are incorrect or not at all supported by theory or empirical results.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        }
    ]
}