{
    "Decision": "",
    "Reviews": [
        {
            "summary_of_the_paper": "The paper focuses on a new method, named multi feature fusion embedding, for Chinese NER by incorporating the semantic, glyph, and phonetic features. In particular, the online forums and content from the users may reduce the performance of pretrained Chinese language models due to wrong “spelling” by the users, which could come from the wrong character with the same phonetic or similar glyph. The new multi feature fusion embedding approach has a higher tolerance and higher F1 for NER when the language has wrong spelling as from the social media posts, which the authors verified via experimental results.\n",
            "main_review": "Strengths:\n1. Better features of the Chinese characters on glyph by five strokes and on phonetic by trans pinyin.\n2. The observation of the NER model w/ lower performance due to wrong character from users.\n\nMy concerns are two-folds\n1. The paper seems not to have clearly abundant novelty, as far as I understand. The glyph features and phonetic features of Chinese characters seem well-known features for tasks including NER. The particular features of five strokes and trans pinyin are sort of minor details. \n2. The results seem to be lack of convincing and large F1 boost. On three out of 5 data sources, the gain of MFE comes less than 1 percent compared w/ pure BERT. On the data source of substitution that was done to mimic the two wrong “spelling” that the MFE would be good at, the F1 boost of 1.1 percent seemed to suggest the new approach appears to lack clear boost.",
            "summary_of_the_review": "Thus, in spite of the many contributions from this manuscript, the quality and novelty seem to be below the threshold for acceptance. Therefore, I am afraid that I cannot recommend to accept the paper in this current version.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This paper proposes a new method, Multi-Feature Fusion Embedding (MFE) for Chinese Named Entity Recognition, especially for character substitution problems. In MFE, different types of features are fused, including semantic, glyph, and phonetic features. For the glyph feature, they use the 'Five-Strokes' encoding method to indicate the structure patterns in the Chinese characters. For the phonetic features, they propose a 'Trans-pinyin' method, which combines 'Pinyin' with international standard phonetic symbols and makes it easier to evaluate the phonetic similarity among the Chinese characters. Experiments on several Chinese NER datasets show the effectiveness of the proposed method. \n",
            "main_review": "Strengths:\n\n1, This paper proposes to fuse semantic, glyph, and phonetic features for Chinese NER. They use the 'Five-Strokes' for the glyph features and 'Trans-pinyin' for the phonetic features. They also compare three different strategies to fuse these features.\n2, Experiments show that the proposed method can achieve better performance compared to pure BERT, especially on datasets with informal expressions.\n3, The writing for this paper is well organized and easy to follow.\n\nWeakness:\n1, The novelty is somewhat limited. This is not the first paper that tries to fuse semantic, glyph, and phonetic features together for the Chinese language. ChineseBERT [1] also use Glyph and Pinyin to enhance the understanding of the Chinese language. There are also previous papers that use 'Five-Strokes' for Chinese NER [2]. \n2, ChineseNER also test on Chinese NER tasks and report performance on the same datasets, including 'Weibo' and 'MSRA'. It seems like this paper uses the same data split as ChineseBERT for the 'Weibo' dataset and the performance in this paper is worse than ChineseBERT. For example, the F1 score for the 'Weibo' dataset is 69.02 for ChineseBERT-base and 67.74 for this paper. \n3, Missing ablation study for the Glyph features and the phonetic features.\n\n[1] Zijun Sun, et al. ChineseBERT: Chinese Pretraining Enhanced by Glyph and Pinyin Information. ACL 2021.\n[2] Fan Yang, et al. Five-Stroke Based CNN-BiRNN-CRF Network for Chinese Named Entity Recognition. NLPCC 2018.\n\nTypos:\n1, Add brackets for citations mentioned in the body text.\n2, Add punctuation marks after equations.\n",
            "summary_of_the_review": "This paper proposes the Multi-Feature Fusion Embedding for the ChineseNER task, and works especially for the informal languages. The overall writing is good and easy to follow. However, the idea of fusing different types of features together for ChineseNER is not novel. The 'trans-pinyin' section is original and novel.  The performance of the proposed method is not very convincing.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This paper proposed that utilizing three types of features (semantic, glyph, and phonetic)  to improve Chinese named entity recognition models. It tried three types of fuzing methods to fuze the three features. Experiments showed that the proposed model achieved better performance than pure BERT model. ",
            "main_review": "1. This paper is not well written. Many of the claims were not well supported. For example, page 6 \"we do not recommend the second strategy,..., linear layer may mix them together, leading to information loss\".  I don't agree with this argument. The linear layer will not lead to information loss in supervised learning.  Page 4, \"some work...\" missed necessary citations. \n\n2. The experiment settings are weak. No ablation test to evaluate the contribution from each feature. \n\n3. The proposed method lacks novelty. It is well known that adding the proper features will improve model performance. The new feature used in this paper has already been studied (e.g.\" Glyce: Glyph-vectors for Chinese Character Representations\"). And the feature fuzing methods are too simple, at least the attention-based feature fuzing should be tried. ",
            "summary_of_the_review": "In summary, this paper lacks novelty and is not persuasive in the experiment settings.  ",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "1: strong reject",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        },
        {
            "summary_of_the_paper": "This paper mainly targets the character substitution problem of Chinese named entity recognition (NER). The proposed architecture fuses semantic, glyph, and phonetic features to obtain better character embeddings.  Experiments show performance improvements of Chinese NER.",
            "main_review": "The paper proposes a Chinese NER model by fusing Chinese characters' semantic, glyph, and phonetic features. The semantic features are contextual or non-contextual word embeddings. \"Five-Strokes,\" a structure-based encoding method, is leveraged to get glyph embedding. Regarding the phonetic features, the authors propose the  \"Trans-pinyin\" system to represent character pronunciation, in which auxiliaries and vowels are transformed to standard forms and keep the tune in the 'Pinyin' system. The three kinds of embeddings are then fused in three ways (Concat, Concat+Linear, and LSTM). Experiments in both informal and relatively formal language environments show competitive results.\n\nOverall, the paper is well written and easy to read. The main problem of this work is the limited technical contribution. I agree that the glyph and pronunciation information is essential for Chinese Named Entity Recognition. However, the proposed approach's overall framework is similar to existing NER models or Chinese character embedding models, lacking technical novelty.\n\nSome important baselines are missing. As mentioned in related works, many other researchers also exploit glyph and phonetic features of Chinese characters. Therefore, using pure BiLSTM and pure BERT as the baselines will weaken the evaluation effectiveness a lot.  For example, since ChineseBert also fused glyph and phonetic features, the authors should verify whether and how the proposed method improves ChineseBert's strategy.\n\nThe experiment design is somewhat weak. The authors are encouraged to design more explorative evaluations on the character substitution problem instead of just demonstrating a simple case, which is exactly the same as the one presented in the introduction. The intuition behind exploiting glyph and phonetic features is clear. But I think the authors can further polish the design motivation and conduct more explorative experiments to verify the superiority of the proposed glyph and phonetic representation strategy.\n",
            "summary_of_the_review": "The novelty of the proposed method is limited and the experiment design is weak. The paper may not be ready for publication in a high-profile conference.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        }
    ]
}