{
    "Decision": "",
    "Reviews": [
        {
            "summary_of_the_paper": "This paper aims at representation learning in a federated learning scenario. The authors argued that the main challenges lie in the scattered information and few labeled data. To this end, this paper adapts contrastive learning to the federated learning scenario, and proposes two techniques, i.e., feature fusion and neighborhood matching to make use of the scattered information among different clients. Experiments have shown the effectiveness of the proposed method.",
            "main_review": "### Strengths\n- This paper is well-organized, clearly written, and easy to follow.\n- The proposed method is simple yet proven effective.\n\n### Weaknesses\n- The novelty is somewhat weak. The proposed approach contains common techniques widely used in other fields, e.g., the false negative phenomenon has been widely studied in early works, and neighborhood matching has also been widely used in many deep clustering methods.\n\n### Questions\n- The proposed method is developed on MoCo. Is it able to work on other contrastive frameworks such as BYOL, Barlow Twins, and SimSiam?\n- In my opinion, reducing the false negative ratio can sometimes hurt useful information. Does the proposed ``further reducing the false negative ratio'' always helpful in federated learning, or does it depends on certain conditions?\n- I do not quite understand the paragraph around Eq. (9). What do you mean by ``individually certain''?",
            "summary_of_the_review": "This paper proposes a simple yet powerful method for addressing federated representation learning. Despite being somewhat weak in novelty, it is a worthful attempt on adapting common techniques into federated learning. However, I am not an expert in federated learning, thus I tend to follow other reviewers on deciding this paper.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "This paper proposes federated contrastive learning (FCL) from unlabeled decenralized data. This paper tackles two problem of FCL. One is client data diversity, especially negative features for contrastive learning.\nThe other is data heterogenity, data distribution shift, among clients. About the first problem this paper proposes feature fusion by uploading features from each client to the server and downloading available features for contrastive learning to each client. About the second problem FCL proposes  neighborhood matching to fuse features to build well-clustered features among clients. Based on these ideas FCL outperforms other federated learning and FCL approaches.\n",
            "main_review": "Strengths: this paper solves two major problems of FCL by two ideas of feature fusion and neighborhood matching. Each client uploads features to the server, but uploaded features are calculated from encrypted images with privacy.\nWeakness: almost similar two ideas are already proposed in FedCA (Zhang et al., 2020). ﻿One is dictionary module for addressing the inconsistency of representation spaces and the other is alignment module for aligning the representations across clients. FedCA uses small public data, but the novelty is small. The proposed method shows better performance but it is necessary to support your proposal by clarifying the originality and choose appropriate evaluations based on clarified differences. \n",
            "summary_of_the_review": "This paper proposes privacy-preserving FCL and will be a practical solution in healthcare applications. This paper proposes two ideas to solve two problems of FCL respectively. But similar ideas are already proposed and novelty is small. In spite of similarities to previous methods, the evaluation is not enough to confirm your proposed method is better than previous methods. More clarifications of the proposed methods in comparison with previous methods and more appropriate evaluations would support your proposal. ",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This paper focuses on unsupervised federated learning scenarios and proposes a contrastive learning method to learn representations from unlabeled data. The proposed method is composed of two components: a feature fusion scheme allows the model to learn from diverse data, and a neighbourhood matching scheme leads to more efficient communication across different clients. ",
            "main_review": "Strengths:\n\n1. It is worthwhile to study the scenario of self-supervised federated learning on unlabelled data. \n2. Sufficient experiments are conducted to illustrate the performance of the framework as well as the effectiveness of each component. \n3. The paper is well-written.\n\n\nWeaknesses:\n\n1. The experiment evaluation and setting are not strong enough to support its claim. \n2. There is not enough theoretical contribution to either federated learning field or contrastive learning field. The convergence of the proposed method should be analysed.\n3. The proposed framework is a combination of multiple components. A comprehensive ablation study is required. For example, different image encryption methods or some methods for feature augmentation.\n4. The uploading of encrypted images from clients will raise concerns for data security and privacy.\n\n\nQuestions and suggestions:\n\n1. Since there is a claim that the learned representations have high quality, it is more convincing to show the difference between the representations learned by all methods in a more direct way, such as t-SNE.\n2. In the Metrics paragraph (page 7), the proposed semi-supervised learning is inconsistent to the proposed method which focuses on unsupervised learning scenarios only. Moreover, it will be fair to select some baseline methods from semi-supervised FL. \n3. As stated in Appendix - B.2, the client number is 10 that is quite small in FL. Moreover, in non-IID1 and non-IID2, are there only 5 clients in the CIFAR-10/FMINIST and CIFAR-100?\n4. Are there any more general non-IID settings to be evaluated in experiments? For example, feature distribution skew, label distribution skew, quantity skew, etc.\n",
            "summary_of_the_review": "This paper proposes a framework for self-supervised federated learning in federated settings. However, the experimental cannot provide well-support to the claims. Moreover, it lacks a systematic theoretical analysis of the framework and there are still some minor issues. ",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        },
        {
            "summary_of_the_paper": "This paper proposed  a federated contrastive learning framework consisting of feature fusion and neighborhood matching, by which a unified\nfeature space among clients is learned for better data representations.They evaluate on several widely-explored datasets to verify their performance. ",
            "main_review": " FL is a hot topic in terms of protecting privacy. Generally the paper is easy to read and well-structured.\n\nHowever, my major concern is the paper explored to leak the features to server and also get access to the features from other clients. Actually, it violates the motivation of FL to protect the data. Although they claim to encrypt the features, it becomes more vulnerable to attack.  If the local model can access to the features from other clients, it will definitely enhance the performance especially in the iid case. In iid case, it becomes the traditional learning problem. This is also not fair to compare with others. The idea has its Achilles' heel for FL.\n\nThe proposed feature fusion and neighbor matching tend to be not novel, when they have the features. \n",
            "summary_of_the_review": "Based on the problem setting and proposed model, I tend to reject this paper. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "1: strong reject",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        }
    ]
}