{
    "Decision": "",
    "Reviews": [
        {
            "summary_of_the_paper": "This paper proposes a RL based link prediction model for biomedical domains. The key point is to allow explainable hypothesis generation. The agent learns to walk in the graph while leveraging the neighbor information. The representation at the terminal step is used to make predictions.\n\nThe main contributions include:\n\n* A bidirectional walk-based reasoning agent that achieves good link prediction performance and explainability\n* The proposed framework works for both inductive and transductive settings.",
            "main_review": "## Strengths\n* This work focuses on an important aspect of biomedical link prediction. The motivation is sound and clear.\n* The paper is well written and easy to follow. The complementary analysis of embedding visualization and hypothesis paths is useful to better understand the approach.\n\n## Weaknesses\n* While this work might be the first to apply RL-based link prediction for biomedical domains, extensive research have been done in general knowledge bases. Despite the similarity, the authors fail to discuss the related works:\n    1. https://arxiv.org/abs/1711.05851\n    2. https://arxiv.org/abs/1707.06690\n    3. https://arxiv.org/abs/1802.04394\n* The model itself is not new and its GRU based reasoning module is almost the same as an existing work. https://arxiv.org/abs/1711.05851\n",
            "summary_of_the_review": "Overall, this paper studies an important problem in biomedical link prediction. However, the method as well as the presentation is very similar to existing path-based KB reasoning work. Yet the authors fail to discuss these work as related studies. ",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "The authors present the WEHG model for link prediction tasks. Unlike the conventional prediction models, the WEGH model can provide the explanation about how a prediction is made. Technically, the authors integrate several useful tricks into the WEHG model, including\n- Modeling the link prediction task like a Markov Decision Process\n- RL for guiding the walks in the graph\n- GRU units for memorizing the walking trajectory\nwhich are all reasonable and quite interesting. The attached experiments are comprehensive as well.\n",
            "main_review": "The high-level modeling idea looks good, but it takes time to fully understand the overall processing steps by reading Figure 1 and corresponding descriptions from Section 3. To make it more readable,  I will suggest the authors revise Figure 1 as follows. \n- increase the font size\n- give some footnotes to each module/component; for example, which part is related to the input pairs? What are the sub-graphs on the left part? What is the function of each f()?\n- needs a short description about how to read the figure\n\nAs for the results, the produced walks are treated as the explanations of the predictions. The mechanism looks like seeking for the highly connected node(s) given a previous node. The connectivity is learned by the proposed RL method. From this perspective, I consider there should exist many random-walk-based embedding-based methods which consider attention-based walks. Are they comparable to this work? As to GCN-like models, they also have an attention-like mechanism. Probably these methods are required to be compared in this work?\n",
            "summary_of_the_review": "See above comments",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "The paper approaches the problem of hypothesis generation - predicting a new link between two nodes in a graph of biological concepts. In particular, the authors want to generate explanations for their predictions where the explanation is the graph walk that led to the inference. Their proposed approach is called Walk-based Explainable Hypothesis Generation (WEHG) which learns node embeddings and a traversal function through RL. As opposed to most prior graph completion algorithms focus on latent inferences and do not provide provenance for  their predictions. They show strong quantitive results on three topical splits of a newly created dataset.",
            "main_review": "strengths:\n- on the provided experimental results, the method performs quite well quantitatively\n- inductive experiments show that WEHG can generalize to new nodes at test time\n- As opposed to the latent embedding models, the graph walking algorithm provides a reasoning path as an explanation\n\nweaknesses:\n- Evaluations are restricted to three topical biomedical settings constructed by the authors and do not include existing graph completion datasets. \n- the gap between full WEHG and the random walk version is quite small\n- there are existing knowledge graph traversal methods trained with reinforcement learning such as 'Go for a Walk and Arrive at the Answer: Reasoning Over Paths in Knowledge Bases using Reinforcement Learning' and 'DeepPath: A Reinforcement Learning Method for Knowledge Graph Reasoning', as well as non RL algorithms such as 'Random walk inference and learning in a large scale knowledge base'. None of these are cited or discussed.\n- The qualitative trajectories in table 4 (presumably cherry picked) do not seem like good explanations \n- Since the definition of a correctly generated hypothesis is whether two terms will co-occur in a sentence, I think a good baseline would even be f(bio-bert(\"term 1, [sep], term2\"))\n\n\nNotes:\n- The abstract is a little clunky in the middle, there is a sentence that uses the word node 4  times. - Figure 1 could be improved, maybe label the different portions of the image (a, b, c etc) and explicitly reference them in the caption. \n- Table 4 column 1 and 2 seem redundant\n",
            "summary_of_the_review": "Review Summary:\nThe paper approaches an interesting problem of explainable hypothesis generation and its focus provenance and node-pair classification makes it slightly incongruent with most existing graph completion algorithms. However, I did not find the experiments to be very strong or the results to be very convincing (particularly the qualitative explanations).",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "The paper proposes an explainable link prediction method. The explanation is defined as paths connecting the end nodes of a link. The generation of paths is a sequential process, so RL based method is leveraged for learning the policy. A GRU-based module learns an embedding by integrating together the information from previous walk steps, the current node attribute, and neighbor node attributes.",
            "main_review": "Strengths:\n1. The paper studies an important problem, which could be seen as explainable path-based reasoning.\n2. In general the method makes sense to me.\n\nWeaknesses:\n1. The proposed method is limited in novelty. A similar idea could be found as below.\n2. The baseline methods in experiments are mainly network embedding methods. More path-based methods should be included.\n\n[1] Xian, Yikun, et al. \"Reinforcement knowledge graph reasoning for explainable recommendation.\" Proceedings of the 42nd international ACM SIGIR conference on research and development in information retrieval. 2019.\n\n[2] Xiong, Wenhan, Thien Hoang, and William Yang Wang. \"DeepPath: A Reinforcement Learning Method for Knowledge Graph Reasoning.\" Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing. 2017.",
            "summary_of_the_review": "The paper studies an important problem in network analysis with a reasonable solution proposed. My major concerns are its novelty and experimental design. Perhaps some more literature search is needed.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        }
    ]
}