{
    "Decision": "",
    "Reviews": [
        {
            "summary_of_the_paper": "The authors proposed VORTEX, a consistency training framework for data augmentation pipeline which is for the accelerated MRI reconstruction. VORTEX augments the data in two different ways: physics-driven augmentation for noise and motion and image-based augmentation by flipping, scaling, rotation, translation, shearing, etc,  which enforces invariance and equivariance, retrospectively.\nThe proposed augmentation framework improves data-efficiency and robustness to clinically relevant distribution drifts. \nThe data augmentation methods are very important especially in medical field and the proposed method shows a superior MR reconsruction results compared to the other MR augmentation methods.",
            "main_review": "*Strengths\n- They defined the physics-driven noise by adding noise in k-space domain (g_N) & adding different random phase noise on odd/even k-spaces which simulates the patients motion (g_M). Compared to the natural image data augmentation, physics-driven approaches are the necessary processing for the MR reconstruction. \n- The reconstruction performance of VORTEX are superior in SSIM and cPSNR metric compared to the other conventional augmentation methods.\n*weaknesses\n- They called 'the reconstruction of the augmented input is mapped to non-augmented ground-truth' as 'invariance', but it is conventional approaches for the noise augmentation. Adding different noise on even/odd k-space is somewhat different for the conventional method. But, I couldn't find enough originality for the concept.\n\n- The consistency training for MR data augmentation was already tried in [Noise2Recon: A Semi-Supervised Framework for Joint MRI Reconstruction and Denoising, arXiv 2021] & [Enhancing MR Image Segmentation with Realistic Adversarial Data Augmentation, arXiv 2021]. Please, cite this paper as reference.\n\n- (Figure 3. the result of MRAugment): It is reasonable the results of heavy motion is poor. However, I think the reconstruction performance of MRAgument for heavy noise should be better than the displayed results. According to the supplementary material, I think the author used default parameter setting of MRAugment for the comparison. Please, specify the hyper-parameters of the augmentation methods for the comparison (in the supplementary material). It helps the reader can judge the fairness of the comparison.\n\n- (Table.6) The 3 methods were trained by same number of epochs (=200). The results of VORTEX seems saturated (VORTEX results of 50%=results of 100%), but the Supervised and Aug(Motion) seems to has some room for improvement (results of 50%<results of 100%). The author might say 'the proposed method converged faster and better'. However, the proposed method uses both supervised and consistency paths and it results to the 3 times of network inferences and 3 times of backpropagation (1 for supervised & 2 for consistency, refer to Figure.1). The training time in the unit of time(or computational unit) might helpful to the user. Or the other comparative results should be converged to some optima even it takes 3 times more epochs than the training of VORTEX.\n\n- I'm wondering the performance of the proposed method on 2D k-space sampling. In clinic, not only 3D MRI but also 2D MRI are both  widely used and needed to be accelerated because of respiration/motion/cardiac motion issues. \n\n- The author mentions that their results are superior because the the comparative reconstructions are noisy/blurry and show some artifacts. However, some radiologist might score better on the comparative one to examine the anatomy/lesion even it has heavy noise. The blind examination by the radiologist might be helpful as further work.\n",
            "summary_of_the_review": "The author applied 'consistency training of augmentation' for the MR reconstruction task. The consistency training for MR data augmentation was already tried in [1] & [2]. Therefore the technical novelty seems marginally novel. \n\nThe results of the proposed method seems superior and significant.\nCompared to the effort of finding best performance for VORTEX (such as scheduling/warm-up hyper-parameters tunnings), however, the results of comparative methods seem not converged (still have some room to improve). I think the comparative method need to be more training for fair comparison. Therefore, I couldn't fully judge that the proposed method shows superior/robust results compared to the other augmentation methods. Thus,  I cannot evaluate the empirical contributions of VORTEX are significant.\n\n[1]: [Noise2Recon: A Semi-Supervised Framework for Joint MRI Reconstruction and Denoising, arXiv 2021] \n\n[2]: [Enhancing MR Image Segmentation with Realistic Adversarial Data Augmentation, arXiv 2021]",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "[Summary] This work addresses the problem of data augmentation for MRI reconstruction, where the image reconstruction depends on the quality of the acquired spatial-frequency space. This motivates a scheme that is based on  physics-driven and image-based augmentations. The core idea of the paper is such a combination of types of augmenters. The authors build upon the semi-supervised framework of that (Desai et al, 2021). The experimental results show potentials in the results wrt existing schemes.",
            "main_review": "-- Whilst the idea of incorporating   physics-driven and image-based augmentations, for MRI reconstruction, is appealing. A major  factor that somehow turns down the paper is the clear level of technical contribution. Firstly, the authors general framework builds strongly on that (Desai et al, 2021) which differs from the incorporation of  the  physics-driven and image-based augmentations. (Desai et al, 2021) already consider ODD shifts from the variation on SNR in the acquisitions, authors extend such scheme by including affine motion as another factor of degradation ( different type of motion based augmentation has been already explored in other works such as in [*]). Therefore, the technical contribution is appreciated as incremental and mainly being an empirical paper (no theoretical findings are provided). Authors need to strengthen the difference in findings from other works, as the major message that  physics-aware and image-based augmentations are key in performance has been already reported in (Desai et al, 2021) and (Fabian et al., 2021). \n\n\n[*] Shaw, Richard, et al. \"MRI k-space motion artefact augmentation: model robustness and task-specific uncertainty.\" International Conference on Medical Imaging with Deep Learning, 2018\n\n\n-- There is a lack of motivation and discussion on why to limit the framework to 2D Poission Disc sampling pattern. Is there any reason?  What about other typical sampling patterns -- for example spiral sampling? Whilst I agree that authors cover one relevant one, other patterns such as spiral sampling are not only interesting at the clinical level but also at the technical level. For example, dealing with the non-uniformly acquired data whilst having some advantages over the selected such as less degradation in the image quality. Authors should argue this limitation.\n\n-- Differences with MRAugment. Authors stated “In contrast to MRAugment, we incorporate MRI physics into the augmentations pipeline by embedding MRI coil sensitivity” and “using image-based data augmentation schemes (Fabian et al., 2021)”. Such arguments are unclear. Firstly, the authors of MRAugment main motivation is taking into account the physics behind the MRI acquisition, and also consider coil sensitivities. Also, the principles of the scheduling seems to be motivated by such work. Can the authors strengthen  their main advantages over MRAugment?\n\n-- [Experimental Results] The experimental setting has merit. It would be beneficial to further support the numerical advantages of the authors scheme with a statistical test. \n\n--[Other] There are some parts in the description that seem not to have a purpose throughout the paper. For example subsection 3.2 authors define Equivariance and Invariance. However, such concepts are barely linked in the main paper or why such known concepts need a full subsection. \n\n\n------------------------------------------------------------------------------------------------------------------------------------\nPOST-REBUTTAL\n\nAfter reading carefully the rebuttal, the authors addressed my concerns and I further agree with the value of the paper. My thoughts are  alined by the general positive comments of the majority of the other reviewers. \nThe authors included, in the updated version, all clarifications including the statistical tests requested and further discussion on my questions. Overall, I’m more positive about this paper than before and this is therefore reflected in the final suggested score.\n\n",
            "summary_of_the_review": "This is a lower borderline paper. The author need to further support the main technical advantages of their proposed scheme wrt of existing works (see previous point), as currently the paper is appreciated with an incremental contribution.  Moreover, the strong claims would be better supported with a set of statistical tests.   (see Post-rebuttal comments).",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        },
        {
            "summary_of_the_paper": "In this paper, the authors propose a domain knowledge injected data augmentation method for a semi-supervised deep learning-based MRI reconstruction from an undersampled frequency space. The goal is to both overcome the scarcity of ground-truth scans and improve the robustness against the distribution shifts in practical application. In this specific setup, they introduce transformations such as Gaussian noise and motion artifacts at the unsupervised part of the reconstruction network for consistency training. Experiments performed on knee MR images show considerable improvements in both in- and out-of-distribution scenarios compared to a few baselines.",
            "main_review": "Strengths:\n- The paper is well motivated that MRI reconstruction acceleration is necessary to be robust to distribution drifts when there’s not enough training labels.\n- It’s beneficial to introduce domain knowledge such as signal-noise-ratio changes and motion artifacts into a deep learning network which is usually treated as a black box.\n- The experimental results show significant reconstruction improvements meatured by SSIM and cPSNR.\n\t\nWeaknesses:\n- The proposed method performs consistency training but didn’t compared with any relevant papers in the literature.\n- In this empirical paper, only a very small dataset (14 training, 2 validation, and 3 testing scans) is used to evaluate the proposed method, which is not convincing.\n- The out-of-distribution samples are simulated by adding Gaussian noise and motion artifacts to good quality data. In the real scenario, distribution drifts could originate from a variety of factors such as acquisition protocol changes, scanner magnetic strength changes, and even modality changes.\n- The paper uses 2D Unet to solve a 3D MRI reconstruction problem. A 3D Unet might be preferred.\n- In the ablation study of varying the acceleration rate, the authors didn’t compare with the data augmentation baseline “MRAugment”.\n- Although the proposed augmentation method shows better performance in SSIM, there’s marginal improvement in cPSNR.\n",
            "summary_of_the_review": "Overall, the paper provides an empirical study on introducing a heuristic physical-inspired data augmentation method to a MRI reconstruction problem for robustness under testing distribution drifts with few supervised examples. However, larger-scale and diverse-samples are needed for method validation; real distribution drifts data are desired for the model robustness testing; a fair comparison with consistency training papers is preferred.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "Yes, Responsible research practice (e.g., human subjects, data release)"
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This paper proposed a method to reconstruct MRI images from undersampled MRI images without aliasing effect in order to reduce the duration of data acquisition during MRI scans. The experiment was done with a dataset that consists of fully-sampled examples in spatial-frequency domain and undersampled examples in the same domain. They suggested a semi-supervised training framework that conducts joint reconstruction for supervised scans, and instead of denoising, they proposed implementing a data augmentation pipeline for the unsupervised scans. The denoising objective from the Desai et al., 2021 is replaced with a data augmentation pipeline that enforces invariance to physics-driven augmentation and equivariance for image-based augmentation. Physics-driven data augmentation is done by adding noise and motion into k-space. In image-based data augmentation, they first transform the k-space fully-sampled data into image domain using coil sensitivity maps, then apply the image-based augmentation to both image and the sensitivity maps. Next, using the augmented image and transformed sensitivity maps, they run a forward model to generate the corresponding undersampled k-space measurement. Ablation studies are provided to compare pixel-based and latent-space consistency as well as data augmentation difficulty. ",
            "main_review": "Strength:\n- Compared to MRAugment, the authors considered coil sensitivity maps in the image-based augmentation.\n- The authors proposed a method to solve an important problem such as physics-based data augmentation to reconstruct MRI images from undersampled MRI image.\n- Two ablation studies were preset; latent space vs pixel-level consistency and augmentation scheduling difficulty.\n\nWeakness:\n- The presented idea is not novel. Most of the operations seem to be done in the image domain with simple existing augmentation techniques, and the presented k-space is only used for the undersampling process.\n- Details about the hyperparameter settings are missing. \n- Table 2: only one sota (MRAugment) is compared with the proposed method. The author should add more current works to prove their method.\n- There is no Lsup in glossary (supplementary material)\n- The presentation of figure 1 is very confusing. \n(1) It looks that only the undersampled data is undergoing data augmentation. But, in page 5, the last four lines, it states \"Since the training data initially exists as fully-sampled k-space measurements, we first transform it into the image domain using coil sensitivity maps. We then apply a cascade of the image-based data augmentations to both the image and the sensitivity maps.\"  This is confusing.\n(2) It might be useful to show the structure of f_theta(.,A). I guess f_theta first transforms y to image domain x and passes x through a u-net. But the figure looks that the f_theta is a single module to transform k-space to an image. Those two operations should be separated to avoid confusion.\n(3) Augmentation seems to be done on images, but figure 1 looks that it is done on k-space.  In 4.1.2. the augmentation module seems to transform k-space into image domain and back to k-space after augmentation. This is very confusing.\n(4) In the supervised part, the Omega seems to be multiplied twice, before the f and inside of the f. Is it correct?\n- Figure 5 is mentioned in the paper but the figure is in the supplementary material.\n\n",
            "summary_of_the_review": "- The idea of augmentation is well known and straightforward.\n- Some parts of the papers are not clear and need improvements. E.g, figure 1 should be improved\n- More previous work should be added for comparisons.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        }
    ]
}