{
    "Decision": "",
    "Reviews": [
        {
            "summary_of_the_paper": "This paper uses an algorithm” TABULA” to replace garbled circuits for performing nonlinear functions for fast private neural network inference based on a semi-honest threat model reducing the communication, runtime, and storage cost. The work is based on Delphi's private inference framework via trusted third-party involvement. ",
            "main_review": "Pros: \n\n1. The proposed method is secure under the semi-honest setting since TABULA heavily utilizes PRFs (pseudo random function families) that all communication between server and client during the online execution phase is uniformly and randomly.\n2. The authors compared their work with prior private inference works benchmark (Ghodsi et al., 2021; Mishra et al., 2020a; Jha et al., 2021; van der Hagen & Lucia, 2021) at large image recognition neural networks such as VGG-16 for Cifar-100 achieving >60x communication reduction and >27x runtime speedup. \n3. This paper is well-written.\n\nCons:  \n\n1. This method can only be used in a small field (< 16 bits).\n2. This method requires a trusted third party (to both client and server) to compute. Although the authors claim that fully homomorphic encryption (FHE) could help remove the assumption of the trusted third party, it is not clear the specific implementation and overhead. Using FHE to remove this assumption should be essential to have a fair comparison with existing work like DELPHI.\n3. Accuracy: Using a 15-bit finite field prime achieves within 4 % error of the baseline accuracy, leading to a table size of 18 GB.\n4. Typo: at Section “Per-Input Preprocessing Phase”: For each linear linear layer\n",
            "summary_of_the_review": "The score is highly impacted by the threat model. Specifically, the proposed method and attached codes require a trusted third party (to both client and server) to compute. Although the authors claim that fully homomorphic encryption (FHE) could help remove the assumption of the trusted third party, it is not clear the specific implementation and overhead if FHE is used. Using FHE to remove this assumption should be essential to have a fair comparison with existing work like DELPHI.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "The paper proposes TABULA, a novel replacement for garbled circuits. The proposed algorithm performs single operand non-linear functions for secure computations in neural network inference and obtain very strong results under a semi-honest model. ",
            "main_review": "This is an interesting work tackling an important problem. The proposed solution seems to be effective in reducing the computational requirements of secure neural network inference. \n\nThe technique described in the paper appears to be sound, to the best of my understanding, and the results attained seem significant. \n\nI only have a minor reservation in terms of language. The authors seem to mix security (e.g., in Section 3.2) with privacy, (e.g., in the title, abstract, and introduction). The proposed technique is not a privacy-enhancing technology, but it ensures (computational advantages) for secure computations. I thus suggest the authors render their language homogeneous and talk about security, rather than privacy. \n\nI, unfortunately, am not able to judge the novelty of the approach, as this work lies outside my primary area of interest.",
            "summary_of_the_review": "This paper has strong results, but I cannot judge their novelty. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "The paper presents a two-party functionality (with trusted dealer) for non-linear functions over small enough domains and applies it to neural network inference.\n",
            "main_review": "The scheme does not achieve the claimed security. The server can tell if the client uses the same [x]_0 twice. Given the small size of the domain (~2^16), this is quite likely to happen when running more than a million times (~2^20).\n\nThe authors also have a rather narrow view of related work by only considering garbled circuits. There are results using purely secret sharing that are competitive with this work. For example, Kumar et al. (IEEE S&P'20) show a three-party computation of LeNet inference that takes 58 milliseconds without preprocessing.\n\nThe usage of homomorphic seems to assume that decryption reveals nothing beyond the cleartext (function privacy). This is not the case with the LWE-based homomorphic encryption used in SEAL. One needs to blind the noise to make this secure.\n\nMinor issues:\n- p1: tremendous runtime penalties (...) massive storage overheads (unscholarly language)\n- p1: O(n) (n not specified in the abstract)\n- Figure 1: I find the bullet points inappropriate in a paper.\n- p3: revealing as little information to either party beyond the model's final prediction (grammatically incorrect)\n",
            "summary_of_the_review": "The paper should be rejected because of a security issue.\n",
            "correctness": "1: The main claims of the paper are incorrect or not at all supported by theory or empirical results.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "1: strong reject",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        }
    ]
}