{
    "Decision": "",
    "Reviews": [
        {
            "summary_of_the_paper": "This paper focuses on the sparse gradient signal issue in previous semi-supervised object detection works. The papers shows that the heuristical feature level selecting design in FPN and hard pseudo labels will result in the sparse gradient signal issue. To address this issue, the paper proposes a multi-scale consistency approach by selecting features from all feature levels of FPN during the student model training, and uses both hard and soft pseudo labels. Experiments on PASCAL VOC and COCO with Faster RCNN + ResNet50 show that the proposed approach obtains better results than the previous state-of-the-art semi-supervised object detection approaches.",
            "main_review": "**Strengths**\n- The issue studied in this paper is interesting and the motivations are clear.\n- The proposed approach makes sense.\n- State-of-the-art semi-supervised object detection results.\n\n**Weaknesses**\n- Paper writing. The combination of hard pseudo label and soft pseudo label is an important part of the proposed approach. Importantly, the main performance gains of this paper are from such combination. However, the title of this paper may let readers thought the paper is mainly focusing on the multi-scale consistency part. Therefore, it would be better to change the title to show the real contributions of this paper (like showing the sparse gradient signal issue in the title).\n- Techinical contribution. The techinical contribution of the simple combination of previous works (soft pseudo label and hard pseudo label) is limited. \n- Extendibility. The proposed multi-scale consistency approach is mainly designed for Faster R-CNN based detectors w/ FPN. However, it is hard to be extended to other detector architectures w/o RoI selection and w/o FPN, like single shot based approaches and transformer based approaches.\n- Experiments. The combination of hard pseudo label and soft pseudo label is basically to sharpen the Teacher’s probability distribution ($p_{t}$). There are other ways to sharpen the probability distribution, like using temperatures [a]. It would be important to compare the proposed approach with such temperature based approach to show where the performance gains are really from.\n\n[a] MixMatch: A Holistic Approach to Semi-Supervised Learning",
            "summary_of_the_review": "In summary, the issue studied in this paper is interesting and the experimental results are very promising. However, the paper writing needs to be improved, the techinical contribution of the proposed approach is limited, the proposed approach is hard to be extended to other object detectors, and important experiments are missed, see **Weaknesses** in **Main Review**. Therefore, I would like to give a weak reject to this paper.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        },
        {
            "summary_of_the_paper": "In this paper, the authors propose a novel method to train the student network with multi-scale consistency in semi-supervised detection. Specifically, in the training, the student network extracts multi-scale feature from feature pyramid for an object and the teacher network also extracts feature for the same object. The consistency between these two features are used to train the student network and distill teacher’s knowledge to student network. Furthermore, the authors use hard and soft label to strengthen multi-scale consistency.",
            "main_review": "Strengths\n- The proposed method is easily implemented and this paper is well written and readable.\n- The experiments are solid and the ablation study clearly shows the effectiveness of each part.\n\nWeaknesses\n- Novelty. Though this paper has a great performance, the novel is limited. Multi-scale features, hard labels and soft labels can boost the performance, but these modifications is minor and does not bring new insights for this field.\n- Besides the conducted experiments in the paper, there is a meaningful experiments to do. Take COCO as labeled data and Open Images Dataset [1] as unlabeled data. Why is this experiment? For semi-supervised detection, its purpose is that the proposed method can boost the upper bound of performance constantly with increasing data.\n- The experiments in the paper is only based on Faster-RCNN and ResNet-50-FPN. Could you provide experiments with other detectors, such as [2] and [3]? Moreover, the experiments on strong detectors is also needed.\n- In Table 3, there is not the contribution only with multi-scale features. Could you provide?\n\n[1] Kuznetsova, Alina, et al. \"The open images dataset v4: Unified image classification, object detection, and visual relationship detection at scale.\"arXiv preprint arXiv:1811.00982 (2018). \\\n[2] Tian, Zhi, et al. \"Fcos: Fully convolutional one-stage object detection.\" Proceedings of the IEEE/CVF international conference on computer vision. 2019. \\\n[3] Chen, Qiang, et al. \"You only look one-level feature.\"Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition. 2021.",
            "summary_of_the_review": "I appreciate the highest performance of this paper, but I prefer to reject this paper for the above weaknesses.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        },
        {
            "summary_of_the_paper": "This paper proposes a novel approach for semi-supervised object detection by leveraging multi-scale features, which enforces a multi-scale consistency through a combination of oft and hard labels. \\\nState-of-the-art performance has been achieved on various benchmarks.",
            "main_review": "### Strengths\n\n* The paper is well-written with easy-to-read notations and descriptions. The approach is clearly presented and the empirical results are discussed in details.\n\n* The idea of combining soft and hard labels in multi-scale features between student model and teacher model is simple yet effective, showing consistent improvements across different datasets, and each of the component is validated in thorough ablation studies.\n\n### Weaknesses\n\n* **[Limited Novelty]** \\\nThough the authors claim that they are the first to apply this in semi-supervised object detection, the usage of multi-level features in object detection is not new, and the idea of enforcing consistency across multiple levels of features is also investigated in several previous works. \nHow this method differs to previous methods in using multi-level features should be presented more clearly in the paper, for example, more details could be given on how \"the Student model makes predictions using each level of the feature from the feature pyramid\" in Sec 3.2.\n\n* **[Clarity of RoI Selection in Soft Label]** \\\nAs claimed in the paper, the choice of RoI plays an important role in training student model, the authors should detail more about the RoI sample process in Sec 3.3 such as how the ramp-down sampling is done exactly and how much the performance would be degraded without this process.\n\n* **[Suboptimal Performance of Unbiased Teacher]** \\\nThough the global pipeline of this paper follows *Unbiased Teacher*, it does not report the correct numbers of the original *Unbiased Teacher* paper. The authors argue that they re-run *Unbiased Teacher* with a batch size of 16 for a fair comparison of the proposed method, but this result is suboptimal compared to the original *Unbiased Teacher* paper (e.g., for mAP on 1% COCO-standard, the authors report **18.33** for *Unbiased Teacher* while it's **20.75** in the original paper). Additional experiments following the same setting as *Unbiased Teacher* should be added for a real fair comparison.",
            "summary_of_the_review": "This paper proposes an interesting and simple idea to enforce multi-level consistency in semi-supervised object detection by leveraging soft and hard labels generated from different levels of features, which are extracted respectively by the teacher model and the student model. \\\nExperiments in several settings demonstrate its effectiveness, but a few more experiments (as propose in weaknesses) could be added to make the contributions more convincing.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        }
    ]
}