{
    "Decision": {
        "title": "Final Decision",
        "decision": "Accept (Poster)",
        "comment": "This paper considers a new setting of robustness, where multiple predictions are simultaneously made based on a single input. Different from existing robustness certificates which independently consider perturbation of each prediction, the authors propose collective robustness certificate that computes the number of predictions which are simultaneously guaranteed to remain stable under perturbation. This yields more optimistic results. Most reviewers think this is a very interesting work and the authors present an effective method to combine individual certificate. The experimental results are convincing. I recommend accept."
    },
    "Reviews": [
        {
            "title": "This paper proposes a new concept called “collective robustness certificate” that computes the number of predictions which are simultaneously guaranteed to remain stable under perturbation. ",
            "review": "This paper studies classifiers that collectively output many predictions based on a single input. Existing adversarial robustness certificates assume that an adversary can use different perturbed inputs to attack different predictions, and ignore the fact of a single shared input, thereby being overly pessimistic. This paper proposes a collective certificate that computes the number of simultaneously certifiable nodes for which the predictions can be guaranteed to be stable (not change). It is conducted basically by fusing individual certificates into a provably stronger certificate through explicitly modeling locality. \nPros: This is the first effort that considers collective robustness certificate. \nCons: \n1.\tAs discussed in the paper, the proposed approach is designed to exploit locality. Without locality, it is equivalent to a naïve combination of base certificates that sums over perturbations in the entire graph. \n2.\tThe writing of the paper can be improved. The abstract seems to be unfinished. It appears to be hard to include sufficient preliminaries to clearly describe the research problem in a conference paper. It’s probably better to have a longer version as a journal paper.  \n",
            "rating": "5: Marginally below acceptance threshold",
            "confidence": "1: The reviewer's evaluation is an educated guess"
        },
        {
            "title": "Interesting paper. Well-motivated. Good results",
            "review": "** Summary:\nIn the context of structured prediction, where multiple predictions are simultaneously made based on a single input, this works argue that existing robustness certificates independently operating on each node prediction end up with overly pessimistic results. Rather than that, this work advocates to collectively certify the overall accuracy using a single perturbed graph at a time. Starting from the building-blocks of base certificates, the authors formulate a global optimization problem, which is made tractable via a number of relaxation steps resulting in a final mixed-integer linear programming (MILP). Experimental results demonstrate clear advantage of the proposed certificates over base ones, with reasonable computational overheads coming from solving the MILP.\n\nThe paper is well-motivated, well-written and easy to follow. I think this is a valid method to assess robustness of classifier satisfying locality like GCN.\n\n** Strength:\n - This work is well-motivated. The arguments are valid on the limitations of independent based certificates for collective tasks. Experimental results convincingly show how such certificates are pessimistic in the addressed context.\n - The writing is clear and well-structured, easy to understand and follow. \n - Nice discussion on the limitations\n \n** Limitations:\n - Typos:\n \t+ Eqn. (2): $f_n(\\boldsymbol {X}^{'}, \\boldsymbol{A}^{'}) = f_n(\\boldsymbol{X}^{''}, \\boldsymbol{A}^{ \\textcolor{red}{''}})$\n\n \t+ Eqn. (7): $\\boldsymbol {X}^{''}_{i,d} = \\psi_i^{(n)}\\boldsymbol {\\textcolor{red}{X}}^{'}_{i,d} + (1-\\psi_i^{(n)})\\boldsymbol {\\textcolor{red}{X}}_{i,d}$\n \n \n\n** Justification of rating: overall this is an interesting paper. The motivation, arguments and results are convincing.",
            "rating": "7: Good paper, accept",
            "confidence": "3: The reviewer is fairly confident that the evaluation is correct"
        },
        {
            "title": "This paper first proposes a collective robustness certificate by fusing individual certificates into a provably stronger one, which significantly outperforms existing adversial certificates. Thus, I vote for accepantance.",
            "review": "This paper addresses the limitation of the existing adversarial robustness certificates that ignores that a single shared input is present, and thus assumes an adversary can use different perturbed inputs to attack different predictions. A novel collective certificate fusing single certificates into a stronger one, is proposed by explicitly modeling local structure of input data using graph convolution node classifiers. In terms of certified ratio, the collective certificate significantly improve the results compared with existing individual certificates. \n\n-quality: the technical quality is sound.\n\n-clarity: the input data, problem formulation and method are clearly described.\n\n-originality & significance: it is the first attempt in considering collective robust certificates (CRCs) by fusing individual adversarial certificate. As shown in the experiments, the certified ratio of the CRC is significantly improved over existing adversarial one. I think the collective robust certificate has some impacts for robust graph node classifications.\n\nPros: The paper is well motivated. The problem and the method are both clearly presented. The improvements of the collective robust certificate over the existing ones is sufficiently high in terms of certified ratios.\n\nCons: I do not find any notable weaknesses.",
            "rating": "6: Marginally above acceptance threshold",
            "confidence": "1: The reviewer's evaluation is an educated guess"
        },
        {
            "title": "great work but some comparisons could be missing.",
            "review": "Summary\n-------------\nCurrent methods on adversarial robustness certificates consider data points independently which are highly pessimistic for structured data. This work proposes the first collective robustness certificate that considers the structure of the graph by modeling locality in order to derive stronger guarantees  that the predictions remain stable under perturbations.\n\nThis work focuses on Graph Neural Networks comparing between a Naive collective certificate (baseline) and a proposed collective certificate that combines single-node certificates effectively. \n\nThe experiments compares these two methods against certified ratio vs. attribute and edge perturbations on the datasets Cora-ML, Citeseer, and PubMed.\n\nPros\n------\n- The paper is well-written and easy to follow.\n- The paper tries to address a very common problem of adversarial attacks where data points are structured. Although it is a common problem, it was not explored with respect to collective robustness certificates before this work.\n- The paper shows a novel, effective way of combining individual certificates by incorporating locality.\n- The paper presents an LP-relaxation method that allows us to solve the certificate fast for large graphs where mixed-integer problems are prohibitively costly.\n- The paper shows strong theory and experiments to illustrate the efficacy of the proposed collective certificate.\n- The experiments show run-time and uncertainty measures with multiple runs for statistical significance.\n\nQuestions\n--------------\n- Is there a reason why [1] was not discussed in the paper? it is highly relevant as it also studies adversarial robustness for structural attacks. \n- How does the proposed method apply to robust Associative Markov Networks (AMN) in [1]?\n- Did you try running the proposed method on WebKB and Reuters which are present in this work [1]?\n- How does the linear relaxation in this work differ from the one provided in [1]?\n- How would the proposed method compare against robust AMN [1]?\n- Can the findings be used to come up with robust methods outside classification, like segmentation and scene understanding?\n\nIn summary, I like the novelty of this method and the through experiments that were conducted that illustrate the efficacy of the proposed collective certificate, thus I recommend an accept.\n\n[1] Kai Zhou, Yevgeniy Vorobeychik. Robust Collective Classification against Structural Attacks. UAI 2020. \n\n------- Post rebuttal\nI am satisfied with most of the rebuttal the authors have provided, and I have raised my score to an 8. \n",
            "rating": "8: Top 50% of accepted papers, clear accept",
            "confidence": "2: The reviewer is willing to defend the evaluation, but it is quite likely that the reviewer did not understand central parts of the paper"
        }
    ]
}