{
    "Decision": "",
    "Reviews": [
        {
            "experience_assessment": "I have published in this field for several years.",
            "rating": "1: Reject",
            "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.",
            "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.",
            "title": "Official Blind Review #1",
            "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.",
            "review": "This paper proposes a way to enforce a partial ordering in the relation representations learned by a knowledge graph embedding model and outperforms KALE on FB122. However, it misses a larger set of related works in the knowledge graph learning literature and only compares on a subset of knowledge graph embedding tasks.\n\nMajor \nThere is a number of related works missing in this paper:\nOne of the early papers incorporating logical constraints into knowledge graph embedding models is: Rocktäschel et al. Injecting Logical Background Knowledge into Embeddings for Relation Extraction. in: Proceedings of NAACL-HLT. 2015.\nAn approach that does this for relation embeddings by enforcing a partial ordering is: Demeester et al. Lifted Rule Injection for Relation Embeddings. in: Empirical Methods in Natural Language Processing (EMNLP). 2016\nA recent method for incorporating logical constraints (such as partial ordering of relations) is: Minervini et al. Adversarial Sets for Regularised Neural Link Predictors. in: Proceedings of the 33rd Conference on Uncertainty in Artificial Intelligence (UAI). 2017 – a comparison to their numbers for FB122 should be added.\nMost state-of-the-art knowledge graph embedding models are also evaluated on FB15K237 and WN18RR that is missing from this paper and makes comparison to prior work hard – see Lacroix, Timothée, Nicolas Usunier, and Guillaume Obozinski. \"Canonical tensor decomposition for knowledge base completion.\" ICML 2018.\nThis is unrelated to the content of the paper, but in terms of style my suspicion is that the authors tinkered a lot with the LaTeX spacing in this submission. There are many places that look suspiciously crammed and squeezed together. This is not only violating the formatting instructions, but also makes the paper harder to read. Moreover, it seems also unnecessary as you could have gone up to 10 pages of main text. Moreover, citations are missing the year of the publication.\n\nMinor\np1: The argument \"cannot embed n-ary relations in KG's\" is a) not true (see Minervini et al. 2017) above and b) your experiments are also only on binary relations in FB122.\np2: \"such interpretable meta-learning opens up\" – in what way is this meta-learning?"
        },
        {
            "experience_assessment": "I have read many papers in this area.",
            "rating": "3: Weak Reject",
            "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.",
            "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.",
            "title": "Official Blind Review #3",
            "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.",
            "review": "The paper presents a new embedding based system for Knowledge Graphs (KGs). The main characteristic of the proposed system is that it is able to preserve the subsumption hierarchy between relations in the embedding space.\n\nThe proposed system seems valid and technically sound to me. However I have two main concerns:\nPresentation. The paper is full of typos (see [Details] below for some of them. The figures have several errors. TransE, TransH, TransR, KALE are cited without the references to the main papers. Moreover, it is rather confusing using the term relational space both for “relation vectors” and “relation hyperplane”. It seems the paper was written in a hurry and therefore it makes the paper hard to follow, it is a pity, because the proposed approach seems intriguing.\nExperiments. The system was evaluated on a small dataset. It is not clear if the proposed system can scale.\n\nFor these reasons I think the paper is not ready for publication and that a revision is necessary.\n\n[Details]\nPage 1.\n“R^dand”\n“(.” twice at the end of a citation\nFigure 2.\n“viweing”\n“His_family_of” is not defined anywhere\nFigure 2b. \nIt seems that all the relations are wrong\nPage 4.\n“(ex) A)”\n“(ex) B)”\n“space(Figure 3b)”\nWhen Figure 4 is cited the symbols and the names used in the text does not match with the ones in the figure\n“We evaluate TransINT on Freebase 122 (respectively created by Vendrov et al. and Guo et al.)”. These bibliographic citations do not make any sense. FB122 was released by Bordes et al.\n\n[Minor]\nThere is too little space between the text and the captions of the figures.\n"
        },
        {
            "rating": "3: Weak Reject",
            "experience_assessment": "I do not know much about this area.",
            "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.",
            "review_assessment:_checking_correctness_of_experiments": "I did not assess the experiments.",
            "title": "Official Blind Review #2",
            "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.",
            "review": "The authors propose TransINT, a novel graph embedding method that builds upon methods such as TransH (Knowledge graph embedding by translating on hyperplanes, Wang et al 2014), TransE (Translating Embeddings for Modeling Multi-relational Data, Bordes et al 2013), and appears to offer state of the art performance on the Freebase link prediction benchmark. \n\nThe manuscript is OK overall in terms of writing (although it could use some copy editing for grammar) and relevant to this community. This reviewer is not familiar with knowledge graph embeddings, and found it difficult to follow the main ideas and contributions. The introduction could certainly be written in a clearer way, first stating the general problem and then building up from existing solutions to the proposed method. Many of the figure captures seem to contain typos (details below), making it particularly confusing to follow. The results appear impressive, but I will leave it to reviewers with more experience in the field to judge how it stacks up against recent work. \n\nMinor comments:\n- In the first paragraph, there are two instances where closing brackets have been replaced by opening brackets. \n- Section 2, where transH is mentioned for the first time, it's missing a reference\n- Incomplete sentence \"Let ri be a binary relation x, y entities\".\n- Figure 2: h,t are not defined. is_family is mislabled as is_parent\n-Figure 3: The line for is_parent_of is mislabeled as is_mother of.\n-  Section 5, \"We evaluate TransINT on Freebase 122 (respectively created by ...\": What do you mean by \"respectively\" if there only Freebase 122 and no other dataset? Maybe forgot KALE here, it's mentioned a few sentences later for the first time and never defined.\n"
        }
    ]
}