{
    "Decision": "",
    "Reviews": [
        {
            "experience_assessment": "I have published in this field for several years.",
            "rating": "1: Reject",
            "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.",
            "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.",
            "title": "Official Blind Review #2",
            "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.",
            "review": "The authors present a new analysis pipeline \"BBSC\" for processing single-cell RNA-seq data based on a low-rank representation of gene expression. \n\nI have the following comments:\n\n1 - In the introduction, the method is motivated by an application in cancer, whereas the proposed pipeline is more generally applicable to any single-cell data\n\n2 - In order to reveal commonalities across subsets of cells with great variability such as cancer cells across patients, the authors propose a bi-state frequency model. However, the interpretation and appropriateness of this model for this problem is unclear. What do the burst frequency and k_size mean in the context of single-cell expression? The authors should motivate modeling assumptions using empirical observations and tests. \n\n3 - I also find the bi-state switching model for expression problematic given the sparsity (\"dropouts\") in scRNA-seq data which involves a low sampling (capturing) rate of transcripts per cell. Hence, we have a large portion of unreal zeros which could be confused with off states with this model.\n\n4 - I find the evaluation of the method especially on real data inadequate. First, the authors claim to infer more diverse subpopulations with BBSC which could be achieved with tuning parameters of many clustering algorithms to get a more refined clustering (e.g. reducing k in kNN-based clustering methods). Second, speculation based on a tsne map is not sufficient, since only local distances are preserved and global distances between discrete states in a tsne map have no meaning. Proper quantification of the difference and impact of BBSC is missing. Showing shared differentially expressed genes with no benchmark is not helpful. Finally, the method has not been compared to the numerous analysis methods for analyzing/clustering scRNA-seq data. See Chen, Geng, and Tieliu Shi. Frontiers in genetics 10 (2019) for a partial list.\n \nFor the above reasons, I do not agree that this method can reveal intra-cluster heteroegeneity.\n\nMinor:\nAbstract: \"new and clustering analysis\""
        },
        {
            "experience_assessment": "I have published one or two papers in this area.",
            "rating": "1: Reject",
            "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.",
            "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.",
            "title": "Official Blind Review #3",
            "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.",
            "review": "The authors provide a new method which they call \"bi-state and boolean matrix factorization for scRNA-seq data\" (BBSC) for clustering scRNA-seq data. It is based on a binarization of gene expression profiles into on/off states. Besides that they introduce \"PFAST“, a fast binary factorization (BMF) method, which adapts to the large scale of scRNA-seq data. With these techniques, the claim is that they are able to increase the resolution in identifying distinct cell types or functions. They apply their methods to head and cancer data, which reveals findings with a potential in preventing cancer progression.\n\nStrengths: An approximate gene expression bi-state model is proposed that is based on the frequency of expression occurrence and a binarization process. This concept of binarizing information in scRNA-seq data potentially enables to process the data with new methods that were previously not applicable\n\nWeaknesses: \n\n1. Only very specific genes work in a switch-like on off state with a viable threshold, there are many genes whose mode of operation are more analog with the level of the expression affecting responses. The authors do not distinguish between these types of genes nor hark to any prior literature on deciding what to discretize. \n\n2. There has been some literature by Saez-Rodrigues et al on boolean models of genes, the authors neither cite nor put their work in context of this. \n\n3. Within the characterization of on/off expression states, the parametric assumptions and the empirical assumption that the lowest none zero expression value of each gene approximates the error distribution, might not be right. \n\n4. The authors set up a \"strawman\" pipeline. Indeed there are some papers that make the mistake of using a 2-dimensional representation such as tSNE (which does not preserve density) to perform clustering. However, the majority of papers do not cluster ON TOP of tSNE and this is bad practice. Clustering on spectral dimensions, or community detection are more principled methods of processing data while simply using tSNE to visualize. The authors should use this more sensible pipeline to compare against. \n\n5.  Additionally, more details on and explanations of the silhouette score were missing.\n\n6. The authors do not do not offer enough background into boolean matrix factorization. For example they don't mentio cofactoring or BDDs which could be relevant here. In general, too much prior knowledge about binary matrix factorization is assumed. It should be further explained, otherwise it limits the usefulness for many people because they don’t see the value of the work.\n\n7. The PFAST algorithm is not well-explained. Within the section that explains PFAST, it is not a good argument to say that 95% of the noise has been eliminated to legitimate an extensive binary pattern mining.\n\n8. The formatting of the paper is not great. This involves the placement of pictures same as the algorithms. The algorithms should not only be formatted in a way that they are directly beneath each other, they also need to be more explained, as now it remains too unclear on what they actually do. "
        },
        {
            "rating": "1: Reject",
            "experience_assessment": "I have published one or two papers in this area.",
            "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.",
            "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.",
            "title": "Official Blind Review #1",
            "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.",
            "review": "Compared with classic analysis pipeline, the authors proposed BBSC as a new clustering analysis method for scRNA-seq data. In order to solve the BBSC pipeline, the authors proposed a fast and efficient BMF algorithm, named PFAST. The experimental report PFAST has the best experimental performance and takes the shortest running time. Overall, it is a complete research work on single cell analysis.\n\nThe related work in this paper is not enough. This paper only discusses the difference between the BBSC pipeline and the original method pipeline. The comparison algorithm in this article does not represent state-of-the-art. In my knowledge, there are many clustering methods for scRNA-seq, such as Biclustering (Zeisel et al. Science 2015), SC3 (Kiselev et al. Nat. Methods 2017), seurat 3.0 (Butler et al., Nature Biotechnology 2018. Stuart*, Butler*, et al., Cell 2019) and so on. I think the author should compare the method proposed in this paper with these methods. In particular, the method of seurat is currently a better method for single-cell clustering.\n\nIn single-cell clustering, we know that subclusters and subtypes are not a completely equivalent concept. This paper should do more analysis of subclusters results to support the viewpoint of this paper, such that they find more cell subtypes in real cancer data.\n\nThe paper is badly presented. The full name of this abbreviation should be clearly marked in the first occurrence of the abbreviation. Such as BBSC, PFAST, ASSO, PANDA and so on.\n\nThere are numerous grammar errors, e.g., there are over 4 grammar errors in the third sentence of the abstract “Current dimension reduction methods tend overly eliminate the expression variations correspond to less dominating characteristics, such we fail to find the homogenious properties of cancer development”"
        }
    ]
}