{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Accept (Spotlight)",
        "comment": "All reviewers agree that the proposed SphereFace2 approach - training face recognition models by using multiple binary classification losses - is interesting and innovative. The reviewers agree that the paper is well written and are satisfied with the presented experimental study. The rebuttal addressed all additionally raised questions. I believe that the paper will be of interest to the audience attending ICLR and would recommend a presentation of the work as a spotlight."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "This paper has proposed SphereFace2, a new face recognition training scheme that applies a set of binary classification losses to each identities in the dataset, to learn better face embeddings. The proposed method has addressed some limitations of existing training schemes, such as discrepancy between the softmax-based loss and the actual open-set face recognition scenarios. The proposed binary classification protocol works together with a series of optimization strategies, such as easy/hard sample mining and similarity adjustment, to achieve superior performance over state-of-the-art methods as shown in the extensive experiments.",
            "main_review": "### Strengths:\n1. The paper is well written with nice presentation and clear description.\n2. The proposed method has sound motivation, i.e., bridging the gap between the training process and the actual test protocol when deployed for open-set applications. The effectiveness of the key components are well illustrated from both intuitive and empirical perspectives with figures and statistics. \n3. The new loss formulation also benefits parallel training setup which are widely adopted nowadays.\n4. Extensive experiments have been conducted to ascertain the final outstanding performance of the proposed method.\n\n### Weaknesses:\n1. The beginning of this paper may be misleading. The problem of multi-class softmax-based training when switched to the open-set deployment has been noticed in many early works, such as [25] [27], where contrastive loss and triplet loss were used to address this problem. In this paper, however, the Abstract, Paragraph 1 and the first sentence of Paragraph 2 did not mention this fact and therefore may mislead readers to believe that this work is the first to address this issue.\n2. Some statements are vague or unclear, such as:\n    * The authors claim that softmax loss introduces competition among different classes. What is the definition of \"competition\"? Even using the proposed loss function, the feature embedding still receives gradients from all the classes (1 positive and N-1 negative classes) in one training iteration, could that also be a kink of inter-class competition?\n    * The categorization of proxy-free and proxy based is unclear. Why is using softmax loss and its variants considered proxy-based (like [28]) but using combination of softmax and contrastive loss is considered proxy-free (like [27])?\n    * I didn't understand the example given for similarity adjustment, where the text says \"if g(cos(theta)) is ... range of [-0.2, 1], we can end up with cos(theta) ... becoms [-0.9, 1].\" But looking at the formulation and Figure 6, it seems that when t > 1, cos(theta) is within [-0.2, 1] while g(cos(theta)) is within [-0.9, 1]. I am not sure if I misunderstood anything and expect more details from the authors feedback.\n    * In the end, how is the verification threshold is determined? Based on the validation set or is there a theoretical value? If the threshold is determined from the results on the validation set, how to understand the claim that the proposed method eases the difficulty of choosing a verification threshold compared to other methods?\n3. In addition to new formulation of the binary classification training protocol, there are multiple components contributing to the final performance, including sample balancing, easy/hard sample mining, angular margin and similarity adjustment. It is hard to judge which component is play a key role to the results. Looking at Table 2, without SA, the performance (93.87%) is on par with other state-of-the-art works such as ArcFace (93.97%). However, SA can also be applied to other loss functions, then what is the actual benefit by using the binary classification loss formulation?",
            "summary_of_the_review": "This paper has proposed a relatively new idea on training face recognition models by using multiple binary classification losses. The proposed method has convincing motivation and the technical design is reasonable. Experimental results ascertain the superiority of the proposed method as a unified solution. However, some statements of the paper are misleading or vague. Moreover, as the proposed method comprises multiple effective components, it is also unclear that whether the performance improvements come from the new formulation or from one or two incremental components.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        },
        {
            "summary_of_the_paper": "This paper proposes a novel face recognition model called SphereFace2. The key idea is to replace the softmax-based multi-class training with multiple binary classification training, which is more consistent with the testing phrase and generalized to both closed/open-set evaluations. To make this novel strategy works, the authors defined some principles in designing an effective loss function, including (1) Positive/negative sample balance, (2) Easy/hard sample mining, (3) Angular margin, and (4) Similarity adjustment. SphereFace2 outperforms the state-of-the-art face recognition models on 1:1 verification and 1:N open-set evaluation benchmarks. It also allows model parallelization that effectively speeds up the training process when multiple GPUs are available.",
            "main_review": "** Strengths\n- The discussion on the advantages of the multi-binary classification strategy is interesting and persuasive. I like the comparison between triplet-based learning and pair-based learning in Figure 2.\n- Since the naive solution does not work, the authors proposed some principles in designing an effective loss function. These principles are effective in designing a good loss function, as shown in Table 2.\n- The authors did a good job on explaining the proposed components via geometric interpretation.\n- SphereFace2 outperforms the state-of-the-art face recognition models on 1:1 verification and 1:N open-set evaluation benchmarks. \n- It also allows model parallelization that effectively speeds up the training process when multiple GPUs are available.\n\n** Weaknesses\n- The Positive/negative sample balance technique is a bit simple. In fact, the authors manually tuned the hyper-parameter \\lambda to get a desirable results while the simplest configuration does not work well (the first row in Table 2). There are existing techniques to handle data imbalance such as focal loss. It is better to have a comparison to these available options.\n- The authors did not provide the final values of the hyper-parameters (λ, r, m, and t)\n- SphereFace2 performs worse than SphereFace in 1-N rank-1 Indentification tests\n- In Section 3.2 and 3.3, the authors used CosFace as the baseline for comparison. ArcFace is a better option.",
            "summary_of_the_review": "Overall, this paper presents a novel face recognition model, called SphereFace2, with interesting insights and persuasive explanations. The proposed model outperforms the baselines on popular 1-1 verification and 1-N open-set evaluation. Despite few minor issues, I lean towards accepting this paper.",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "details_of_ethics_concerns": "No ethical concern.",
            "recommendation": "8: accept, good paper",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This paper presents a binary classification training framework, SphereFace2, for face recognition. Instead of multi-class classification, the proposed method adopts pair-wise comparisons learned through a well-designed loss function, which is more suitable for open-set evaluation. Comprehensive experiments demonstrate the effectiveness of the proposed method.",
            "main_review": "Pros:\n- Different from the commonly used multi-class classification, the proposed method uses binary classification to reduce the gap between training and open-set testing, which addresses the face recognition problem from a new perspective.\n- The principles for the designed loss function are well-motivated and clearly explained. The geometric interpretations also help to better understand.\n- The experiments are comprehensive, and show the state-of-the-art performance of the proposed method.\n- The paper is well-written and easy to follow.\n\nCons:\n- In Sec 3.1, the hyperparameters are analyzed with different values. In Sec 3.2, since the backbone network has changed, which hyperparameter setting is adopted? It would be better to clarify this.\n- Some results in the text seem to be inconsistent with those in the tables. For examples, in p .8 l. 3, 93.73% (93.87% in Table 2); in p. 8 l. 7-9, 5.37%, 2.74%, 3.50%, and 3.52% (5.78%, 2.70%, 3.09%, and 3.02% in Table 6).\n- A few typos, e.g., p. 9 l. 13, Table 6 -> Table 7.\n",
            "summary_of_the_review": "The idea of using binary classification learning to cope with face recognition is well-motivated and reasonable. The framework and loss function design are also clearly explained and further demonstrated by experiments on benchmark datasets. Although there may be some minor errors, I think this is a good paper, and would vote for accept.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        }
    ]
}