{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Reject",
        "comment": "Four experts reviewed this paper and rated the paper below the acceptance threshold. The reviewers raised many concerns regarding the paper, mainly the lack of empirical studies and clarity. Some reviewers also suggested the authors better positioning the paper in the literature by discussing more related works. The rebuttal did not address all concerns. Considering the reviewers' concerns, we regret that the paper cannot be recommended for acceptance at this time. The authors are encouraged to consider the reviewers' comments when revising the paper for submission elsewhere."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "The authors present some analysis and describes a new methodology on how to do forward/inverse causal inferences with tensor analysis. There are no empricial results nor theoratic analysis to back the authors' claims.  ",
            "main_review": "This paper is hard to read. Even though I read multiple times, I'm not sure if I fully understand this paper. The idea to connect tensor analysis with casual inferences is good but this paper doesn't have enough contexts. \n\nSome issues:\n\n- There are a few typos and incorrect latex references that impacts the reading experiences. For example:\n  - In the second paragraph in page 2, \"by proposing a causal capsule hierarchy of parts and wholes that is consistent the capsule theory\" should be \"consistent with the capsule thoery\".\n  - In the second last paragraph in page 2, there are two \"?\" in the citations after \"which may result in t\napproximate subspace\".\n  - Right above section 3.2 in page 8, there is a \"Fig ??\" after \"not just a complete observation,\".\n- It would be better to provide some empricial results to show the effectness of the proposed models. The face recognitions task is used as an example in many places in the paper, but there are no experiments to evaluate how the proposed model performs.\n- It's worth to discuss what kind of tensors are suitable for the proposed model. It's also worth to show the proposed model can run in a reasonable speed for modern datasets. ",
            "summary_of_the_review": " I don't think this paper is ready to be read. I think there are many places that can be improved.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "This paper tried to build the connection between tensor factorization and capsule network, and a forward causal inference with causal capsule method was proposed. However, since there is no theoretical justification or experimental evaluation, I cannot judge the effectiveness of the proposed method.",
            "main_review": "My main concern with this paper is the effectiveness of the proposed method. Since there is no experimental evaluation, I don’t know how well the proposed method will perform in real problems. Also, if this paper claims a theoretical contribution, there should be strong theoretical justifications about the advances of the proposed method. However, I only see the method descriptions instead of in-depth theoretical analyzes. Besides, this paper is very hard to follow. It is not well structured and has many typos. \n",
            "summary_of_the_review": "I think this paper's contributions are not well justified. Given its current status, I cannot vote for its acceptance. ",
            "correctness": "1: The main claims of the paper are incorrect or not at all supported by theory or empirical results.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "This paper is an attempt to connect tensor factor analysis with DNN learning. The paper explores the forward causal inference and inverse causal inference problems. The forward causal inference is performed using causal capsules architecture that uses M-mode SVD for subspace learning (autoencoder). The authors show that the M-mode SVD rotates the basis vectors of various clusters such that the causal representation is the same regardless of the data cluster (Fig.1). They introduce causal capsule hierarchy architecture that uses tensor decompositions for forward and inverse causal inference. ",
            "main_review": "Pros:\n1. As far as I understand, the authors provide a causal invariant representation of the data in a subspace. The representation can be used for streaming tasks. \n2. The cascade idea depicted in Fig. 5 is neat!\n3. The extension to non-linear Causal capsules using kernels is intuitive and nicely introduced.\n\nConcerns & questions:\n1. The paper is confusing to read. The motivation and the flow of the paper is tedious to follow. This might be due to the lack of knowledge on my end. Although, I am fairly familiar with causality theory (by Pearl etc.), capsule networks and tensor decompositions. The authors should provide more background in their paper.\n2. It will be great if the authors can include some set of experiments to demonstrate the benefits of their approach in practice. \n3. I can foresee some issues with the scalability of this work. I request the authors to highlight them in the paper. This will be a good indicator of how useful this technique can be for real world applications.\n4. Missing citations on Pg. 2 and some minor typos. \n",
            "summary_of_the_review": "I would be more confident about my review of the work, if the authors can include some set of experiments in the paper. It will be very helpful if the authors can point out the benefits over the existing SOTA techniques on why to use their proposed causal representation. Some comments on the scalability of their approach will also be appreciated. \n\nI am willing to reconsider my ratings if the authors address some of my concerns.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "The authors present a framework in which Tensor Factor Analysis is incorporated in a causal graph structure implemented by a series of \"capsule\" auto-encoders.  The rationale is that these capsules can be combined in some way to create meaningful hierarchical architecture useful for causal inference.",
            "main_review": "Strengths:\n* the paper adresses an important and timely problem: that of causal discovery\n* the paper proposes an innovative approach to combine Tensor Factor Analysis with capsule network architecture that uses auto-encoding architectures\n\nWeaknesses:\n* This paper suffers from a major lack of clarity in writing. Here are some important points\n- The introduction essentially lists a number of papers that use Tensor-Decomposition for various applications but does not clearly identify a gap in knowledge or a problem that will be addressed by the contribution. It states that the paper seeks to \"connect tensor causal factor analysis with deep learning\" but does not adequately articulate why this is needed or a good idea.\n- There is a lack of clarity in definitions: (i) several acronyms are not defineds (e.g. MPCA/MICA). (ii) in section 2, equation (1), there is no desciption of the variables (what is d, B, c ?) (iii) Throughout all figures appear to show image recognition/classification tasks but nowhere is the task or computation described. (iv) formatting is not at the level of publications (Figures are not referred in the text in the order they appear, a number of citations are compiled with an error showing \"?\", punctuation and sentence construction is as mishandled in a number of areas).\n\n*Most crucial is the lack of experimental evidence. The figures appear to show some image recognition task that is never described and there is no comparison with other methods, nor any description of the advantages of the proposed method.\n\n*Conclusion is quasi non-existant and there is no discussion about future directions for this work and how it may be improved in the future.\n",
            "summary_of_the_review": "In my opinion, this paper is not clearly written, and does not contain compelling and convincing evidence that the proposed method adresses a gap in knowledge or improves on current method. It suffers from major structural problems as outlined in detail above. It is quite possible that the contribution is, in fact, significant but I could not evaluate it because of these issues. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        }
    ]
}