{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Reject",
        "comment": "This paper develops a deep convolutional network with RNN layers and \na new data augmentation method for EEG motor imagery classification.\n\nReviewers agreed that the paper was not very clearly written, and that\nwithout comparisons to other related methods or at least demonstration \nof the importance of each of the components of the model (through for \nexample ablation analyses), it was hard to understand the generality\nof the approach.\n\nThe authors did not respond to the reviews, so I am recommending not  \naccepting this paper."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "This paper proposes a model combining convolutional operation and recurrent operation along with temporal attention for EEG classification. ",
            "main_review": "Strengths:\n1. The topic of EEG classification is meaningful. \n\n2. The modified class activation mapping (Grad-CAM) is interesting to me.\n\nWeaknesses:\n1. The representation is not clear. To me, the challenges, motivation, solutions, or contributions are not clearly expressed. For example, \n\n- Since the title mentioned 'short-interval EEG', then what's long-interval EEG? What's the difference and how do existing studies treat them differently?\n\n- Sec. 1 uses two long paragraphs to show the limitations of traditional approaches, which are all well known. Please condense them into one paragraph. \n\n2. Lack of novelty. Using standard deep learning models (and attention motivation) for EEG recognition is ok in 2018, but now, we expect more technical novelty. In specific, the CNN, RNN, excitation and squeeze, and FUlly-connected layers are very commonly used and intensively studied components in the last 5 years. \n\n3. Weak experiments. \n- This work only compared with one baseline, which is not enough. I am also confused that what is exact the baseline mentioned in Table 1? I cannot find descriptions about the baseline's model/structure/citation. \n\n- This work claims its effectiveness by 'outperforming the 1st place winner by 4%' (in Abstract and Results). However, the BCI IV competition is in 2008! It is not amazing that the proposed model is better than a winner in 2008.\n\n- The work lacks lots of studies on DL-based EEG analysis in recent 3 years. Please find my recent works and compare them. ",
            "summary_of_the_review": "As I mentioned in the above weakness, this manuscript is not presented well, the technical novelty is not significant, and the experiments are not extensive. I suggest a strong rejection.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "1: strong reject",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        },
        {
            "summary_of_the_paper": "The paper proposes a short-interval MI classification system. The model is a convolutional RNN with temporal attention.",
            "main_review": "It is the opinion of the reviewer that following are the strengths and weaknesses of the paper.\n\nStrengths:\n- The paper is generally well-written and structured.\n- Good results are achieved.\n\nWeaknesses:\n- The proposed method is quite simple (Conv RNN + att), unfortunately with no novelty or innovation. Similar methods have been widely used in the past, even in the field of EEG representation learning, e.g. Zhang et al., Classification of Hand Movements from EEG using a Deep Attention-based LSTM Network, 2020\n- Only one dataset (BCI IV 2A) is used. Therefore, it is very unclear how the method generalizes to other datasets. \n- No in-depth analysis of the length of the window sizes (i.e., \"short interval\") is carried out.\n- The model details are not all give, and so the work is not reproducible. \n- A comprehensive comparison with other methods in the field is missing. \n\nBased on the shortcomings mentioned above, unfortunately the paper is very far from the level of ICLR.",
            "summary_of_the_review": "-",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "1: strong reject",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        },
        {
            "summary_of_the_paper": "The authors introduce a deep learning approach for short-time motor imagery classification using EEG data.  Conventional CNN and RNN - GRU layers are used. Remarkably, a data augmentation strategy and a class-activation mapping approach are presented. Overall, the idea is interesting, but the paper presentation, the mathematical foundation, and the experiments provided are poor. Therefore, more details about the model and other experiments should be carried out to validate the proposal. Besides, the authors claim that short time interval EEG classification is achieved; however, 0.8s windows size does not seem to be a \"short interval\" compared to other state-of-the-art methods.",
            "main_review": "Pros.\n\n-An interesting data augmentation algorithm for EEG time-series classification.\n-A class activation mapping approach for EEG data is presented.\n\nCons. and comments\n\n-The paper presentation is poor. For example, the introduction is confusing, lacks suitable state-of-the-art analysis, and does not provide the proposal's paragraph.\n-The results should include other motor imagery databases. The influence of the number of EEG channels and the inter and intrasubject variability must be studied to test the availability of a \"short interval.\" For example, see:\nhttps://academic.oup.com/gigascience/article/6/7/gix034/3796323\nhttps://physionet.org/content/eegmmidb/1.0.0/         \n-The mathematical details should be enhanced for an iclr paper.\n-Please provide the codes and the experimental details.",
            "summary_of_the_review": "A good idea is presented concerning the data augmentation and the cam-based extensions for EEG data. Nonetheless, the short interval claim seems to be ambiguous. Several details regarding the mathematical background and more experiments should be conducted to test the proposal. In addition, the paper presentation needs to be enhanced.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        }
    ]
}