{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Reject",
        "comment": "The paper proposes a new neural network, the aestheticNet, for a bias-free facial beauty prediction.\nAll the reviewers agree that the work is not suitable for publication as it raised some serious ethic concerns:\n* Prediction of beauty (aesthetic scores) is a potential harmful application. Well-intended as it may be, a research along these lines might be harmful.\n* non-anonoymity issue: writing reveals/implies authors identity with reference to previous work\n* Research integrity issues (e.g., plagiarism, dual submission), a figure is copied from previous work.\n\nThere is also a concern that the work is not novel and not interesting as such. \nThe authors did not respond to the concerns.\n\nI suggest rejection."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "Paper proposed aestheicNet in order to solve the problem of bias in beauty prediction.",
            "main_review": "- Motivation for this type of work is lacking. What can be gained from beauty prediction, even if it is unbiased?\n- Hypothesis 1 is known, this is not a new hypothesis. The paper cites works (Gerlach et al, Akbari) that show that hypothesis is true. It is not clear what is learned from H1. \n- Hypothesis 2 is also known. This is one of the main problems with bias in AI. The human biases we have are in our AI systems. It is not clear what is learned from H2.\n- Section 3.1 - What is the Asia-Europe dataset that is evaluated? What does this dataset have to do with the benchmark dataset used?\n- Proposed architecture is not novel. It is a modified version of VGG Face. It is also not clear what these modifications are.\n- Training based on GANs is not new and has been done extensively in AI/ML. \n- Only using Chinese and German faces is bias in itself. What insight can be gained from this? As beauty is dependent on ethnicity, this work can not generalize to anything else.\n- What is the definition of attractive, unattractive, and average face? This definition is inherently biased by ethnicity and age. How can it be defined here?",
            "summary_of_the_review": "There is no supporting motivation for this work.  The paper makes claims of debiasing \"beauty\" predictions. These claims are not supported. Two ethnicities are used, which is inherently biased. The hypotheses in the paper offer no new insight as the paper cites works that have shown similar before. If it is known the hypothesis is true, there is no need to test it.",
            "correctness": "1: The main claims of the paper are incorrect or not at all supported by theory or empirical results.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "Yes, Potentially harmful insights, methodologies and applications"
            ],
            "details_of_ethics_concerns": "Prediction of beauty is a potential harmful application. Only women are evaluated in this study. There are too many biases in \"beauty\" prediction for a system to solve as the paper claims.",
            "recommendation": "1: strong reject",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        },
        {
            "summary_of_the_paper": "This paper proposes an AestheticNet and a new approach to bias-free machine learning tools. The former shows a higher Pearson correlation coefficient and a lower mean absolute error than competitive approaches. The latter helps to train an unbiased network with biased data for facial beauty prediction.",
            "main_review": "Strengths:\n1. The proposed AestheticNet achieves state-of-the-art performance on SCUT-FBP5500 and is significantly better than the competition. \n2. The proposed bias-free machine learning tools consist two parts: “balanced training” and a categorical cross entroy loss function. The experimental results show that these two reach the goal of unbiased predictions.\nWeaknesses:\n1. The proposed network has not been elaborated and lacks some ablation experiments.\n2. The judgment for unbiased networks is based on the ability of the network to output similar average aesthetic scores for Asians, Europeans, and all mixed-racial portraits. However, since the faces of different subsets keep changing, how to ensure that the actual attractivenesses of these different subsets have similar unbiased scores?\n3. There are typos (eg. “then” in the third line of the conclusion should be “than”), and the labels of the charts are too small (eg. the chart on the left side of Figure 9). ",
            "summary_of_the_review": "The main contributions of this paper are AestheticNet and a new approach to bias-free machine learning tools. The results look sound but some details are not elaborated (See the main review for details). I think this paper is marginally above the acceptance threshold.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "Yes, Privacy, security and safety"
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "The paper proposes a method to build an unbiased CNN for facial beauty prediction.",
            "main_review": "There is severe anonymity issue in this work. Also there is overlap with an existing work (Gerlach et al 2020).\n\nPlease see 'ethics concern'  for more details.",
            "summary_of_the_review": "I'm rejecting the paper because of breach of anonymity. Moreover, the work lacks novelty. Please see 'ethics concern'  for more details.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "Yes, Research integrity issues (e.g., plagiarism, dual submission)",
                "Yes, Other reasons (please specify below)"
            ],
            "details_of_ethics_concerns": "I believe there exists anonymity issue in this work.\n\nIn Section 1 (Motivation), the authors write :\n\n\"Our data analysis has already proven that people consider their own ethnicity to be more attractive than others (Gerlach et al., 2020), this is the major bias in our experiments and within our dataset.\"\n\nAlso, Figure 1 is copied from Figure 10 and 11 from (Gerlach et al 2020).\n\nReference (Gerlach et al 2020): Tobias Gerlach, Michael Danner, Le Peng, Aidas Kaminickas, Wu Fei, and Matthias Ratsch. ¨ Who Loves Virtue as much as He Loves Beauty?: Deep Learning based Estimator for Aesthetics of Portraits:. In Proceedings of the 15th International Joint Conference on Computer Vision, Imaging and Computer Graphics Theory and Applications, pp. 521–528, Valletta, Malta, 2020. SCITEPRESS - Science and Technology Publications. ISBN 978-989-758-402-2. doi: 10.5220/0009172905210528. URL http://www.scitepress.org/DigitalLibrary/ Link.aspx?doi=10.5220/0009172905210528.",
            "recommendation": "1: strong reject",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        },
        {
            "summary_of_the_paper": "In this paper, the authors study the problem of bias in facial beauty prediction problem. To this end, they first show that there do exist bias in an existing dataset. Then, they show that deep networks trained with such a biased dataset do capture and reflect the bias. Finally, they propose two solutions for addressing such bias.",
            "main_review": "In this paper, the authors study the problem of bias in facial beauty prediction problem. To this end, they first show that there do exist bias in an existing dataset. Then, they show that deep networks trained with such a biased dataset do capture and reflect the bias. Finally, they propose two solutions for addressing such bias.\n\nStrengths:\n- Bias is an important problem.\n- Extensive analysis is provided.\n\nWeaknesses:\n- The most critical issue with the paper is the novelty. Neither the results or the insights nor the proposed methods are new or adding anything on top of the existing findings or solutions.\n\n- The paper should utilize existing bias and fairness metrics from the literature and prefer to use such metrics for discussing the results instead of ambiguous descriptions.\n\nMinor comments:\n- The second paragraph of the abstract feels somehow disconnected with the first one. In any case, the abstract should provide more information about the experiments & the obtained results regarding fairness.\n- Figures 1 and 2 are way too small to comprehend.\n- \"Figure 1: Chinese and European annotations\" => The legend uses \"Caucasian\" instead.\n- \"to prove whether hypothesis 1 is true\" => \"Prove\" is a very strong word. I would suggest \"support\".\n- \"Figure 1 and fig. 2\" => Please be consistent.\n- \"Our training results have a very high accuracy and outperform state-of-the-art results.\" => I think you should refer to Table 1 here.\n",
            "summary_of_the_review": "Novelty is unclear. The paper just confirms existing findings and does not introduce any novel method.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "1: strong reject",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        }
    ]
}