{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Reject",
        "comment": "Ricci flow is a central topic in geometric analysis. It has had stunning applications in mathematics, most notably the proof of the Poincare conjecture. The major issue is that it, while it can be used to make a manifold more well-behaved, it frequently develops singularities. The main contribution fo this paper is in introducing linearly nearly Euclidean metrics. They give a proof of convergence in both short and infinite time, under the Ricci-DeTurk flow, and exploit connections to information geometric and mirror descent to develop methods for approximating the gradient flow. The paper is confusingly written (compounded by poor organizational structure and many grammatical mistakes). Perhaps the biggest issue is that it does not have any clear relevance to machine learning. Some sections mention connections to neural networks, but the reviewers found these sections to be indecipherable."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "The paper proposes a linerization method for ricci flow that is used for manifold surgery which makes the process more robust. ",
            "main_review": "The paper is heavily theoretic and expects a lot of background knowledge in differential geometry from the reader. I do have some background but I was not able to follow every detail in the derivations given the short review period. I am especially not familiar with the term micro-surgery for Ricci flows, there is no citation for this concept and any explanation I was able to find did not make sense for how it is used in this paper for me. The main idea of linearizing the Ricci flow to increase the robustness sounds meaningful to me, and as far as I can tell the math behind it looks convincing (though I did not check all details). \n\nThe paper does not describe the context in which it exists (as in there is no related work section, and what related work is mentioned is about properties of manifelds). It is not clear to me what the method has to do with the topics of ICLR, there is no mention of which papers use Ricci flow for anything, and the results are also not clear in how this method is used on CIFAR exactly. This is my major critisism of this paper, as someone who is not an expert in this topic, it was impossible for me to find a starting point to judge the contributions and novelty. \n\nThe main paper does not present any experiments, and the experiments in the appendix on CIFAR are neither properly explained, nor was I able to interpret them (also due to the lack of description of the experiment setup). The authors only claim that \"Actually, the change in metric is not so obvious\" which I must interpret as it did not really work. I see that this is a very basic theoretical work, and I would have been fine with experiments on artifical and simplistic data but the complete lack of any positive results does not raise faith. ",
            "summary_of_the_review": "First of all, this is not my area of expertise, and the review period was too short to go into all the mathematical details. Therefore, it might as well be possible that this is quite genius and I was just not able to see it. However, the paper does not explain the impact of its contribution or its applications well, does not have a proper related work section, and the results are half hidden in the appendix and their positive aspects not explained. \nI have rated reject because putting contributions into context through the related work (while often annoying and seemingly just taking away space) is an essential part of a paper and skipping over this leaves the paper incomprehensible for many people.\nMy ratings on correctness and novelty are only approximations, and I would not oppose acceptance if the theory has strong supporters in the other reviewers. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "2: You are willing to defend your assessment, but it is quite likely that you did not understand the central parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "The paper concerns the Ricci flow and surgery to handle singularities occuring during the Ricci flow. The authors propose linearly nearly Euclidean metrics that they prove are stable under the Ricii-DeTurck flow. The authors use this to approximate steepest descent gradient flows in information geometry and state that they obtain a new method for geometric optimization on manifolds.",
            "main_review": "Ricci flows and the techniques involved in the study of Ricci flows such as surgery are no doubt a very exciting topic. The authors survey existing results on the Ricci flow and the occurrence of singularities. They continue to define nearly Euclidean metrics and prove various properties of these. I have not carefully checked the correctness of the survey and the presented results.\n\nThe sections on divergences, gradient flows and approximations with neural networks are largely unreadable. I did not succeed in understanding what the authors which to demonstrate here and what is the application. What do the authors mean by sentences such as \"we dynamically consider the gradient flow followed with the optimal descent direction on this manifold\" and \"Therefore, this gradient flow is a weak approximation under the manifold micro-surgery.\"? What is the underlying manifold and metric in section 4.3 on approximations with neural networks?\n\nUnfortunately, the point of the last sections is unclear to me. Because of this, it is not clear what is the contribution and point of the paper besides a survey and discussion of some very exciting mathematical topics.",
            "summary_of_the_review": "Unfortunately, while I very much appreciate the topic and the underlying mathematics, I find the paper and presentation in its present form to be too unclear that I can recommend acceptance.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "1: The contributions are neither significant nor novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "This paper investigates linearly nearly Euclidean metrics on Riemannian manifolds under the Ricci flow. Analysis, focusing on the stability and convergence of the evolution of such metrics, is presented. In addition, the utility of the analysis for measuring the approximation of gradient flow in the context of training neural networks is demonstrated.",
            "main_review": "The paper presents seemingly new theoretical results and sets the stage for the analysis of gradient flow used for training neural networks. For me, the most interesting finding is the remark in Sec 4.2 stating that \"When we use the gradient flow to learn a neural network ($\\xi(t)$ is composed of weights), we observe the evolution of its metric is consistent with the micro-surgery process under\nthe Ricci-DeTurck flow\". Unfortunately, this argument is not well supported in the paper, and only a small empirical test is shown in Appendix C.4.\n\nConsidering the venue (ICLR), I believe the paper is currently unbalanced. On the one hand, this is a theoretical paper presenting new analysis, which is interesting and is a contribution by itself. On the other hand, too much focus is put on the math, and I am sure how much it is of interest to the ML community. In contrast, the utility of the analysis for training neural networks using gradient flow is of major importance to the community, but it is not well treated in the paper. If the authors wish to publish their work in such ML conferences, I would recommend moving much of the analysis into the appendix and focusing instead on the utility, by describing in more detail the setting and the connection between the analysis of the evolution of this linearly nearly Eulicdean metric under the Ricci flow and the gradient flow and/or by extending the experimental study significantly.",
            "summary_of_the_review": "Interesting new theoretical results, but the connection to gradient flow is lacking",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "Not applicable",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        }
    ]
}