{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Reject",
        "comment": "This paper extends a recent approximate dynamic programming method (i.e., DP with neural networks) for a ride sharing problem.\nAn elegant trick is proposed to obtain a more expressive function approximation without suffering a combinatorial explosion of the action space. While the idea is somewhat ad hoc in its implementation, and limited in novelty w.r.t. the ADP work that the paper builds on, the empirical performance improvement on the ride sharing problem is clear. \nInitially, the reviewers also raised several clarity and presentation issues, but the authors did a good job in addressing them in their rebuttal.\n\nThe reviewers gave scores of 5,8,5. The main critique is limited novelty.\nDuring the discussion, we focused on the novelty of the approach, whether the ideas can be generalized beyond the very specific ride sharing problem, and whether the work is strong enough if viewed as an application paper.\nThe conclusion, which my final decision is based on, is that currently, the contribution is very specific to the ride sharing problem, and it is not clear whether this idea can be extended to more general optimization problems. This means that the scope of the algorithmic approach, taken with respect to the ICLR audience, is rather narrow. On the other hand, the current presentation does not meet the bar of a strong application paper, as there is not enough novelty in the problem and data.\n\nMy advice to the authors is to broaden their investigation and evaluation. Another option would be to target a venue that is more focused on the ride sharing problem."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "This paper considers the ridesharing matching problem and builds the solution upon NeurADP. The main contribution over NeurADP is that the action values of each agent (vehicle) takes into account the impact of its action on the neighboring agents within the same cluster, which is obtained through clustering of the intersections on the road network. The impact of agent's action on neighbors is measured by the neighboring agents' independent values weighted by their action probabilities conditional on the agent's action. Benchmarking was performed on the NYC taxi data set against NeurADP. Results on different values of tolerance for delay, capacity, and number of vehicles are reported, and a significant improvement is demonstrated in all cases. ",
            "main_review": "Strengths\n- Ridesharing (pooling) is a challenging domain for RL/ADP. The paper presents an incremental step forward on top of NeurADP for the matching problem.\n- The paper proposes a way to incorporate agent interactions with neighbors without relying on joint action values, which suffer from the curse of dimensionality.\n- Different values of problem configuration parameters are investigated in the experiments.\n- The experiment dataset is public so that reproducing the results is possible.\n\n\nWeaknesses and comments\n- The paper uses the number of completed requests as the problem objective. In practice, a common measure for ride-pooling is the ratio between the sum of completed individual trip distances (as if they were fulfilled as single trips) and the total distance that the drivers actually travel to fulfill those requests. This metric measures both the amount of request fulfilled and the quality of the pooling.\n\n- The proposed estimation of agent interaction effect involves a handcrafted conditional agent probability based on a softmax over distance between destination pairs. There's no empirical justification on this choice. Why should the probability based on how far away are the action destinations? And, matching decision is ultimately a system decision, so shouldn't it be learned from data of system decisions?\n\n- Figure 3: This may not be the impact of enforcing positive values. This is just showing that CEVD learns the individual values better than NeurADP. It could be because of its consideration of impact on neighboring agents. I suggest the authors do a more careful ablation study to separate the effect of multiple algorithmic differences.\n\n- Section 4: For finding optimal \\lambda, I don't see \\lambda appearing here in the expression. How did you tune it exactly?\n\n- The paper claims that the algorithm can be executed in real-time setting. However, the decision epoch in practice is much shorter, only a few seconds. A run time of 60 seconds to compute a matching decision is way too slow for 'real-time execution'.\n\n- There are too many mentions of \"e.g., Uber, Lyft, and Grab\". Once is good enough, and we all know they are well-known ridesharing companies.",
            "summary_of_the_review": "The paper improves upon NeurADP by proposing a way to incorporate agent interactions without resorting to joint action values. While there's some merit in technical contribution in this regard, there are a number of major issues in algorithmic justification and empirical validation. ",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "This paper focuses on the ride-pool matching problem to efficiently allocate combinations of user requests to vehicles online under quality constraints and matching constraints. Intending at this, the authors come up with a conditional expectation based value decomposition (CEVD) method. ",
            "main_review": "The proposed approach in the paper considers the impact of other agents actions on individual value by computing conditional expectations to improve the overall performance. The experimental results verify that the CEVD is an effective method for improving the overall requests served by 9.76 compared to the baseline, which seems promising. This work is quite innovative and the paper is generally well-written. Some concerns are shown as follows:\n\n-- The background of the abstract is a little longer.\n-- The first paragraph should be the definition of Approximate Dynamic Program (ADP) rather than FV because the definition of FV was given in the previous paragraph.\n-- The mathematical symbols of this paper are a bit too many, and it is recommended to list a table to show the meaning of each symbol to facilitate the reader to understand the paper.\n-- I am very confused about the data features used in K-Means to cluster intersections to clusters. As stated in the last paragraph of page 5, the function M is clustering locations. But in the second paragraph of section 5 experiments, it says that K-Means clustering is based on the average travel times between different intersections. So which feature is used? locations or average travel times? This needs to be explained clearly and it is crucial to experiment setups. \n-- In Section 6 conclusion, I highly recommend to the authors to add more open issues and future directions of their work.\n",
            "summary_of_the_review": "In general, the paper makes very solid work and is suited to be published in ICRL.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "8: accept, good paper",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "This paper studies an RPM problem (ride-pool matching problem) for on-demand transportation services. This problem is recently studied in various papers, but it is hard to choose a good matching by just using a bipartite graph matching due to the future demands, and it is an online decision-making problem.\n\nA recent breakthrough, NeurADP by [Shah et al. 2020], has shown a good performance, but the proposed approach in the paper, CEVD, achieved much more performance gain (reported as 3.8%-9.76%), which has a significant impact on the ToD service. An essential technique of the proposed CEVD is considering the effect of other agents (i.e., other vehicles) when estimating the value of actions.",
            "main_review": "# Pros and Cons\n\n## Pros\n- The performance gain achieved by the paper is quite significant from the application perspective.\n- The idea of considering the effect of other agents seems to be correct and valuable for multi-agent decision-making problems like ToD systems.\n- The computational efficiency is shown (i.e., the optimization is done within the batch time of 60 seconds).\n\n## Cons\n\n- Some notations are not clearly defined, and it is hard to follow the details of the CEVD and its idea.\n\n# Comments\n\nTo clearly understand the paper and clarify its score, I would like to clarify the following point.\n\n(I) Many notations in Sec. 2 are not explained or defined. These notations or missing explanations make readers hard to follow the proposed study and know the difference between NeurADP and CEVD.\n\nThe below are examples.\n\n(I-1) Eq.(1): What is $[\\mathcal{U}]^{c'}$?\n\n(I-2) Between Eq.(2) and Eq.(3): What are $T^a(\\cdot,\\cdot)$ and $T^\\xi(\\cdot, \\cdot)$?\n\n(I-3) Page 4: What is $V^i(\\big\\langle r_t^{i,a}, r_t^{-i,a}\\big\\rangle)$? I cannot follow this $\\langle\\cdot\\rangle$ notation.\n\n(I-4) Page 4: What is the definition of $r_t^a$?\n\n(I-5) Page 5 before sec 3.1: $\\sum_{j\\in E}$ means $\\sum_{j|(i, j)\\in E}$? What is the difference between Pr and P?: $\\mathit{Pr}(a_j\\mid a_i, s)$ and $\\mathit{P}(\\text{Agent j takes action g | Agent i takes action f})$.\n\n(I-6) Page 5: What is the definition of $P^j$. Agent $j$'s probability?\n\n(I-7) Page 6: What is the definition of $s_t^{i,f}$?\n\n(I-8) Page 7: What is the definition of this bracket $[g_t, F_t]$ of $\\xi_{t+1}$?\n\n(II) What are 'other issues' of the over/under estimation of individual values in FV and DJV? (Page 6). Please give an example of such issues.\n\n(III) In optimization (sec 4), the proposed method estimates $\\theta, \\lambda, \\alpha$ step by step. Please clarify the property of this optimization problem. Are the resulted $\\lambda^\\star,\\alpha^\\star,\\lambda^\\star$ are globally optimal?\n\n(IV) Please clarify the relation between experimental results with the size $N$. That is, experimental results are reported only with $N=500, 750, 1000$. However, some research have modeled the ToD service with more agents (e.g., 3000 agents in [Alonso-Mora et al. 2017]), and therefore, I'm interested in more details of this aspect.\n\nFor example, the authors reported that \"The average time taken to compute each batch assignment using CEVD is less than 60 seconds (for all cases)\". Is this due to the size $N\\leq 1000$ or not?\n\nFurther, are computational results affected by the clustering ($k$-means) or not?\n\n(V) Please clarify the overview of the computation of CEVD (e.g., with a pseudo-code or system overview). What are the input and output? How is the ILP solver (CPLEX) used? Which part consumed the time within 60 seconds? I guess that such additional information is helpful for readers.",
            "summary_of_the_review": "To the best of my knowledge and experiences, the achieved performance of CEVD seems to show important progress on the ToD services. The computational times and settings are reasonable.\n\nHowever, the paper contains some unclarified notations. It is hard to follow the details of the proposed method. I want the authors to give more explanations and clarify some parts to help readers, which is also important to increase my review score.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "5: marginally below the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        }
    ]
}