{
    "Decision": {
        "title": "Paper Decision",
        "decision": "Reject",
        "comment": "The paper describes an interesting approach to predicting continuous closed surface segmentations from discretized image data using a wavelet output representation. This is an interesting idea with a lot of potential. Unfortunately, the paper currently suffers from major weaknesses which we encourage the authors to address.\n\n1. While the idea of generating a continuous output representation of a segmentation is technically interesting, what are some applications where this is actually useful?\n2. The ground truth annotations in the datasets evaluated are implicitly quite variable. The annotations are not made to sub-pixel precision and there is likely to be large multi-pixel variability across different annotations of the same image. This makes a poor problem to demonstrate the need and potential of a sub-pixel accurate segmentation algorithm.\n\nI encourage the authors to find applications and datasets where reliable sub-pixel ground truth annotations exist, and to demonstrate that their approach to generating sub-pixel segmentations is superior to appropriate baselines which also predict sub-pixel segmentations."
    },
    "Reviews": [
        {
            "summary_of_the_paper": "In this paper, the authors propose a novel deep learning framework for the fast prediction of boundaries. The boundary is modeled as smooth closed curves with wavelets and multi-resolution analysis. A U-shape model is trained to predict for coefficients of the curve. The proposed method is evaluated on medical images and achieves similar performances with up to 5x faster inference speed.\nThe main contribution is that it is the first to use wavelet analysis to construct pixel-independent representations of curves.\n",
            "main_review": "Strengths:\n1. It is the first work to construct pixel-independent representations of curves instead of pixel-based output, which provides new insight into using wavelet analysis on segmentation tasks.\n\n2. The proposed method achieves up to 5x faster inference speed and competitive scores compared with a U-Net model.\n\nWeaknesses:\n1. The presentation of mathematic is complex and hard to read due to many notations. Also, it can be quite hard for readers to obtain a clear overview of the learning pipeline. It'd be better to demonstrate with figures.\n\n2. It lacks the details of the decoder in the model, especially how the reconstruction process is performed in the decoder. It can be difficult to reimplement the model. It'd be better to demonstrate with figures.\n\n3. The experiment results are not convincing enough. More experiments on other datasets are needed. The improvement of the proposed method is not obvious as compared with the baseline model. It lacks explanations on the reason for using these (j1,j2,j3) settings in the experiments. \n\n4. It lacks explanations on the reason and motivation that it conducts wavelet analysis on the boundary instead of the object itself. \n\n5. Some sentence is ambiguous.\nIn the first paragraph of Section 3, ‘…is henceforth assumed to have two components denoted by [y(x)]1 and [y(x)]2’ how is the two components generated?\n\n6. Some typos are listed below.\nIn the abstract, ‘…the upsampling path is a one-dimensional decoder’, ‘a’ should be ‘an’.\nIn the second paragraph of subsection ‘detail coefficients’, ‘…states that the subspaces Wj can too be spanned by dilating and shifting a single map’, ‘too’ is redundant.\nIn the third paragraph of section 3.2, ‘The encoder is followed by a a bottleneck …’, ‘a’ is redundant.\n",
            "summary_of_the_review": "The paper provides novel insight into medical image segmentation. The technical introduction is sufficient and makes sense. The experimental results support the theoretical part. \n\nIt can be hard to read and reimplement. The improvement over the baseline is not obvious.\n",
            "correctness": "4: All of the claims and statements are well-supported and correct.",
            "technical_novelty_and_significance": "4: The contributions are significant, and do not exist in prior works.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "3: You are fairly confident in your assessment. It is possible that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work. Math/other details were not carefully checked."
        },
        {
            "summary_of_the_paper": "The paper proposes a method for boundary extraction from images using a U-net type network architecture. The boundaries are considered as closed curves represented by multiresolution analysis (wavelets). The down-sampling part of the network consists of a 2D encoder and the up-sampling part is a 1D decoder that reconstructs the boundaries.",
            "main_review": "Strengths:\n1) In contrast to the related literature, where pixel-based segmentations are provided, the output of the proposed method is a closed curve.\n\n\nWeaknesses\n1) The extensive presentation of multi resolution analysis could be avoided as the theory is well known. More experiments could strengthen the paper.\n\n2) A figure clarifying the network layers and the corresponding detail coefficients would be welcome to graphically explain the network architecture in section 3.2 and how the coefficients are associated with the skip connections.\n\n",
            "summary_of_the_review": "Although an important part of the paper presents well-known theory, I like the idea of estimating closed curves and I suggest accepting the paper.",
            "correctness": "3: Some of the paper’s claims have minor issues. A few statements are not well-supported, or require small changes to be made correct.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "5: You are absolutely certain about your assessment. You are very familiar with the related work and checked the math/other details carefully."
        },
        {
            "summary_of_the_paper": "This paper presents a method for segmentation using wavelets and Multi Resolution Analysis.\n But the presentation of the paper needs to be improved to highlight the technical novelty and difference from the state-of-the-art algorihtms.\n\n",
            "main_review": "Strength: the use of wavelets and mulit-resolution analysis could be new.\nWeakness: the paper is not well presented. \n1) Section 2 could be simplified.\n2) The motivation of the paper is not clear. Why it is subpixel?\n3) The authors shall highlight their contributions and clarify the difference from the state-of-the-art algorithms.\n4) It is not clear if the use of wavelets and multi-resolution analysis is a significant contribution or not.\n5) I suggest the authors to draw a diagram of their network.\n6) The improvement seems marginal compared with U-net\n7) There are many methods for segmentation that shall be cited and compared.",
            "summary_of_the_review": "Given the weakness stated above, I felt that the paper is not strong enough.",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "empirical_novelty_and_significance": "2: The contributions are only marginally significant or novel.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "3: reject, not good enough",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        },
        {
            "summary_of_the_paper": "In this paper the authors propose a mixed approach to image segmentation using CNNs and wavelets. Although this approach is not new, to the best of the reviewer's knowledge, it is the first time it has been applied to medical image segmentation. It basically consists of applying an encoder-decoder structure in which the encoder is a CNN and the decoder is based on a traditional (Pyramid Algorithm) Wavelet method. To validate the proposed method, they compare their results with a general and complete CNN method. The results demonstrate that it could be a powerful approximation: fast, accurate and easy to train.",
            "main_review": "The article is well written although it is complex to follow.\nThe mathematical introduction is quite dense. Besides, there are some functions that are not defined (such as L(Z) and l(Z)), which makes it difficult to understand the article for those who do not know how Wavelets work. The state of the art is quite good given the space limitations although it would have been nice to go a bit deeper into the differences with respect to previous proposals (apart from the subpixel resolution).\n\n However, the main weaknesses of the paper are:\n1.- Although there are other similar approaches (and even with sub-pixel level segmentation) using wavelets the authors compare with a generic segmentation approach based on a classical encoder-decoder structure.\n\n2.- From the approach with which they compare, they fix the hyperparameters but do not justify why (and do not adjust them to improve the results). \n\n3.- In the comparison, the authors do look for the best hyperparameters of their approximation by comparing the best one with the (prefixed) approximation of the generic method. This dilutes the \"power\" of the results obtained. ",
            "summary_of_the_review": "Pros:\nThe paper is well written and the proposal is very interesting from the point of view of the medical image segmentation.\n\nCons:\nThe mathematical explanation must be improved to help the understandability of the paper. \nThe validation of the proposal must be compared with other wavelet proposals.\nAuthors should be fairer when adjusting the hyperparameters (not limited to the proposed model). ",
            "correctness": "2: Several of the paper’s claims are incorrect or not well-supported.",
            "technical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "empirical_novelty_and_significance": "3: The contributions are significant and somewhat new. Aspects of the contributions exist in prior work.",
            "flag_for_ethics_review": [
                "NO."
            ],
            "recommendation": "6: marginally above the acceptance threshold",
            "confidence": "4: You are confident in your assessment, but not absolutely certain. It is unlikely, but not impossible, that you did not understand some parts of the submission or that you are unfamiliar with some pieces of related work."
        }
    ]
}