{
    "Decision": {
        "title": "Final Decision",
        "decision": "Reject",
        "comment": "The approach proposed here have raised major concerns from multiple reviewers especially concerning the novelty and the experimental validation procedure. Authors did not succeed in convincing reviewers of the value of their work for ML or calcium imaging processing."
    },
    "Reviews": [
        {
            "title": "Interesting, but straightforward applications of GANs",
            "review": "In this paper, the authors construct a GAN network for generating artificial calcium imaging activity from large neural populations. This is an interesting but relatively straightforward application of GANs in a neuroscience context. Unfortunately, I don't see the pressing need for such methods, and the analysis in the paper leaves me unconvinced that the author's method works really convincingly.\n\n* Need: The authors motivate their method with experimental hurdles to recording large ensembles of neurons, but recent years have seen a dramatic improvement in this respect (see e.g. work of Steinmetz, Pachitariu, Stringer and colleagues) who routinely record from 1000s of neurons. The authors should carefully think about what their method allows one to do that is not possible with real data.\n\n* Evaluation: I don't understand why the authors chose to evaluate their method on the deconvolved spikes. Surely this is interesting as well, but I would have liked to see actually more of the generated data and more evaluation on the generated data directly. From Fig. 2 it seems e.g. that the noise characteristics of the generated data are quite different than for the true data. Is this the case? The DG generated data is very hard to judge, since neither the artificial or generated data are shown, just summary statistics in Fig. 1.\n\n* Clarity: I would have liked to see a clearer explanation of what goes into the network and what comes out. Somewhere, they mention a sliding window approach - a figure would go a long way.\n\n* What was the role of the Wasserstein objective function? Where others tried? What was their outcome?\n\n* Table 1: How was the DG model for the experimental data estimated? Combining a normal DG with the forward model of Friedrich? \n\n\ntypo: p8: ref to Donahue is having () in wrong place  ",
            "rating": "4: Ok but not good enough - rejection",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "Official Blind Review #3",
            "review": "Summary:\nThe paper proposes to use a GAN framework to generate the realistic neuronal calcium signals, enabling to scale-up the neuronal population activity data. The solution is based on WAVEGAN architecture with Wasserstein distance to train on calcium fluorescent signals. The experiments are performed in comparison to artificial calcium signals with known ground-truth closely resembles the underlying data distribution. The accuracy of the approach, robustness of generated signals from the model are evaluated.\n\nStrengths:\n- The application is very relevant as an increase in calcium imaging samples helps analyze large populations of neurons.\n\nWeaknesses:\n- This paper lacks contribution, and the novelty of the work is limited in terms of methods.\n- Fig.2 does not actually show significant activation locality in the corresponding neurons; the peaks are not present in the generated signal for Neuron 27, similarly for Neuron 75 (completely mismatched with recorded data).\n- This is further confirmed by Fig.3, where the generated markers are scattered across all the neurons in time, the neuronal activity irrelevant to recorded activity.\n- Figures 3, 4, and 5 are not very informative as no legend is included. \n- Here, the author aims to increase more realistic calcium signals for analysis of neuronal population, but how it will be useful for the healthcare/research community in terms of applications is not clear.\n- In Fig.2, the generated recording does not have an inspired spike for the Neuron 27. Please clarify this.\nDetails for reproducing the experiments of dichotomized gaussian data are left unclear.\n\nMajor Comments:\n- Why are the Pearson correlation values low (i.e., between -0.25 and 0.25)?.\n- Please clarify whether the Pearson correlation is calculated between the recorded signal and the generated signal?.\n- What is the performance when the model trained on real calcium signals recorded from the primary visual cortex of behaving mice and tested on artificial data?\n- Suppose, if authors perturb the real calcium signals data, is it affecting the model performance?.\n- Typos:\nAbstract: Here we propose (Here, we propose)\nIntroduction: paragraph-1, high quality (high-quality)\n\nAddressed Concerns:\n- corrected the typos\n- Some figures are updated\n \nNot Addressed:\n- Figure 1b is not uniform as 1a (legend information is missing)\n- As mentioned in weaknesses: the novelty aspect of this work is missing.\n- Further, the authors have not answered question 1 in major comments.\n- Based on Fig 2 & 3, Calcium GAN generated signals are mismatching with recorded data. How one can deploy this model in real-time when model results are not identical at all?.\n ",
            "rating": "5: Marginally below acceptance threshold",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "Effective calcium imaging trace generation but lacks demonstrated utility",
            "review": "This manuscript proposes a GAN-based approach to generate calcium traces of neurons by using adapting methods from Wasserstein GANs and WaveGAN to produce the traces.  Using OASIS to extract spikes gives similar patterns to real data on a variety of metrics. This is confirmed over a relatively large number of neurons.\n\nThe big pitfall of this manuscript is that the authors have not demonstrated the scientific utility of their method.  The purported rationale, \"Generative models of neuronal activity hold the promise of alleviating the above problem by enabling the synthesis of an unlimited number of realistic samples for assessing advanced analysis methods,\" is not shown.  The motivation about how generative approaches can provide additional data to find higher-order relationships is fraught: perhaps the advanced analysis techniques would find more patterns by augmenting fake data, but it doesn't really increase the scientific confidence nor address the fundamental uncertainty due to limited data.  While there are some cases where research groups have used GANs to help advanced analysis techniques, such as in domain adaptation and semi-supervised learning, those cases are not shown here, nor is it clear how to build them in.  This paper needs to be revised with a clear use case to motivate it.\n\nPros:\n\nThe manuscript is clearly written, and shows an effective use of GANs to mimic scientific data.\n\nSignificant exploration of the results are shown.\n\nCons:\n\nThe metrics shown compare derived properties of the traces, not the traces themselves.  This is limiting.  In Figure 2, the real data and synthetic data have clearly different noise levels and background patterns.  If the results are visually different in a relatively small figure, it points that more exploration of the traces themselves and the generative quality needs to be explored.\n\nThe title suggests that \"calcium imaging data\" is being generated, but that's not really true.  Instead, the calcium traces on individual neurons are being generated, which is a derived product from calcium imaging data.  Perhaps this is just semantics, but it's misleading and should be clarified up front.\n\nAs in the major point, no clearly elucidate use case.\n\nThe lack of conditioning (on trials, behavior, unlying spike train) is a major limitation, since for most scientific applications we care about recovering these properties.",
            "rating": "3: Clear rejection",
            "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"
        }
    ]
}