{
    "Decision": {
        "title": "Final Decision",
        "decision": "Reject",
        "comment": "This paper proposes a framework for artificial life. In the framework, there is no primitive agent construct, but rather a set of basic recurrent network components (such as linear algebra operations). The framework is open-ended and objective-less. The authors describe the emergence of different organisms out of these building blocks, illustrating the idea with a simplified implementation.\n\nThe paper is extremely original, at least in the context of the deep learning/ICLR community. At the same time, together with a majority of reviewers (mostly experts in relevant topics such as neuro-evolutionary methods and artificial life), I felt that this work is not ready to be presented at a major conference, for three main reasons. 1) It should make its links to the huge literature on artificial life outside the ICLR community clearer. 2) The empirical work is somewhat limited and 3) this is not counterbalanced by a clear theoretical roadmap.\n\nI thus do not recommend acceptance, although I really hope the authors will present a more thoroughly worked out version of the paper soon.\n"
    },
    "Reviews": [
        {
            "title": "Too explorative/especulative; the paper lacks some crucial references.",
            "review": "The paper describes a framework for artificial life, where basic building blocks are artificial neural networks (ANN) elements (matrix multiplication, and other linear algebra operations), intended to be open-ended and without any guiding objective. The authors emphasis that in their proposed approach there is no predefined distinction between environment and agents, as they attempt that the 'physics' of their proposed framework allow agents to emerge on their own. \n\nPros:\n- The paper is very well written. Language is clear at times, the paper is well organized and the there is no overuse of math notation.\n- The framework advanced by the authors seems solid enough to experiment on the emergence of life. \n- Results need to be further analyzed, but they are encouraging at this stage of the research.\n- Paper provides in-depth, or even philosophical, discussion relating topics such as emergence of life and current advances in computer science. It is very re-freshing to read a paper that is not only about surpassing other methods by a marginal score in benchmark datasets.\n\nCons:\n- Although the paper provides a thorough discussion on related work, it is surprising that it does not make more emphasis on results related to cellular automata. Conway's Game of life seems to comply with their main aim at developing an environment where no distinction between agents and environment is made, and where agents emerge on their own. It would be good if authors provide a bit of contrast discussion on this issue.\n- There are some strong claims across the paper or concepts being left without neither references or definitions. For example:\n1. In Sec. 2.1 authors introduce the concept of \"general intelligence\". What exactly does that mean?\n2. Also, in Sec. 2.1 authors claim that human brain computation closely resembles recurrent networks, but they do not provide a reference that backs such strong statement. Last time I check, there was little evidence that processes similar to backpropagation were happening in the brain, let a alone that artificial neurons models are now considered poor approximations of actual neurons.\n3. The whole idea that life is objective-less can be controversial. A recent hypothesis [1] actually suggests that the life's objective is to accelerate entropy, that is, that emergence of life-like molecular structures, and even evolution itself,  are only a consequence, or even a particular case, of second law of thermodynamics. Authors should be more careful when dealing with such motifs.\n\nReferences:\n1. England, J. L. (2013). Statistical physics of self-replication. The Journal of chemical physics, 139(12), 09B623_1.",
            "rating": "8: Top 50% of accepted papers, clear accept",
            "confidence": "1: The reviewer's evaluation is an educated guess"
        },
        {
            "title": "Official Blind Review #1",
            "review": "This is an interesting paper that proposes a particular Alife framework to study the question of how to create an AI-generated algorithm. In the proposed system, each cell in a 2D grid-like environment is controlled by a different neural network. As far as I understand it, these neural networks are randomly mutated without rewarding the overall system for any particular objective. The authors study some of the dynamics that emerge from this framework.\n\nWhile the main ideas in this paper are exciting (especially they idea that there is no direct concept of an agent),  it currently feels more like a workshop paper than a fully-fledged ICLR paper. Results are very preliminary, and while the emerging dynamics look interesting, the paper is missing a more systematic study of how different settings effect them. Additionally, I am slightly sceptical how these interesting patterns can lead to actual AI-generating algorithms. Without a task or some minimum criteria, what would drive the evolution of this system towards increasing complexity?\n\nIt would also be useful to further highlight the implications of this work for the larger ML and ICLR community. While certainly of interest to the Alife community, the potential importance of Alife domains for learning representations should be mentioned in more detail.\n\nAdditionally, some related work on neural cellular automates is missing:\n- Growing Neural Cellular Automata, Mordvintsev et al.\n- CA-NEAT: Evolved Compositional Pattern Producing Networks for Cellular Automata Morphogenesis and Replication. Nichele et al\n\n[After rebuttal: Increased my score from 4 to 5. Still think the approach needs some more work to appeal to the broader ML community and in its current state would be best suited for a conference focused on Alife]\n",
            "rating": "5: Marginally below acceptance threshold",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        },
        {
            "title": "I am torn about this submission. On one hand, it discusses very important problems - the emergence of complex mathematical structures out of simple rules, on the other hand, it seems to lack substantial technical results to significantly contribute to these important problems.  ",
            "review": "The work follows the idea of artificial life on a computer and proposes to use RNNs as building blocks with simple rules of exchanging information between those individual RNNs on a grid. \n\nThe main weakness of this submission is the lack of the mathematical formulation of the algorithm that is used for generating the complexity. There are only two formulas in the manuscript: sections 2.1 and 3.1, which basically say that the authors consider a general dynamical system in discrete time with many degrees of freedom. This is not sufficient to explain the mathematical procedure used to arrive at figure 2. \n\nThere are many non-linear dynamical systems that can generate complexity (some of them are mentioned in the manuscript). Typically, the larger the number of degrees of freedom is, the more complex behaviors one obtains. The authors consider an extreme case when the overall dynamical system is composed of a collection of RNNs, with synaptic weights learned using some learning rule (unspecified in the manuscript). It is not surprising that a non-linear system with so many degrees of freedom can produce complex behaviors. \n\nThe authors present beautiful pictures of weights produced by their system. However, I do not understand if the authors are claiming that their dynamical system is somehow more meaningful than other more traditional counterparts. If so, I would appreciate a mathematical definition of the system considered, and a justification of this claim.  Or maybe the authors are saying that the precise mathematical form of the update rules for h and W is not important (and that’s why they don’t write them down explicitly in the manuscript) because they belong to some universality class, which often happens in studies of non-linear systems. Then, it seems necessary to provide evidence for this claim.  \n\n——————————\n\nThank you for your response. I have read the revised paper and the discussion with other reviewers. While I still think that the overall problematic discussed in this paper is important, I am not satisfied with the revisions. I think the paper would benefit from more technical content and clear mathematical definitions of the procedures used. I have updated my score to a reject. \n",
            "rating": "4: Ok but not good enough - rejection",
            "confidence": "3: The reviewer is fairly confident that the evaluation is correct"
        },
        {
            "title": "Stimulating topic, but description of scientific objectives, methodology and contributions should be improved",
            "review": "\nThis paper discusses an artificial life approach to artificial intelligence, through 1) first discussing some general principles that may be useful in artificial life/chemistry systems from the perspective of open-endedness; 2) sketching an experimental system aiming to implement these principles and showing preliminary qualitative results. While the paper discusses a number of ideas that are highly relevant to AI and should be better known by the AI community, the paper has also some weaknesses and is not currently in a form that is ready for publication.\n\nStrengths:\n+ This paper's topic is a nice opportunity to enable the AI/ML community to know better about Alife approaches to artificial intelligence\n+ The particular topic of open-endedness is also highly relevant, including in the perspective taken in this paper where one aims to model complex dynamical systems that do not assume a pre-defined concept of agent/individuals. This is useful in helping researchers in the AI community to deconstruct some of the assumptions of the models they are working on\n\nWeaknesses:\n- The paper does not explain clearly the relevance of the Alife approach to AI, in particular it does not explain well the historical roots of this idea that could enlighten AI readers (e.g. discussing foundational work such as Brooks and Steels, 1995), and does not analyze what fundamental contributions where made in the past, and what were the limits.\n- Related to the point above, the paper does not position itself clearly in this vast literature: both the general/theoretical ideas and the experimental framework discussed overlap significantly with the large body of work in Alife. Clear statements of contributions would be useful.\n- It is not clear what is the concept of \"(general) intelligence\" considered here, and whether there is a real value/utility in using this word, as opposed to saying the family of systems discussed in the paper is for studying the \"self-organization and evolution of complex structures\". Formulating the general problematics around theoretical questions on the origins and evolution of complexity would also enable better linking with the literature in the sciences of complexity and theoretical biology, which is not sufficiently made in the current version of the paper.\n- It is not clear what is the logical rationale of the listing of principles considered in the paper: what is the scientific objective of this list of principles? how can one measure/evaluate their utility? where do they come from? Also, there seems to be some (at least apparent) inhomogeneity between them, e.g. point 1 says \"there should be no built in notion of an individual\", but point 2 says \"the evolution of new emergent individuals create novel opportunities...\" --> point 1 reads like an assumption while point 2 reads like a desirable emergent property.\n- The proposed SIM system lacks formal definition (e.g. precise pseudo-code enabling precise understanding and reproducibility)\n- While the paper aims for a general system with \"general neural network controllers inside much fewer elements\", in practice the system appears to have a lot of specific elements (e.g. physical/enzymatic systems) that are less generic than several recent work generalizing cellular automata as grids of neural networks with multiple kernels, e.g. Chan, 2020; Mordvintsev et al., 2020; Gilpin, 2019. Thus, it is not clear which properties are more general/differ/more useful than these other works\n- There is no proposed methodology for evaluating the success/failure/progress of the approach: e.g. how could one characterize the self-organized structures that are qualitatively observed in the preliminary runs presented in the paper? What are precisely the scientific questions addressed by experiments, and how can experiments answer them?\n\nI recommend the author(s) frame more precisely their work in terms of scientific objectives and links with the conceptual history of alife approaches to AI. The framing of the scientific objectives would benefit from a clear formulation of the scientific questions addressed, and a strategy for measuring progress towards answering them (in addition to the strategy for developing experimental tools presented in the paper, which requires more details to enable better understandability and reproducibility). \n\nReferences:\n\nBert Wang-Chak Chan. Lenia and expanded universe. arXiv preprint arXiv:2005.03742, 2020.\n\nBrooks, R. A., & Steels, L. (Eds.). (1995). The artificial life route to artificial intelligence: building embodied, situated agents. L. Erlbaum Associates.\n\nWilliam Gilpin. Cellular automata as convolutional neural networks. Physical Review E, 100\n(3):032402, 2019.\n\nAlexander Mordvintsev, Ettore Randazzo, Eyvind Niklasson, and Michael Levin. Growing neural cellular automata. Distill, 2020. doi: 10.23915/distill.00023. https://distill.pub/2020/growingca.",
            "rating": "3: Clear rejection",
            "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"
        }
    ]
}